Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/contributing.po
Languages: es

source: How to contribute to Flask
es: Cómo contribuir a Flask

source: Thank you for considering contributing to Flask!
es: ¡Gracias por considerar la posibilidad de contribuir a Flask!

source: Support questions
es: Preguntas de apoyo

source: Please don't use the issue tracker for this. The issue tracker is a tool to address bugs and feature requests in Flask itself. Use one of the following resources for questions about using Flask or issues with your own code:
es: Por favor, no utilices el rastreador de problemas para esto. El rastreador de problemas es una herramienta para abordar los errores y las solicitudes de características en el propio Flask. Utiliza uno de los siguientes recursos para preguntas sobre el uso de Flask o problemas con tu propio código:

source: The ``#questions`` channel on our Discord chat: https://discord.gg/pallets
es: El canal ``#questions`` en nuestro chat de Discord: https://discord.gg/pallets

source: Ask on `Stack Overflow`_. Search with Google first using: ``site:stackoverflow.com flask {search term, exception message, etc.}``
es: Pregunta en `Stack Overflow`_. Busca con Google primero usando: ``site:stackoverflow.com flask {término de búsqueda, mensaje de excepción, etc.}``

source: Ask on our `GitHub Discussions`_ for long term discussion or larger questions.
es: Pregunte en nuestro `GitHub Discussions`_ para discusiones a largo plazo o preguntas más amplias.

source: Reporting issues
es: Informar de los problemas

source: Include the following information in your post:
es: Incluya la siguiente información en su puesto:

source: Describe what you expected to happen.
es: Describa lo que esperaba que ocurriera.

source: If possible, include a `minimal reproducible example`_ to help us identify the issue. This also helps check that the issue is not with your own code.
es: Si es posible, incluye un `ejemplo mínimo reproducible`_ para ayudarnos a identificar el problema. Esto también ayuda a comprobar que el problema no es con su propio código.

source: Describe what actually happened. Include the full traceback if there was an exception.
es: Describa lo que realmente sucedió. Incluya el rastreo completo si hubo una excepción.

source: List your Python and Flask versions. If possible, check if this issue is already fixed in the latest releases or the latest code in the repository.
es: Enumera tus versiones de Python y Flask. Si es posible, comprueba si este problema ya está solucionado en las últimas versiones o en el último código del repositorio.

source: Submitting patches
es: Envío de parches

source: If there is not an open issue for what you want to submit, prefer opening one for discussion before working on a PR. You can work on any issue that doesn't have an open PR linked to it or a maintainer assigned to it. These show up in the sidebar. No need to ask if you can work on an issue that interests you.
es: Si no hay un tema abierto para lo que quieres enviar, prefiere abrir uno para su discusión antes de trabajar en un PR. Puedes trabajar en cualquier tema que no tenga un PR abierto vinculado o un mantenedor asignado. Estos aparecen en la barra lateral. No hace falta que preguntes si puedes trabajar en un tema que te interesa.

source: Include the following in your patch:
es: Incluya lo siguiente en su parche:

source: Use `Black`_ to format your code. This and other tools will run automatically if you install `pre-commit`_ using the instructions below.
es: Utilice `Black`_ para formatear su código. Esta y otras herramientas se ejecutarán automáticamente si instalas `pre-commit`_ siguiendo las instrucciones que aparecen a continuación.

source: Include tests if your patch adds or changes code. Make sure the test fails without your patch.
es: Incluya pruebas si su parche añade o cambia código. Asegúrese de que la prueba falla sin su parche.

source: Update any relevant docs pages and docstrings. Docs pages and docstrings should be wrapped at 72 characters.
es: Actualice las páginas de documentos y las cadenas de documentos pertinentes. Las páginas de documentos y las cadenas de documentos deben tener 72 caracteres.

source: Add an entry in ``CHANGES.rst``. Use the same style as other entries. Also include ``.. versionchanged::`` inline changelogs in relevant docstrings.
es: Añade una entrada en ``CHANGES.rst``. Utilice el mismo estilo que otras entradas. Incluir también ``. versionchanged::`` inline changelogs en los docstrings relevantes.

source: Make sure you have a `GitHub account`_.
es: Asegúrate de tener una cuenta en `GitHub`_.

source: Download and install the `latest version of git`_.
es: Descargue e instale la `última versión de git`_.

source: Configure git with your `username`_ and `email`_.
es: Configura git con tu `nombre de usuario`_ y `correo electrónico`_.

source: Fork Flask to your GitHub account by clicking the `Fork`_ button.
es: Fork Flask a su cuenta de GitHub haciendo clic en el botón `Fork`_.

source: Install the development dependencies, then install Flask in editable mode.
es: Instale las dependencias de desarrollo y luego instale Flask en modo editable.

source: Install the pre-commit hooks.
es: Instale los hooks de pre-commit.

source: Start coding
es: Empezar a codificar

source: Create a branch to identify the issue you would like to work on. If you're submitting a bug or documentation fix, branch off of the latest ".x" branch.
es: Crea una rama para identificar el problema en el que te gustaría trabajar. Si estás enviando una corrección de un error o de la documentación, bifurca desde la última rama ".x".

source: If you're submitting a feature addition or change, branch off of the "main" branch.
es: Si estás enviando una adición o cambio de característica, bifúrcate de la rama "main".

source: Using your favorite editor, make your changes, `committing as you go`_.
es: Utilizando su editor favorito, realice los cambios, `hacer commits a medida que avanza`_.

source: Include tests that cover any code changes you make. Make sure the test fails without your patch. Run the tests as described below.
es: Incluya pruebas que cubran cualquier cambio de código que realice. Asegúrese de que la prueba falla sin su parche. Ejecute las pruebas como se describe a continuación.

source: Running the tests
es: Ejecución de las pruebas

source: Run the basic test suite with pytest.
es: Ejecute el conjunto de pruebas básicas con pytest.

source: This runs the tests for the current environment, which is usually sufficient. CI will run the full suite when you submit your pull request. You can run the full test suite with tox if you don't want to wait.
es: Esto ejecuta las pruebas para el entorno actual, que suele ser suficiente. CI ejecutará el conjunto completo cuando envíe su solicitud de extracción. Puede ejecutar el conjunto completo de pruebas con tox si no quiere esperar.

source: Running test coverage
es: Ejecución de la cobertura de las pruebas

source: Generating a report of lines that do not have test coverage can indicate where to start contributing. Run ``pytest`` using ``coverage`` and generate a report.
es: Generar un informe de las líneas que no tienen cobertura de pruebas puede indicar por dónde empezar a contribuir. Ejecuta ``pytest`` utilizando ``coverage`` y genera un informe.

source: Open ``htmlcov/index.html`` in your browser to explore the report.
es: Abra ``htmlcov/index.html`` en su navegador para explorar el informe.

source: Read more about `coverage <https://coverage.readthedocs.io>`__.
es: Más información sobre `cobertura <https://coverage.readthedocs.io>`__.

source: Building the docs
es: Construir los documentos

source: Build the docs in the ``docs`` directory using Sphinx.
es: Construye los documentos en el directorio ``docs`` usando Sphinx.

source: Open ``_build/html/index.html`` in your browser to view the docs.
es: Abre ``_build/html/index.html`` en tu navegador para ver los documentos.

source: Read more about `Sphinx <https://www.sphinx-doc.org/en/stable/>`__.
es: Más información sobre `Sphinx <https://www.sphinx-doc.org/en/stable/>`__.
