Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/patterns.po
Languages: es_la

source: That's all you need for most browsers, however some really old ones do not support this standard. The old de-facto standard is to serve this file, with this name, at the website root. If your application is not mounted at the root path of the domain you either need to configure the web server to serve the icon at the root or if you can't do that you're out of luck. If however your application is the root you can simply route a redirect::
es_la: Eso es todo lo que se necesita para la mayoría de los navegadores, sin embargo algunos muy antiguos no soportan este estándar. El antiguo estándar de facto es servir este archivo, con este nombre, en la raíz del sitio web. Si tu aplicación no está montada en la ruta raíz del dominio tienes que configurar el servidor web para que sirva el icono en la raíz o si no puedes hacerlo no tienes suerte. Sin embargo, si su aplicación es la raíz puede simplemente dirigir una redirección::

source: If you want to save the extra redirect request you can also write a view using :func:`~flask.send_from_directory`::
es_la: Si quieres ahorrarte la petición de redirección extra también puedes escribir una vista usando :func:`~flask.send_from_directory`::

source: We can leave out the explicit mimetype and it will be guessed, but we may as well specify it to avoid the extra guessing, as it will always be the same.
es_la: Podemos omitir el mimetype explícito y se adivinará, pero también podemos especificarlo para evitar la adivinación extra, ya que siempre será el mismo.

source: The above will serve the icon via your application and if possible it's better to configure your dedicated web server to serve it; refer to the web server's documentation.
es_la: Lo anterior servirá el icono a través de su aplicación y si es posible es mejor configurar su servidor web dedicado para servirlo; consulte la documentación del servidor web.

source: See also
es_la: Véase también

source: The `Favicon <https://en.wikipedia.org/wiki/Favicon>`_ article on Wikipedia
es_la: * El articulo de `Favicon <https://en.wikipedia.org/wiki/Favicon>`_ en Wikipedia

source: Uploading Files
es_la: Carga de archivos

source: Ah yes, the good old problem of file uploads. The basic idea of file uploads is actually quite simple. It basically works like this:
es_la: Ah, sí, el viejo problema de la subida de archivos. La idea básica de la subida de archivos es en realidad bastante simple. Básicamente funciona así:

source: A ``<form>`` tag is marked with ``enctype=multipart/form-data`` and an ``<input type=file>`` is placed in that form.
es_la: Una etiqueta ``<form>`` se marca con ``enctype=multipart/form-data`` y se coloca un ``<input type=file>`` en ese formulario.

source: The application accesses the file from the :attr:`~flask.request.files` dictionary on the request object.
es_la: La aplicación accede al archivo desde el diccionario :attr:`~flask.request.files` del objeto de la petición.

source: use the :meth:`~werkzeug.datastructures.FileStorage.save` method of the file to save the file permanently somewhere on the filesystem.
es_la: utiliza el método :meth:`~werkzeug.datastructures.FileStorage.save` del archivo para guardar el archivo de forma permanente en algún lugar del sistema de archivos.

source: A Gentle Introduction
es_la: Una gentil introducción

source: Let's start with a very basic application that uploads a file to a specific upload folder and displays a file to the user. Let's look at the bootstrapping code for our application::
es_la: Comencemos con una aplicación muy básica que sube un archivo a una carpeta de subida específica y muestra un archivo al usuario. Veamos el código de arranque de nuestra aplicación::

source: So first we need a couple of imports. Most should be straightforward, the :func:`werkzeug.secure_filename` is explained a little bit later. The ``UPLOAD_FOLDER`` is where we will store the uploaded files and the ``ALLOWED_EXTENSIONS`` is the set of allowed file extensions.
es_la: Así que primero necesitamos un par de importaciones. La mayoría deberían ser sencillas, la :func:`werkzeug.secure_filename` se explica un poco más tarde. El ``UPLOAD_FOLDER`` es donde almacenaremos los archivos subidos y el ``ALLOWED_EXTENSIONS`` es el conjunto de extensiones de archivo permitidas.

source: Why do we limit the extensions that are allowed? You probably don't want your users to be able to upload everything there if the server is directly sending out the data to the client. That way you can make sure that users are not able to upload HTML files that would cause XSS problems (see :ref:`security-xss`). Also make sure to disallow ``.php`` files if the server executes them, but who has PHP installed on their server, right? :)
es_la: ¿Por qué limitamos las extensiones permitidas? Probablemente no quiera que sus usuarios puedan subir todo allí si el servidor está enviando directamente los datos al cliente. De este modo, puede asegurarse de que los usuarios no puedan subir archivos HTML que puedan causar problemas de XSS (véase :ref:`security-xss`). También asegúrese de no permitir archivos ``.php`` si el servidor los ejecuta, pero ¿quién tiene PHP instalado en su servidor, verdad? :)

source: Next the functions that check if an extension is valid and that uploads the file and redirects the user to the URL for the uploaded file::
es_la: A continuación las funciones que comprueban si una extensión es válida y que suben el archivo y redirigen al usuario a la URL del archivo subido::

source: So what does that :func:`~werkzeug.utils.secure_filename` function actually do? Now the problem is that there is that principle called "never trust user input". This is also true for the filename of an uploaded file. All submitted form data can be forged, and filenames can be dangerous. For the moment just remember: always use that function to secure a filename before storing it directly on the filesystem.
es_la: Entonces, ¿qué hace realmente esa función :func:`~werkzeug.utils.secure_filename`? Ahora el problema es que existe ese principio llamado "nunca confíes en la entrada del usuario". Esto también es cierto para el nombre de un archivo subido. Todos los datos de los formularios enviados pueden ser falsificados, y los nombres de los archivos pueden ser peligrosos. Por el momento sólo recuerda: utiliza siempre esa función para asegurar un nombre de archivo antes de almacenarlo directamente en el sistema de archivos.

source: Information for the Pros
es_la: Información para los profesionales

source: So you're interested in what that :func:`~werkzeug.utils.secure_filename` function does and what the problem is if you're not using it? So just imagine someone would send the following information as `filename` to your application::
es_la: ¿Así que te interesa saber qué hace esa función :func:`~werkzeug.utils.secure_filename` y cuál es el problema si no la usas? Pues imagina que alguien envía la siguiente información como `filename` a tu aplicación::

source: Assuming the number of ``../`` is correct and you would join this with the ``UPLOAD_FOLDER`` the user might have the ability to modify a file on the server's filesystem he or she should not modify. This does require some knowledge about how the application looks like, but trust me, hackers are patient :)
es_la: Asumiendo que el número de ``../`` es correcto y que unirías esto con el ``UPLOAD_FOLDER`` el usuario podría tener la capacidad de modificar un archivo en el sistema de archivos del servidor que no debería modificar. Esto requiere un poco de conocimiento sobre el aspecto de la aplicación, pero créeme, los hackers son pacientes :)

source: Now let's look how that function works:
es_la: Ahora veamos cómo funciona esa función:

source: We want to be able to serve the uploaded files so they can be downloaded by users. We'll define a ``download_file`` view to serve files in the upload folder by name. ``url_for("download_file", name=name)`` generates download URLs.
es_la: Queremos ser capaces de servir los archivos subidos para que puedan ser descargados por los usuarios. Definiremos una vista ``download_file`` para servir los archivos de la carpeta de subida por su nombre. ``url_for("download_file", name=name)`` genera URLs de descarga.

source: If you're using middleware or the HTTP server to serve files, you can register the ``download_file`` endpoint as ``build_only`` so ``url_for`` will work without a view function.
es_la: Si estás utilizando middleware o el servidor HTTP para servir archivos, puedes registrar el endpoint ``download_file`` como ``build_only`` para que ``url_for`` funcione sin una función de vista.

source: Improving Uploads
es_la: Mejora de las cargas

source: So how exactly does Flask handle uploads? Well it will store them in the webserver's memory if the files are reasonably small, otherwise in a temporary location (as returned by :func:`tempfile.gettempdir`). But how do you specify the maximum file size after which an upload is aborted? By default Flask will happily accept file uploads with an unlimited amount of memory, but you can limit that by setting the ``MAX_CONTENT_LENGTH`` config key::
es_la: ¿Cómo gestiona Flask las subidas de archivos? Bueno, los almacenará en la memoria del servidor web si los archivos son razonablemente pequeños, de lo contrario en una ubicación temporal (como se devuelve con :func:`tempfile.gettempdir`). ¿Pero cómo se especifica el tamaño máximo de los archivos después del cual se aborta la carga? Por defecto, Flask aceptará sin problemas subidas de archivos con una cantidad ilimitada de memoria, pero se puede limitar estableciendo la clave de configuración ``MAX_CONTENT_LENGTH``:

source: The code above will limit the maximum allowed payload to 16 megabytes. If a larger file is transmitted, Flask will raise a :exc:`~werkzeug.exceptions.RequestEntityTooLarge` exception.
es_la: El código anterior limitará la carga útil máxima permitida a 16 megabytes. Si se transmite un archivo mayor, Flask lanzará una excepción :exc:`~werkzeug.exceptions.RequestEntityTooLarge`.

source: Connection Reset Issue
es_la: Problema de reinicio de la conexión

source: When using the local development server, you may get a connection reset error instead of a 413 response. You will get the correct status response when running the app with a production WSGI server.
es_la: Cuando se utiliza el servidor de desarrollo local, es posible que obtenga un error de restablecimiento de la conexión en lugar de una respuesta 413. Obtendrá la respuesta de estado correcta cuando ejecute la aplicación con un servidor WSGI de producción.

source: This feature was added in Flask 0.6 but can be achieved in older versions as well by subclassing the request object. For more information on that consult the Werkzeug documentation on file handling.
es_la: Esta característica fue añadida en Flask 0.6, pero también se puede conseguir en versiones anteriores subclasificando el objeto request. Para más información al respecto consulte la documentación de Werkzeug sobre el manejo de archivos.

source: Upload Progress Bars
es_la: Cargar barras de progreso

source: A while ago many developers had the idea to read the incoming file in small chunks and store the upload progress in the database to be able to poll the progress with JavaScript from the client. The client asks the server every 5 seconds how much it has transmitted, but this is something it should already know.
es_la: Hace un tiempo muchos desarrolladores tuvieron la idea de leer el archivo entrante en pequeños trozos y almacenar el progreso de subida en la base de datos para poder sondear el progreso con JavaScript desde el cliente. El cliente pregunta al servidor cada 5 segundos cuánto ha transmitido, pero esto es algo que ya debería saber.

source: An Easier Solution
es_la: Una solución más fácil

source: Now there are better solutions that work faster and are more reliable. There are JavaScript libraries like jQuery_ that have form plugins to ease the construction of progress bar.
es_la: Ahora hay mejores soluciones que funcionan más rápido y son más fiables. Hay bibliotecas de JavaScript como jQuery_ que tienen plugins de formulario para facilitar la construcción de la barra de progreso.

source: Because the common pattern for file uploads exists almost unchanged in all applications dealing with uploads, there is also a Flask extension called `Flask-Uploads`_ that implements a full fledged upload mechanism that allows controlling which file extensions are allowed to be uploaded.
es_la: Debido a que el patrón común para la subida de archivos existe casi sin cambios en todas las aplicaciones que se ocupan de las subidas, también hay una extensión de Flask llamada `Flask-Uploads`_ que implementa un mecanismo de subida completo que permite controlar qué extensiones de archivo se pueden subir.

source: Message Flashing
es_la: Mensaje Flash

source: Good applications and user interfaces are all about feedback. If the user does not get enough feedback they will probably end up hating the application. Flask provides a really simple way to give feedback to a user with the flashing system. The flashing system basically makes it possible to record a message at the end of a request and access it next request and only next request. This is usually combined with a layout template that does this. Note that browsers and sometimes web servers enforce a limit on cookie sizes. This means that flashing messages that are too large for session cookies causes message flashing to fail silently.
es_la: Las buenas aplicaciones e interfaces de usuario se basan en la retroalimentación. Si el usuario no recibe suficiente retroalimentación, probablemente terminará odiando la aplicación. Flask proporciona una forma muy sencilla de dar retroalimentación a un usuario con el sistema de parpadeo. El sistema de parpadeo básicamente hace posible grabar un mensaje al final de una solicitud y acceder a él la próxima solicitud y sólo la próxima solicitud. Esto se suele combinar con una plantilla de diseño que hace esto. Tenga en cuenta que los navegadores y a veces los servidores web imponen un límite en el tamaño de las cookies. Esto significa que si los mensajes son demasiado grandes para las cookies de sesión, el parpadeo de los mensajes falla silenciosamente.

source: Simple Flashing
es_la: Flash simple

source: So here is a full example::
es_la: Así que aquí está un ejemplo completo::

source: And here is the :file:`layout.html` template which does the magic:
es_la: Y aquí está la plantilla :file:`layout.html` que hace la magia:

source: Here is the :file:`index.html` template which inherits from :file:`layout.html`:
es_la: Aquí está la plantilla :file:`index.html` que hereda de :file:`layout.html`:

source: And here is the :file:`login.html` template which also inherits from :file:`layout.html`:
es_la: Y aquí está la plantilla :file:`login.html` que también hereda de :file:`layout.html`:

source: Flashing With Categories
es_la: Flashing con categorías

source: It is also possible to provide categories when flashing a message. The default category if nothing is provided is ``'message'``. Alternative categories can be used to give the user better feedback. For example error messages could be displayed with a red background.
es_la: También es posible proporcionar categorías cuando se parpadea un mensaje. La categoría por defecto si no se proporciona nada es ``'message'``. Se pueden utilizar categorías alternativas para dar al usuario una mejor respuesta. Por ejemplo, los mensajes de error podrían mostrarse con un fondo rojo.

source: To flash a message with a different category, just use the second argument to the :func:`~flask.flash` function::
es_la: Para emitir un mensaje con una categoría diferente, basta con utilizar el segundo argumento de la función :func:`~flask.flash`::

source: Inside the template you then have to tell the :func:`~flask.get_flashed_messages` function to also return the categories. The loop looks slightly different in that situation then:
es_la: Dentro de la plantilla tienes que decirle a la función :func:`~flask.get_flashed_messages` que también devuelva las categorías. El bucle se ve ligeramente diferente en esa situación entonces:

source: This is just one example of how to render these flashed messages. One might also use the category to add a prefix such as ``<strong>Error:</strong>`` to the message.
es_la: Este es sólo un ejemplo de cómo representar estos mensajes intermitentes. También se puede utilizar la categoría para añadir un prefijo como ``<strong>Error:</strong>`` al mensaje.

source: Filtering Flash Messages
es_la: Filtrado de mensajes flash

source: Optionally you can pass a list of categories which filters the results of :func:`~flask.get_flashed_messages`. This is useful if you wish to render each category in a separate block.
es_la: Opcionalmente puede pasar una lista de categorías que filtre los resultados de :func:`~flask.get_flashed_messages`. Esto es útil si desea renderizar cada categoría en un bloque separado.

source: Patterns for Flask
es_la: Patrones para Flask

source: Certain features and interactions are common enough that you will find them in most web applications. For example, many applications use a relational database and user authentication. They will open a database connection at the beginning of the request and get the information for the logged in user. At the end of the request, the database connection is closed.
es_la: Ciertas características e interacciones son lo suficientemente comunes como para encontrarlas en la mayoría de las aplicaciones web. Por ejemplo, muchas aplicaciones utilizan una base de datos relacional y la autenticación del usuario. Abrirán una conexión a la base de datos al principio de la petición y obtendrán la información del usuario conectado. Al final de la solicitud, la conexión a la base de datos se cierra.

source: These types of patterns may be a bit outside the scope of Flask itself, but Flask makes it easy to implement them. Some common patterns are collected in the following pages.
es_la: Estos tipos de patrones pueden estar un poco fuera del alcance de Flask en sí, pero Flask facilita su implementación. En las siguientes páginas se recogen algunos patrones comunes.

source: AJAX with jQuery
es_la: AJAX con jQuery

source: `jQuery`_ is a small JavaScript library commonly used to simplify working with the DOM and JavaScript in general. It is the perfect tool to make web applications more dynamic by exchanging JSON between server and client.
es_la: `jQuery`_ es una pequeña librería de JavaScript utilizada habitualmente para simplificar el trabajo con el DOM y con JavaScript en general. Es la herramienta perfecta para hacer más dinámicas las aplicaciones web mediante el intercambio de JSON entre el servidor y el cliente.

source: JSON itself is a very lightweight transport format, very similar to how Python primitives (numbers, strings, dicts and lists) look like which is widely supported and very easy to parse. It became popular a few years ago and quickly replaced XML as transport format in web applications.
es_la: JSON es un formato de transporte muy ligero, muy similar al aspecto de las primitivas de Python (números, cadenas, dicts y listas) que está ampliamente soportado y es muy fácil de analizar. Se hizo popular hace unos años y rápidamente sustituyó a XML como formato de transporte en las aplicaciones web.

source: Loading jQuery
es_la: Carga de jQuery

source: In order to use jQuery, you have to download it first and place it in the static folder of your application and then ensure it's loaded. Ideally you have a layout template that is used for all pages where you just have to add a script statement to the bottom of your ``<body>`` to load jQuery:
es_la: Para usar jQuery, primero tienes que descargarlo y colocarlo en la carpeta estática de tu aplicación y luego asegurarte de que se cargue. Lo ideal es que tengas una plantilla de diseño que se utilice para todas las páginas en la que sólo tengas que añadir una declaración de script al final de tu ``<body>`` para cargar jQuery:

source: Another method is using Google's `AJAX Libraries API <https://developers.google.com/speed/libraries/>`_ to load jQuery:
es_la: Otro método es utilizar la `API de las librerías AJAX <https://developers.google.com/speed/libraries/>`_ de Google para cargar jQuery:

source: In this case you have to put jQuery into your static folder as a fallback, but it will first try to load it directly from Google. This has the advantage that your website will probably load faster for users if they went to at least one other website before using the same jQuery version from Google because it will already be in the browser cache.
es_la: En este caso tienes que poner jQuery en tu carpeta estática como un fallback, pero primero intentará cargarlo directamente desde Google. Esto tiene la ventaja de que su sitio web probablemente se cargará más rápido para los usuarios si fueron a al menos otro sitio web antes de usar la misma versión de jQuery de Google porque ya estará en la caché del navegador.

source: Where is My Site?
es_la: ¿Dónde está mi sitio?

source: Do you know where your application is? If you are developing the answer is quite simple: it's on localhost port something and directly on the root of that server. But what if you later decide to move your application to a different location? For example to ``http://example.com/myapp``? On the server side this never was a problem because we were using the handy :func:`~flask.url_for` function that could answer that question for us, but if we are using jQuery we should not hardcode the path to the application but make that dynamic, so how can we do that?
es_la: ¿Sabes dónde está tu aplicación? Si estás desarrollando la respuesta es bastante sencilla: está en el puerto localhost algo y directamente en la raíz de ese servidor. ¿Pero qué pasa si más tarde decides mover tu aplicación a una ubicación diferente? ¿Por ejemplo a ``http://example.com/myapp``? En el lado del servidor esto nunca fue un problema porque estábamos usando la práctica función :func:`~flask.url_for` que podía responder a esa pregunta por nosotros, pero si estamos usando jQuery no debemos hardcodear la ruta a la aplicación sino hacerla dinámica, así que ¿cómo podemos hacer eso?

source: A simple method would be to add a script tag to our page that sets a global variable to the prefix to the root of the application. Something like this:
es_la: Un método sencillo sería añadir una etiqueta de script a nuestra página que establezca una variable global con el prefijo a la raíz de la aplicación. Algo así:

source: JSON View Functions
es_la: Funciones de la vista JSON

source: Now let's create a server side function that accepts two URL arguments of numbers which should be added together and then sent back to the application in a JSON object. This is a really ridiculous example and is something you usually would do on the client side alone, but a simple example that shows how you would use jQuery and Flask nonetheless::
es_la: Ahora vamos a crear una función del lado del servidor que acepte dos argumentos URL de números que deben ser sumados y luego enviados de vuelta a la aplicación en un objeto JSON. Este es un ejemplo realmente ridículo y es algo que normalmente se haría en el lado del cliente solo, pero un ejemplo simple que muestra cómo se utilizaría jQuery y Flask sin embargo::
