Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/patterns.po
Languages: es_la

source: As you can see I also added an `index` method here that renders a template. This template will load jQuery as above and have a little form where we can add two numbers and a link to trigger the function on the server side.
es_la: Como puedes ver también he añadido un método `index` aquí que renderiza una plantilla. Esta plantilla cargará jQuery como en el caso anterior y tendrá un pequeño formulario donde podemos añadir dos números y un enlace para activar la función en el lado del servidor.

source: Note that we are using the :meth:`~werkzeug.datastructures.MultiDict.get` method here which will never fail. If the key is missing a default value (here ``0``) is returned. Furthermore it can convert values to a specific type (like in our case `int`). This is especially handy for code that is triggered by a script (APIs, JavaScript etc.) because you don't need special error reporting in that case.
es_la: Tenga en cuenta que estamos utilizando el método :meth:`~werkzeug.datastructures.MultiDict.get` que nunca fallará. Si falta la clave se devuelve un valor por defecto (aquí ``0``). Además puede convertir los valores a un tipo específico (como en nuestro caso `int`). Esto es especialmente útil para el código que se desencadena por un script (APIs, JavaScript, etc.) porque no se necesita un informe de error especial en ese caso.

source: The HTML
es_la: El HTML

source: Your index.html template either has to extend a :file:`layout.html` template with jQuery loaded and the `$SCRIPT_ROOT` variable set, or do that on the top. Here's the HTML code needed for our little application (:file:`index.html`). Notice that we also drop the script directly into the HTML here. It is usually a better idea to have that in a separate script file:
es_la: Tu plantilla index.html tiene que extender una plantilla :file:`layout.html` con jQuery cargado y la variable `$SCRIPT_ROOT` establecida, o hacerlo en la parte superior. Aquí está el código HTML necesario para nuestra pequeña aplicación (:file:`index.html`). Fíjate en que aquí también soltamos el script directamente en el HTML. Normalmente es mejor tenerlo en un archivo de script separado:

source: I won't go into detail here about how jQuery works, just a very quick explanation of the little bit of code above:
es_la: No voy a entrar en detalles aquí sobre cómo funciona jQuery, sólo una explicación muy rápida del pequeño trozo de código anterior:

source: ``$(function() { ... })`` specifies code that should run once the browser is done loading the basic parts of the page.
es_la: ``$(function() { ... })`` especifica el código que debe ejecutarse una vez que el navegador haya terminado de cargar las partes básicas de la página.

source: ``$('selector')`` selects an element and lets you operate on it.
es_la: ``$('selector')`` selecciona un elemento y permite operar sobre él.

source: ``element.bind('event', func)`` specifies a function that should run when the user clicked on the element. If that function returns `false`, the default behavior will not kick in (in this case, navigate to the `#` URL).
es_la: ``element.bind('event', func)`` especifica una función que debe ejecutarse cuando el usuario haga clic en el elemento. Si esa función devuelve `false`, el comportamiento por defecto no se pondrá en marcha (en este caso, navegar a la URL `#`).

source: ``$.getJSON(url, data, func)`` sends a ``GET`` request to `url` and will send the contents of the `data` object as query parameters. Once the data arrived, it will call the given function with the return value as argument. Note that we can use the `$SCRIPT_ROOT` variable here that we set earlier.
es_la: ``$.getJSON(url, data, func)`` envía una petición ``GET`` a `url` y enviará el contenido del objeto `data` como parámetros de consulta. Una vez que los datos lleguen, llamará a la función dada con el valor de retorno como argumento. Ten en cuenta que aquí podemos utilizar la variable `$SCRIPT_ROOT` que establecimos anteriormente.

source: Check out the :gh:`example source <examples/javascript>` for a full application demonstrating the code on this page, as well as the same thing using ``XMLHttpRequest`` and ``fetch``.
es_la: Echa un vistazo a la fuente de :gh:`ejemplo <examples/javascript>` para una aplicación completa que demuestra el código de esta página, así como lo mismo usando ``XMLHttpRequest`` y ``fetch``.

source: Lazily Loading Views
es_la: Vistas de carga lenta

source: Flask is usually used with the decorators. Decorators are simple and you have the URL right next to the function that is called for that specific URL. However there is a downside to this approach: it means all your code that uses decorators has to be imported upfront or Flask will never actually find your function.
es_la: Flask se utiliza generalmente con los decoradores. Los decoradores son simples y tienes la URL justo al lado de la función que se llama para esa URL específica. Sin embargo, hay una desventaja en este enfoque: significa que todo su código que utiliza decoradores tiene que ser importado por adelantado o Flask nunca encontrará su función.

source: This can be a problem if your application has to import quick. It might have to do that on systems like Google's App Engine or other systems. So if you suddenly notice that your application outgrows this approach you can fall back to a centralized URL mapping.
es_la: Esto puede ser un problema si su aplicación tiene que importar rápidamente. Puede que tenga que hacerlo en sistemas como el App Engine de Google u otros sistemas. Así que si de repente notas que tu aplicación se queda pequeña con este enfoque puedes volver a un mapeo de URLs centralizado.

source: The system that enables having a central URL map is the :meth:`~flask.Flask.add_url_rule` function. Instead of using decorators, you have a file that sets up the application with all URLs.
es_la: El sistema que permite tener un mapa de URLs central es la función :meth:`~flask.Flask.add_url_rule`. En lugar de usar decoradores, tienes un archivo que configura la aplicación con todas las URLs.

source: Converting to Centralized URL Map
es_la: Conversión a mapa de URLs centralizado

source: Imagine the current application looks somewhat like this::
es_la: Imagina que la aplicación actual tiene un aspecto similar al siguiente::

source: Then, with the centralized approach you would have one file with the views (:file:`views.py`) but without any decorator::
es_la: Entonces, con el enfoque centralizado tendrías un archivo con las vistas (:file:`views.py`) pero sin ningún decorador:: algo así::

source: And then a file that sets up an application which maps the functions to URLs::
es_la: Y luego un archivo que configura una aplicación que mapea las funciones a URLs::

source: Loading Late
es_la: Cargando con retraso

source: So far we only split up the views and the routing, but the module is still loaded upfront. The trick is to actually load the view function as needed. This can be accomplished with a helper class that behaves just like a function but internally imports the real function on first use::
es_la: Hasta ahora sólo hemos dividido las vistas y el enrutamiento, pero el módulo se sigue cargando por adelantado. El truco está en cargar realmente la función de la vista cuando se necesita. Esto se puede lograr con una clase helper que se comporta como una función pero que importa internamente la función real en el primer uso::

source: What's important here is is that `__module__` and `__name__` are properly set. This is used by Flask internally to figure out how to name the URL rules in case you don't provide a name for the rule yourself.
es_la: Lo importante aquí es que `__module__` y `__name__` estén correctamente configurados. Esto es utilizado por Flask internamente para averiguar cómo nombrar las reglas URL en caso de que no proporciones un nombre para la regla tú mismo.

source: Then you can define your central place to combine the views like this::
es_la: Entonces puedes definir tu lugar central para combinar las vistas así::

source: You can further optimize this in terms of amount of keystrokes needed to write this by having a function that calls into :meth:`~flask.Flask.add_url_rule` by prefixing a string with the project name and a dot, and by wrapping `view_func` in a `LazyView` as needed. ::
es_la: Puedes optimizar aún más esto en términos de cantidad de pulsaciones de teclas necesarias para escribir esto teniendo una función que llame a :meth:`~flask.Flask.add_url_rule` prefijando una cadena con el nombre del proyecto y un punto, y envolviendo `view_func` en un `LazyView` según sea necesario. ::

source: One thing to keep in mind is that before and after request handlers have to be in a file that is imported upfront to work properly on the first request. The same goes for any kind of remaining decorator.
es_la: Una cosa a tener en cuenta es que los manejadores de antes y después de la solicitud tienen que estar en un archivo que se importa por adelantado para que funcione correctamente en la primera solicitud. Lo mismo ocurre con cualquier tipo de decorador restante.

source: Adding HTTP Method Overrides
es_la: Añadir anulaciones de métodos HTTP

source: Some HTTP proxies do not support arbitrary HTTP methods or newer HTTP methods (such as PATCH). In that case it's possible to "proxy" HTTP methods through another HTTP method in total violation of the protocol.
es_la: Algunos proxies HTTP no soportan métodos HTTP arbitrarios o métodos HTTP más nuevos (como PATCH). En ese caso es posible "proxiar" métodos HTTP a través de otro método HTTP en total violación del protocolo.

source: The way this works is by letting the client do an HTTP POST request and set the ``X-HTTP-Method-Override`` header. Then the method is replaced with the header value before being passed to Flask.
es_la: La forma en que esto funciona es dejando que el cliente haga una petición HTTP POST y establezca la cabecera ``X-HTTP-Method-Override``. Entonces el método es reemplazado por el valor de la cabecera antes de ser pasado a Flask.

source: This can be accomplished with an HTTP middleware::
es_la: Esto puede lograrse con un middleware HTTP::

source: To use this with Flask, wrap the app object with the middleware::
es_la: Para usar esto con Flask, envuelva el objeto de la aplicación con el middleware::

source: MongoDB with MongoEngine
es_la: MongoDB con MongoEngine

source: Using a document database like MongoDB is a common alternative to relational SQL databases. This pattern shows how to use `MongoEngine`_, a document mapper library, to integrate with MongoDB.
es_la: El uso de una base de datos de documentos como MongoDB es una alternativa común a las bases de datos relacionales SQL. Este patrón muestra cómo utilizar `MongoEngine`_, una biblioteca de mapeo de documentos, para integrarse con MongoDB.

source: A running MongoDB server and `Flask-MongoEngine`_ are required. ::
es_la: Se requiere un servidor MongoDB en funcionamiento y `Flask-MongoEngine`_. ::

source: Configuration
es_la: Configuración

source: Basic setup can be done by defining ``MONGODB_SETTINGS`` on ``app.config`` and creating a ``MongoEngine`` instance. ::
es_la: La configuración básica puede hacerse definiendo ``MONGODB_SETTINGS`` en ``app.config`` y creando una instancia de ``MongoEngine``::

source: Mapping Documents
es_la: Documentos de mapeo

source: To declare a model that represents a Mongo document, create a class that inherits from ``Document`` and declare each of the fields. ::
es_la: Para declarar un modelo que represente un documento Mongo, crea una clase que herede de ``Document`` y declara cada uno de los campos ::

source: If the document has nested fields, use ``EmbeddedDocument`` to defined the fields of the embedded document and ``EmbeddedDocumentField`` to declare it on the parent document. ::
es_la: Si el documento tiene campos anidados, utilice ``EmbeddedDocument`` para definir los campos del documento incrustado y ``EmbeddedDocumentField`` para declararlos en el documento padre. ::

source: Creating Data
es_la: Creación de datos

source: Instantiate your document class with keyword arguments for the fields. You can also assign values to the field attributes after instantiation. Then call ``doc.save()``. ::
es_la: Instancie su clase documental con argumentos de palabras clave para los campos. También puedes asignar valores a los atributos de los campos después de la instanciación. Luego llama a ``doc.save()``. ::

source: Queries
es_la: Consultas

source: Use the class ``objects`` attribute to make queries. A keyword argument looks for an equal value on the field. ::
es_la: Utiliza el atributo de clase ``objects`` para realizar consultas. Un argumento de palabra clave busca un valor igual en el campo ::

source: Query operators may be used by concatenating them with the field name using a double-underscore. ``objects``, and queries returned by calling it, are iterable. ::
es_la: Los operadores de consulta pueden utilizarse concatenándolos con el nombre del campo mediante un doble guión. Los objetos y las consultas devueltas al llamarlos son iterables::

source: Documentation
es_la: Documentación

source: There are many more ways to define and query documents with MongoEngine. For more information, check out the `official documentation <MongoEngine_>`_.
es_la: Hay muchas más formas de definir y consultar documentos con MongoEngine. Para más información, consulta la `documentación oficial <MongoEngine_>`_.

source: Flask-MongoEngine adds helpful utilities on top of MongoEngine. Check out their `documentation <Flask-MongoEngine_>`_ as well.
es_la: Flask-MongoEngine añade útiles utilidades encima de MongoEngine. Consulta también su `documentación <Flask-MongoEngine_>`_.

source: Large Applications as Packages
es_la: Grandes aplicaciones como paquetes

source: Imagine a simple flask application structure that looks like this::
es_la: Imagina una estructura de aplicación simple de flask que se parece a esto::

source: While this is fine for small applications, for larger applications it's a good idea to use a package instead of a module. The :doc:`/tutorial/index` is structured to use the package pattern, see the :gh:`example code <examples/tutorial>`.
es_la: Aunque esto está bien para aplicaciones pequeñas, para aplicaciones más grandes es una buena idea usar un paquete en lugar de un módulo. El :doc:`/tutorial/index` está estructurado para utilizar el patrón de paquete, véase el :gh:`código de ejemplo <examples/tutorial>`.

source: Simple Packages
es_la: Paquetes sencillos

source: To convert that into a larger one, just create a new folder :file:`yourapplication` inside the existing one and move everything below it. Then rename :file:`yourapplication.py` to :file:`__init__.py`. (Make sure to delete all ``.pyc`` files first, otherwise things would most likely break)
es_la: Para convertirlo en uno más grande, simplemente crea una nueva carpeta :file:`yourapplication` dentro de la existente y mueve todo debajo de ella. Entonces renombra :file:`yourapplication.py` a :file:`__init__.py`. (Asegúrate de borrar todos los archivos ``.pyc`` primero, de lo contrario lo más probable es que surgan errores)

source: You should then end up with something like that::
es_la: Entonces deberías terminar con algo así::

source: But how do you run your application now? The naive ``python yourapplication/__init__.py`` will not work. Let's just say that Python does not want modules in packages to be the startup file. But that is not a big problem, just add a new file called :file:`setup.py` next to the inner :file:`yourapplication` folder with the following contents::
es_la: Pero, ¿cómo se ejecuta la aplicación ahora? El sencillo ``python yourapplication/__init__.py`` no funcionará. Digamos que Python no quiere que los módulos de los paquetes sean el archivo de inicio. Pero eso no es un gran problema, simplemente añade un nuevo fichero llamado :file:`setup.py` junto a la carpeta interna :file:`yourapplication` con el siguiente contenido::

source: In order to run the application you need to export an environment variable that tells Flask where to find the application instance:
es_la: Para ejecutar la aplicación es necesario exportar una variable de entorno que indique a Flask dónde encontrar la instancia de la aplicación:

source: If you are outside of the project directory make sure to provide the exact path to your application directory. Similarly you can turn on the development features like this:
es_la: Si está fuera del directorio del proyecto, asegúrese de proporcionar la ruta exacta al directorio de su aplicación. Del mismo modo, puede activar las funciones de desarrollo así:

source: In order to install and run the application you need to issue the following commands::
es_la: Para instalar y ejecutar la aplicación es necesario emitir los siguientes comandos::

source: What did we gain from this? Now we can restructure the application a bit into multiple modules. The only thing you have to remember is the following quick checklist:
es_la: ¿Qué ganamos con esto? Ahora podemos reestructurar un poco la aplicación en varios módulos. Lo único que tienes que recordar es la siguiente lista de comprobación rápida:

source: the `Flask` application object creation has to be in the :file:`__init__.py` file. That way each module can import it safely and the `__name__` variable will resolve to the correct package.
es_la: la creación del objeto de aplicación `Flask` tiene que estar en el archivo :file:`__init__.py`. De esta manera cada módulo puede importarlo con seguridad y la variable `__name__` resolverá el paquete correcto.

source: all the view functions (the ones with a :meth:`~flask.Flask.route` decorator on top) have to be imported in the :file:`__init__.py` file. Not the object itself, but the module it is in. Import the view module **after the application object is created**.
es_la: todas las funciones de vista (las que tienen un decorador :meth:`~flask.Flask.route` encima) tienen que ser importadas en el archivo :file:`__init__.py`. No el objeto en sí, sino el módulo en el que se encuentra. Importa el módulo de la vista **después de crear el objeto de la aplicación**.

source: Here's an example :file:`__init__.py`::
es_la: Este es un ejemplo :file:`__init__.py`::

source: And this is what :file:`views.py` would look like::
es_la: Y así es como quedaría :file:`views.py`::

source: Circular Imports
es_la: Importaciones circulares

source: Every Python programmer hates them, and yet we just added some: circular imports (That's when two modules depend on each other. In this case :file:`views.py` depends on :file:`__init__.py`). Be advised that this is a bad idea in general but here it is actually fine. The reason for this is that we are not actually using the views in :file:`__init__.py` and just ensuring the module is imported and we are doing that at the bottom of the file.
es_la: Todos los programadores de Python los odian, y sin embargo acabamos de añadir algunos: importaciones circulares (Es cuando dos módulos dependen el uno del otro. En este caso :file:`views.py` depende de :file:`__init__.py`). Ten en cuenta que esto es una mala idea en general, pero aquí está bien. La razón es que no estamos usando las vistas en :file:`__init__.py` y sólo nos aseguramos de que el módulo es importado y lo hacemos al final del fichero.

source: There are still some problems with that approach but if you want to use decorators there is no way around that. Check out the :doc:`/becomingbig` section for some inspiration how to deal with that.
es_la: Todavía hay algunos problemas con ese enfoque, pero si quieres usar decoradores no hay manera de evitarlo. Consulte la sección :doc:`/becomingbig` para inspirarse en la forma de tratar con eso.

source: Working with Blueprints
es_la: Trabajar con Blueprints

source: If you have larger applications it's recommended to divide them into smaller groups where each group is implemented with the help of a blueprint. For a gentle introduction into this topic refer to the :doc:`/blueprints` chapter of the documentation.
es_la: Si tienes aplicaciones más grandes es recomendable dividirlas en grupos más pequeños donde cada grupo se implementa con la ayuda de un blueprint. Para una suave introducción a este tema, consulte el capítulo :doc:`/blueprints` de la documentación.

source: Request Content Checksums
es_la: Solicitar checksums de contenido

source: Various pieces of code can consume the request data and preprocess it. For instance JSON data ends up on the request object already read and processed, form data ends up there as well but goes through a different code path. This seems inconvenient when you want to calculate the checksum of the incoming request data. This is necessary sometimes for some APIs.
es_la: Varias piezas de código pueden consumir los datos de la solicitud y preprocesarlos. Por ejemplo, los datos JSON terminan en el objeto de la petición ya leídos y procesados, los datos de los formularios también terminan allí pero pasan por una ruta de código diferente. Esto parece un inconveniente cuando se quiere calcular la suma de comprobación de los datos de la solicitud entrante. Esto es necesario a veces para algunas APIs.

source: Fortunately this is however very simple to change by wrapping the input stream.
es_la: Afortunadamente, esto es muy sencillo de cambiar envolviendo el flujo de entrada.

source: The following example calculates the SHA1 checksum of the incoming data as it gets read and stores it in the WSGI environment::
es_la: El siguiente ejemplo calcula el checksum SHA1 de los datos entrantes a medida que se leen y los almacena en el entorno WSGI::

source: To use this, all you need to do is to hook the calculating stream in before the request starts consuming data. (Eg: be careful accessing ``request.form`` or anything of that nature. ``before_request_handlers`` for instance should be careful not to access it).
es_la: Para usar esto, todo lo que necesitas hacer es enganchar el flujo de cálculo antes de que la solicitud comience a consumir datos. (Por ejemplo: Ten cuidado al acceder a ``request.form`` o cualquier cosa de esa naturaleza. ``before_request_handlers`` por ejemplo hay que tener cuidado de no acceder a él).

source: Example usage::
es_la: Ejemplo de uso::

source: Single-Page Applications
es_la: Aplicaciones de una sola página

source: Flask can be used to serve Single-Page Applications (SPA) by placing static files produced by your frontend framework in a subfolder inside of your project. You will also need to create a catch-all endpoint that routes all requests to your SPA.
es_la: Flask se puede utilizar para servir aplicaciones de una sola página (SPA) mediante la colocación de archivos estáticos producidos por su marco frontend en una subcarpeta dentro de su proyecto. También tendrá que crear un punto final que dirija todas las solicitudes a su SPA.

source: The following example demonstrates how to serve an SPA along with an API::
es_la: El siguiente ejemplo demuestra cómo servir una SPA junto con una API::

source: SQLAlchemy in Flask
es_la: SQLAlchemy en Flask

source: Many people prefer `SQLAlchemy`_ for database access. In this case it's encouraged to use a package instead of a module for your flask application and drop the models into a separate module (:doc:`packages`). While that is not necessary, it makes a lot of sense.
es_la: Mucha gente prefiere `SQLAlchemy`_ para el acceso a la base de datos. En este caso se recomienda utilizar un paquete en lugar de un módulo para su aplicación flask y dejar los modelos en un módulo separado (:doc:`packages`). Aunque no es necesario, tiene mucho sentido.
