Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/patterns.po
Languages: es_la

source: Application Dispatching
es_la: Despacho de aplicaciones

source: Application dispatching is the process of combining multiple Flask applications on the WSGI level. You can combine not only Flask applications but any WSGI application. This would allow you to run a Django and a Flask application in the same interpreter side by side if you want. The usefulness of this depends on how the applications work internally.
es_la: El despacho de aplicaciones es el proceso de combinar múltiples aplicaciones Flask en el nivel WSGI. Puedes combinar no sólo aplicaciones Flask sino cualquier aplicación WSGI. Esto te permitiría ejecutar una aplicación Django y una aplicación Flask en el mismo intérprete una al lado de la otra si lo deseas. La utilidad de esto depende de cómo funcionen las aplicaciones internamente.

source: The fundamental difference from :doc:`packages` is that in this case you are running the same or different Flask applications that are entirely isolated from each other. They run different configurations and are dispatched on the WSGI level.
es_la: La diferencia fundamental con :doc:`packages` es que en este caso estás ejecutando la misma o diferentes aplicaciones Flask que están completamente aisladas entre sí. Ejecutan configuraciones diferentes y se despachan en el nivel WSGI.

source: Working with this Document
es_la: Trabajar con este documento

source: Each of the techniques and examples below results in an ``application`` object that can be run with any WSGI server. For production, see :doc:`/deploying/index`. For development, Werkzeug provides a server through :func:`werkzeug.serving.run_simple`::
es_la: Cada una de las técnicas y ejemplos que aparecen a continuación dan como resultado un objeto ``aplicación`` que puede ejecutarse con cualquier servidor WSGI. Para producción, vea :doc:`/deploying/index`. Para desarrollo, Werkzeug proporciona un servidor a través de :func:`werkzeug.serving.run_simple`::

source: Note that :func:`run_simple <werkzeug.serving.run_simple>` is not intended for use in production. Use a production WSGI server. See :doc:`/deploying/index`.
es_la: Tenga en cuenta que :func:`run_simple <werkzeug.serving.run_simple>` no está pensado para su uso en producción. Utilice un servidor WSGI de producción. Consulte :doc:`/deploying/index`.

source: In order to use the interactive debugger, debugging must be enabled both on the application and the simple server. Here is the "hello world" example with debugging and :func:`run_simple <werkzeug.serving.run_simple>`::
es_la: Para poder utilizar el depurador interactivo, la depuración debe estar habilitada tanto en la aplicación como en el servidor simple. Aquí está el ejemplo de "hola mundo" con depuración y :func:`run_simple <werkzeug.serving.run_simple>`::

source: Combining Applications
es_la: Combinación de aplicaciones

source: If you have entirely separated applications and you want them to work next to each other in the same Python interpreter process you can take advantage of the :class:`werkzeug.wsgi.DispatcherMiddleware`. The idea here is that each Flask application is a valid WSGI application and they are combined by the dispatcher middleware into a larger one that is dispatched based on prefix.
es_la: Si tienes aplicaciones completamente separadas y quieres que funcionen una al lado de la otra en el mismo proceso de interpretación de Python puedes aprovechar la :class:`werkzeug.wsgi.DispatcherMiddleware`. La idea aquí es que cada aplicación Flask es una aplicación WSGI válida y son combinadas por el middleware despachador en una más grande que es despachada basada en el prefijo.

source: For example you could have your main application run on ``/`` and your backend interface on ``/backend``::
es_la: Por ejemplo, podrías tener tu aplicación principal ejecutada en ``/`` y tu interfaz backend en ``/backend``::

source: Dispatch by Subdomain
es_la: Despacho por subdominio

source: Sometimes you might want to use multiple instances of the same application with different configurations. Assuming the application is created inside a function and you can call that function to instantiate it, that is really easy to implement. In order to develop your application to support creating new instances in functions have a look at the :doc:`appfactories` pattern.
es_la: A veces puedes querer usar múltiples instancias de la misma aplicación con diferentes configuraciones. Asumiendo que la aplicación es creada dentro de una función y que puedes llamar a esa función para instanciarla, eso es realmente fácil de implementar. Para desarrollar tu aplicación de forma que soporte la creación de nuevas instancias en funciones echa un vistazo al patrón :doc:`appfactories`.

source: A very common example would be creating applications per subdomain. For instance you configure your webserver to dispatch all requests for all subdomains to your application and you then use the subdomain information to create user-specific instances. Once you have your server set up to listen on all subdomains you can use a very simple WSGI application to do the dynamic application creation.
es_la: Un ejemplo muy común sería crear aplicaciones por subdominio. Por ejemplo, configuras tu servidor web para que envíe todas las peticiones de todos los subdominios a tu aplicación y luego utilizas la información del subdominio para crear instancias específicas para cada usuario. Una vez que tengas tu servidor configurado para escuchar en todos los subdominios puedes usar una aplicación WSGI muy simple para hacer la creación de aplicaciones dinámicas.

source: The perfect level for abstraction in that regard is the WSGI layer. You write your own WSGI application that looks at the request that comes and delegates it to your Flask application. If that application does not exist yet, it is dynamically created and remembered::
es_la: El nivel perfecto de abstracción en ese sentido es la capa WSGI. Escribes tu propia aplicación WSGI que mira la petición que llega y la delega a tu aplicación Flask. Si esa aplicación no existe todavía, se crea dinámicamente y se recuerda::

source: This dispatcher can then be used like this::
es_la: Este despachador puede usarse así::

source: Dispatch by Path
es_la: Despacho por Ruta

source: Dispatching by a path on the URL is very similar. Instead of looking at the ``Host`` header to figure out the subdomain one simply looks at the request path up to the first slash::
es_la: La distribución por una ruta en la URL es muy similar. En lugar de mirar la cabecera ``Host`` para averiguar el subdominio simplemente se mira la ruta de la petición hasta la primera barra::

source: The big difference between this and the subdomain one is that this one falls back to another application if the creator function returns ``None``::
es_la: La gran diferencia entre ésta y la del subdominio es que ésta retrocede a otra aplicación si la función del creador devuelve ``None``::

source: Application Factories
es_la: Fábricas de aplicaciones

source: If you are already using packages and blueprints for your application (:doc:`/blueprints`) there are a couple of really nice ways to further improve the experience. A common pattern is creating the application object when the blueprint is imported. But if you move the creation of this object into a function, you can then create multiple instances of this app later.
es_la: Si ya estás usando paquetes y blueprints para tu aplicación (:doc:`/blueprints`) hay un par de formas muy buenas de mejorar la experiencia. Un patrón común es crear el objeto de la aplicación cuando se importa el blueprint. Pero si mueves la creación de este objeto a una función, puedes crear múltiples instancias de esta aplicación más tarde.

source: So why would you want to do this?
es_la: Entonces, ¿por qué querrías hacer esto?

source: Testing. You can have instances of the application with different settings to test every case.
es_la: Pruebas. Puedes tener instancias de la aplicación con diferentes configuraciones para probar cada caso.

source: Multiple instances. Imagine you want to run different versions of the same application. Of course you could have multiple instances with different configs set up in your webserver, but if you use factories, you can have multiple instances of the same application running in the same application process which can be handy.
es_la: Múltiples instancias. Imagina que quieres ejecutar diferentes versiones de la misma aplicación. Por supuesto, usted podría tener múltiples instancias con diferentes configuraciones establecidas en su servidor web, pero si usted utiliza las fábricas, puede tener múltiples instancias de la misma aplicación que se ejecuta en el mismo proceso de aplicación que puede ser útil.

source: So how would you then actually implement that?
es_la: Entonces, ¿cómo se implementa esto?

source: Basic Factories
es_la: Fábricas básicas

source: The idea is to set up the application in a function. Like this::
es_la: La idea es configurar la aplicación en una función. Así::

source: The downside is that you cannot use the application object in the blueprints at import time. You can however use it from within a request. How do you get access to the application with the config? Use :data:`~flask.current_app`::
es_la: El inconveniente es que no se puede utilizar el objeto de aplicación en los blueprints en el momento de la importación. Sin embargo, puede utilizarlo desde una solicitud. ¿Cómo se accede a la aplicación con la configuración? Utiliza :data:`~flask.current_app`::

source: Here we look up the name of a template in the config.
es_la: Aquí buscamos el nombre de una plantilla en la configuración.

source: Factories & Extensions
es_la: Fábricas y extensiones

source: It's preferable to create your extensions and app factories so that the extension object does not initially get bound to the application.
es_la: Es preferible crear tus extensiones y fábricas de aplicaciones de manera que el objeto de la extensión no se vincule inicialmente a la aplicación.

source: Using `Flask-SQLAlchemy <https://flask-sqlalchemy.palletsprojects.com/>`_, as an example, you should not do something along those lines::
es_la: Usando `Flask-SQLAlchemy <https://flask-sqlalchemy.palletsprojects.com/>`_, como ejemplo, no deberías hacer algo parecido a esto::

source: But, rather, in model.py (or equivalent)::
es_la: Pero, más bien, en model.py (o equivalente)::

source: and in your application.py (or equivalent)::
es_la: y en su aplicacion.py (o equivalente)::

source: Using this design pattern, no application-specific state is stored on the extension object, so one extension object can be used for multiple apps. For more information about the design of extensions refer to :doc:`/extensiondev`.
es_la: Utilizando este patrón de diseño, no se almacena ningún estado específico de la aplicación en el objeto de extensión, por lo que un objeto de extensión puede ser utilizado para múltiples aplicaciones. Para más información sobre el diseño de las extensiones, consulte :doc:`/extensiondev`.

source: Using Applications
es_la: Uso de aplicaciones

source: To run such an application, you can use the :command:`flask` command:
es_la: Para ejecutar una aplicación de este tipo, puede utilizar el comando :command:`flask`:

source: Flask will automatically detect the factory (``create_app`` or ``make_app``) in ``myapp``. You can also pass arguments to the factory like this:
es_la: Flask detectará automáticamente la fábrica (``create_app`` o ``make_app``) en ``miapp``. También puedes pasar argumentos a la fábrica así:

source: Then the ``create_app`` factory in ``myapp`` is called with the string ``'dev'`` as the argument. See :doc:`/cli` for more detail.
es_la: Entonces se llama a la fábrica ``create_app`` en ``miapp`` con la cadena ``'dev'`` como argumento. Ver :doc:`/cli` para más detalles.

source: Factory Improvements
es_la: Mejoras en la fábrica

source: The factory function above is not very clever, but you can improve it. The following changes are straightforward to implement:
es_la: La función de fábrica anterior no es muy inteligente, pero se puede mejorar. Los siguientes cambios son sencillos de implementar:

source: Make it possible to pass in configuration values for unit tests so that you don't have to create config files on the filesystem.
es_la: Hacer posible pasar valores de configuración para las pruebas unitarias para no tener que crear archivos de configuración en el sistema de archivos.

source: Call a function from a blueprint when the application is setting up so that you have a place to modify attributes of the application (like hooking in before/after request handlers etc.)
es_la: Llamar a una función desde un blueprint cuando la aplicación se está configurando para tener un lugar donde modificar los atributos de la aplicación (como enganchar los manejadores de peticiones antes/después, etc.)

source: Add in WSGI middlewares when the application is being created if necessary.
es_la: Añadir middlewares WSGI cuando la aplicación se está creando si es necesario.

source: Caching
es_la: Caché

source: When your application runs slow, throw some caches in. Well, at least it's the easiest way to speed up things. What does a cache do? Say you have a function that takes some time to complete but the results would still be good enough if they were 5 minutes old. So then the idea is that you actually put the result of that calculation into a cache for some time.
es_la: Cuando tu aplicación se ejecuta lentamente, pon algo de caché. Al menos es la forma más fácil de acelerar las cosas. ¿Qué hace una caché? Digamos que tienes una función que tarda algo de tiempo en completarse pero los resultados seguirían siendo lo suficientemente buenos si tuvieran 5 minutos de antigüedad. Entonces la idea es que pongas el resultado de ese cálculo en una caché durante algún tiempo.

source: Flask itself does not provide caching for you, but `Flask-Caching`_, an extension for Flask does. Flask-Caching supports various backends, and it is even possible to develop your own caching backend.
es_la: Flask por sí mismo no proporciona caché para usted, pero `Flask-Caching`_, una extensión para Flask lo hace. Flask-Caching soporta varios backends, e incluso es posible desarrollar tu propio backend de caché.

source: Celery Background Tasks
es_la: Tareas de fondo de Celery

source: If your application has a long running task, such as processing some uploaded data or sending email, you don't want to wait for it to finish during a request. Instead, use a task queue to send the necessary data to another process that will run the task in the background while the request returns immediately.
es_la: Si su aplicación tiene una tarea de larga duración, como el procesamiento de algunos datos cargados o el envío de correo electrónico, no querrá esperar a que termine durante una solicitud. En su lugar, utilice una cola de tareas para enviar los datos necesarios a otro proceso que ejecutará la tarea en segundo plano mientras la solicitud vuelve inmediatamente.

source: Celery is a powerful task queue that can be used for simple background tasks as well as complex multi-stage programs and schedules. This guide will show you how to configure Celery using Flask, but assumes you've already read the `First Steps with Celery <https://celery.readthedocs.io/en/latest/getting-started/first-steps-with-celery.html>`_ guide in the Celery documentation.
es_la: Celery es una poderosa cola de tareas que puede ser utilizada para tareas simples en segundo plano, así como para programas complejos de varias etapas y programaciones. Esta guía le mostrará cómo configurar Celery usando Flask, pero asume que ya ha leído la guía `Primeros pasos con Celery <https://celery.readthedocs.io/en/latest/getting-started/first-steps-with-celery.html>`_ en la documentación de Celery.

source: Install
es_la: Instalar

source: Celery is a separate Python package. Install it from PyPI using pip::
es_la: Celery es un paquete independiente de Python. Instálalo desde PyPI usando pip::

source: Configure
es_la: Configurar

source: The first thing you need is a Celery instance, this is called the celery application. It serves the same purpose as the :class:`~flask.Flask` object in Flask, just for Celery. Since this instance is used as the entry-point for everything you want to do in Celery, like creating tasks and managing workers, it must be possible for other modules to import it.
es_la: Lo primero que necesitas es una instancia de Celery, esto se llama la aplicación Celery. Sirve el mismo propósito que el objeto :class:`~flask.Flask` en Flask, sólo que para Celery. Dado que esta instancia se utiliza como punto de entrada para todo lo que quieres hacer en Celery, como la creación de tareas y la gestión de los trabajadores, debe ser posible que otros módulos lo importen.

source: For instance you can place this in a ``tasks`` module. While you can use Celery without any reconfiguration with Flask, it becomes a bit nicer by subclassing tasks and adding support for Flask's application contexts and hooking it up with the Flask configuration.
es_la: Por ejemplo, puedes colocar esto en un módulo ``tasks``. Aunque puedes usar Celery sin ninguna reconfiguración con Flask, se vuelve un poco más agradable subclasificando tasks y añadiendo soporte para los contextos de aplicación de Flask y enganchándolo con la configuración de Flask.

source: This is all that is necessary to properly integrate Celery with Flask::
es_la: Esto es todo lo que se necesita para integrar adecuadamente Celery con Flask::

source: The function creates a new Celery object, configures it with the broker from the application config, updates the rest of the Celery config from the Flask config and then creates a subclass of the task that wraps the task execution in an application context.
es_la: La función crea un nuevo objeto Celery, lo configura con el broker desde la configuración de la aplicación, actualiza el resto de la configuración de Celery desde la configuración de Flask y luego crea una subclase de la tarea que envuelve la ejecución de la tarea en un contexto de aplicación.

source: An example task
es_la: Una tarea de ejemplo

source: Let's write a task that adds two numbers together and returns the result. We configure Celery's broker and backend to use Redis, create a ``celery`` application using the factor from above, and then use it to define the task. ::
es_la: Vamos a escribir una tarea que sume dos números y devuelva el resultado. Configuramos el broker y el backend de Celery para usar Redis, creamos una aplicación ``celery`` usando el factor de arriba, y luego lo usamos para definir la tarea. ::

source: This task can now be called in the background::
es_la: Esta tarea puede llamarse ahora en segundo plano::

source: Run a worker
es_la: Ejecutar un trabajador

source: If you jumped in and already executed the above code you will be disappointed to learn that ``.wait()`` will never actually return. That's because you also need to run a Celery worker to receive and execute the task. ::
es_la: Si te has lanzado y ya has ejecutado el código anterior, te decepcionará saber que ``.wait()`` nunca devolverá realmente. Esto se debe a que también es necesario ejecutar un trabajador Celery para recibir y ejecutar la tarea ::

source: The ``your_application`` string has to point to your application's package or module that creates the ``celery`` object.
es_la: La cadena ``tu_aplicación`` tiene que apuntar al paquete o módulo de tu aplicación que crea el objeto ``celery``.

source: Now that the worker is running, ``wait`` will return the result once the task is finished.
es_la: Ahora que el trabajador se está ejecutando, ``wait`` devolverá el resultado una vez que la tarea haya terminado.

source: Deferred Request Callbacks
es_la: Callbacks en diferido

source: One of the design principles of Flask is that response objects are created and passed down a chain of potential callbacks that can modify them or replace them. When the request handling starts, there is no response object yet. It is created as necessary either by a view function or by some other component in the system.
es_la: Uno de los principios de diseño de Flask es que los objetos de respuesta son creados y pasados por una cadena de potenciales callbacks que pueden modificarlos o reemplazarlos. Cuando se inicia la gestión de la solicitud, todavía no hay un objeto de respuesta. Se crea según sea necesario por una función de la vista o por algún otro componente del sistema.

source: What happens if you want to modify the response at a point where the response does not exist yet? A common example for that would be a :meth:`~flask.Flask.before_request` callback that wants to set a cookie on the response object.
es_la: ¿Qué ocurre si se quiere modificar la respuesta en un punto en el que ésta aún no existe? Un ejemplo común para esto sería un callback :meth:`~flask.Flask.before_request` que quiere establecer una cookie en el objeto de respuesta.

source: One way is to avoid the situation. Very often that is possible. For instance you can try to move that logic into a :meth:`~flask.Flask.after_request` callback instead. However, sometimes moving code there makes it more complicated or awkward to reason about.
es_la: Una forma es evitar la situación. Muy a menudo eso es posible. Por ejemplo, puedes intentar mover esa lógica a un callback :meth:`~flask.Flask.after_request` en su lugar. Sin embargo, a veces mover el código allí lo hace más complicado o incómodo de razonar.

source: As an alternative, you can use :func:`~flask.after_this_request` to register callbacks that will execute after only the current request. This way you can defer code execution from anywhere in the application, based on the current request.
es_la: Como alternativa, puedes usar :func:`~flask.after_this_request` para registrar callbacks que se ejecutarán sólo después de la petición actual. De esta manera puedes diferir la ejecución de código desde cualquier parte de la aplicación, basándote en la petición actual.

source: At any time during a request, we can register a function to be called at the end of the request. For example you can remember the current language of the user in a cookie in a :meth:`~flask.Flask.before_request` callback::
es_la: En cualquier momento durante una petición, podemos registrar una función para ser llamada al final de la petición. Por ejemplo puedes recordar el idioma actual del usuario en una cookie en un callback :meth:`~flask.Flask.before_request`::

source: Deploying with Setuptools
es_la: Despliegue con Setuptools

source: `Setuptools`_, is an extension library that is commonly used to distribute Python libraries and extensions. It extends distutils, a basic module installation system shipped with Python to also support various more complex constructs that make larger applications easier to distribute:
es_la: `Setuptools`_, es una biblioteca de extensión que se utiliza comúnmente para distribuir bibliotecas y extensiones de Python. Extiende distutils, un sistema básico de instalación de módulos incluido en Python, para soportar también varias construcciones más complejas que hacen que las aplicaciones más grandes sean más fáciles de distribuir:

source: **support for dependencies**: a library or application can declare a list of other libraries it depends on which will be installed automatically for you.
es_la: **Soporte para dependencias**: Una librería o aplicación puede declarar una lista de otras librerías de las que depende, que se instalarán automáticamente por ti.
