Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/patterns.po
Languages: es_la

source: **package registry**: setuptools registers your package with your Python installation. This makes it possible to query information provided by one package from another package. The best known feature of this system is the entry point support which allows one package to declare an "entry point" that another package can hook into to extend the other package.
es_la: **Registro de paquetes**: setuptools registra su paquete con su instalación de Python. Esto permite consultar la información proporcionada por un paquete desde otro paquete. La característica más conocida de este sistema es el soporte de punto de entrada que permite a un paquete declarar un "punto de entrada" al que otro paquete puede engancharse para extender el otro paquete.

source: **installation manager**: :command:`pip` can install other libraries for you.
es_la: **Gestor de instalación**: :command:`pip` puede instalar otras bibliotecas por ti.

source: Flask itself, and all the libraries you can find on PyPI are distributed with either setuptools or distutils.
es_la: El propio Flask y todas las bibliotecas que puedes encontrar en PyPI se distribuyen con setuptools o distutils.

source: In this case we assume your application is called :file:`yourapplication.py` and you are not using a module, but a package. If you have not yet converted your application into a package, head over to :doc:`packages` to see how this can be done.
es_la: En este caso asumimos que tu aplicación se llama :file:`tuaplicacion.py` y que no estás usando un módulo, sino un paquete. Si aún no has convertido tu aplicación en un paquete, dirígete a :doc:`packages` para ver cómo hacerlo.

source: A working deployment with setuptools is the first step into more complex and more automated deployment scenarios. If you want to fully automate the process, also read the :doc:`fabric` chapter.
es_la: Un despliegue de trabajo con setuptools es el primer paso hacia escenarios de despliegue más complejos y automatizados. Si quieres automatizar completamente el proceso, lee también el capítulo :doc:`fabric`.

source: Basic Setup Script
es_la: Script de configuración básica

source: Because you have Flask installed, you have setuptools available on your system. Flask already depends upon setuptools.
es_la: Como tienes Flask instalado, tienes setuptools disponible en tu sistema. Flask ya depende de setuptools.

source: Standard disclaimer applies: :ref:`use a virtualenv <install-create-env>`.
es_la: Se aplica la exención de responsabilidad estándar: :ref:`use a virtualenv <install-create-env>`.

source: Your setup code always goes into a file named :file:`setup.py` next to your application. The name of the file is only convention, but because everybody will look for a file with that name, you better not change it.
es_la: Su código de instalación siempre va en un archivo llamado :file:`setup.py` junto a su aplicación. El nombre del archivo es sólo una convención, pero como todo el mundo buscará un archivo con ese nombre, es mejor que no lo cambies.

source: A basic :file:`setup.py` file for a Flask application looks like this::
es_la: Un archivo básico :file:`setup.py` para una aplicación Flask tiene el siguiente aspecto::

source: Please keep in mind that you have to list subpackages explicitly. If you want setuptools to lookup the packages for you automatically, you can use the ``find_packages`` function::
es_la: Tenga en cuenta que tiene que listar los subpaquetes explícitamente. Si quiere que setuptools busque los paquetes automáticamente, puede utilizar la función ``find_packages``::

source: Most parameters to the ``setup`` function should be self explanatory, ``include_package_data`` and ``zip_safe`` might not be. ``include_package_data`` tells setuptools to look for a :file:`MANIFEST.in` file and install all the entries that match as package data. We will use this to distribute the static files and templates along with the Python module (see :ref:`distributing-resources`). The ``zip_safe`` flag can be used to force or prevent zip Archive creation. In general you probably don't want your packages to be installed as zip files because some tools do not support them and they make debugging a lot harder.
es_la: La mayoría de los parámetros de la función ``setup`` deberían ser autoexplicativos, ``include_package_data`` y ``zip_safe`` podrían no serlo. ``include_package_data`` le dice a setuptools que busque un archivo :file:`MANIFEST.in` e instale todas las entradas que coincidan como datos del paquete. Usaremos esto para distribuir los archivos estáticos y las plantillas junto con el módulo de Python (ver :ref:`distribuyendo-recursos`). La bandera ``zip_safe`` puede utilizarse para forzar o evitar la creación de archivos zip. En general, probablemente no quieras que tus paquetes se instalen como archivos zip porque algunas herramientas no los soportan y dificultan mucho la depuración.

source: Tagging Builds
es_la: Etiquetado de Builds

source: It is useful to distinguish between release and development builds. Add a :file:`setup.cfg` file to configure these options. ::
es_la: Es útil para distinguir entre las compilaciones de lanzamiento y las de desarrollo. Añade un archivo :file:`setup.cfg` para configurar estas opciones. ::

source: Running ``python setup.py sdist`` will create a development package with ".dev" and the current date appended: ``flaskr-1.0.dev20160314.tar.gz``. Running ``python setup.py release sdist`` will create a release package with only the version: ``flaskr-1.0.tar.gz``.
es_la: Al ejecutar ``python setup.py sdist`` se creará un paquete de desarrollo con ".dev" y la fecha actual añadida: ``flaskr-1.0.dev20160314.tar.gz``. Ejecutando ``python setup.py release sdist`` se creará un paquete de lanzamiento con sólo la versión: ``flaskr-1.0.tar.gz``.

source: Distributing Resources
es_la: Distribución de recursos

source: If you try to install the package you just created, you will notice that folders like :file:`static` or :file:`templates` are not installed for you. The reason for this is that setuptools does not know which files to add for you. What you should do, is to create a :file:`MANIFEST.in` file next to your :file:`setup.py` file. This file lists all the files that should be added to your tarball::
es_la: Si intenta instalar el paquete que acaba de crear, se dará cuenta de que carpetas como :file:`static` o :file:`templates` no se instalan por usted. La razón de esto es que setuptools no sabe qué archivos añadir por usted. Lo que debe hacer, es crear un archivo :file:`MANIFEST.in` junto a su archivo :file:`setup.py`. Este archivo lista todos los archivos que deben ser añadidos a su tarball::

source: Don't forget that even if you enlist them in your :file:`MANIFEST.in` file, they won't be installed for you unless you set the `include_package_data` parameter of the ``setup`` function to ``True``!
es_la: ¡No olvide que, aunque los incluya en su archivo :file:`MANIFEST.in`, no se instalarán si no establece el parámetro `include_package_data` de la función ``setup`` a ``True``!

source: Declaring Dependencies
es_la: Declarar las dependencias

source: Dependencies are declared in the ``install_requires`` parameter as a list. Each item in that list is the name of a package that should be pulled from PyPI on installation. By default it will always use the most recent version, but you can also provide minimum and maximum version requirements. Here some examples::
es_la: Las dependencias se declaran en el parámetro ``install_requires`` como una lista. Cada elemento de esa lista es el nombre de un paquete que debe ser extraído de PyPI en la instalación. Por defecto, siempre se utilizará la versión más reciente, pero también se pueden proporcionar requisitos de versión mínimos y máximos. Aquí algunos ejemplos::

source: As mentioned earlier, dependencies are pulled from PyPI. What if you want to depend on a package that cannot be found on PyPI and won't be because it is an internal package you don't want to share with anyone? Just do it as if there was a PyPI entry and provide a list of alternative locations where setuptools should look for tarballs::
es_la: Como se mencionó anteriormente, las dependencias se extraen de PyPI. ¿Qué pasa si quieres depender de un paquete que no se puede encontrar en PyPI y no se encontrará porque es un paquete interno que no quieres compartir con nadie? Simplemente hazlo como si hubiera una entrada en PyPI y proporciona una lista de ubicaciones alternativas donde setuptools debería buscar los tarballs::

source: Make sure that page has a directory listing and the links on the page are pointing to the actual tarballs with their correct filenames as this is how setuptools will find the files. If you have an internal company server that contains the packages, provide the URL to that server.
es_la: Asegúrese de que esa página tiene un listado de directorios y que los enlaces de la página apuntan a los verdaderos tarballs con sus nombres de archivo correctos, ya que así es como setuptools encontrará los archivos. Si tiene un servidor interno de la empresa que contiene los paquetes, proporcione la URL de ese servidor.

source: Installing / Developing
es_la: Instalación / Desarrollo

source: To install your application (ideally into a virtualenv) just run the :file:`setup.py` script with the ``install`` parameter. It will install your application into the virtualenv's site-packages folder and also download and install all dependencies::
es_la: Para instalar tu aplicación (idealmente en un virtualenv) simplemente ejecuta el script :file:`setup.py` con el parámetro ``install``. Instalará tu aplicación en la carpeta site-packages del virtualenv y también descargará e instalará todas las dependencias::

source: If you are developing on the package and also want the requirements to be installed, you can use the ``develop`` command instead::
es_la: Si está desarrollando en el paquete y también quiere que se instalen los requisitos, puede utilizar el comando ``develop`` en su lugar::

source: This has the advantage of just installing a link to the site-packages folder instead of copying the data over. You can then continue to work on the code without having to run ``install`` again after each change.
es_la: Esto tiene la ventaja de que sólo se instala un enlace a la carpeta de paquetes del sitio en lugar de copiar los datos. De este modo, puede continuar trabajando en el código sin tener que ejecutar ``install`` de nuevo después de cada cambio.

source: Deploying with Fabric
es_la: Despliegue con Fabric

source: `Fabric`_ is a tool for Python similar to Makefiles but with the ability to execute commands on a remote server. In combination with a properly set up Python package (:doc:`packages`) and a good concept for configurations (:doc:`/config`) it is very easy to deploy Flask applications to external servers.
es_la: `Fabric`_ es una herramienta para Python similar a Makefiles pero con la capacidad de ejecutar comandos en un servidor remoto. En combinación con un paquete Python correctamente configurado (:doc:`packages`) y un buen concepto de configuraciones (:doc:`/config`) es muy fácil desplegar aplicaciones Flask en servidores externos.

source: Before we get started, here a quick checklist of things we have to ensure upfront:
es_la: Antes de empezar, aquí una lista rápida de cosas que tenemos que asegurar por adelantado:

source: Fabric 1.0 has to be installed locally. This tutorial assumes the latest version of Fabric.
es_la: Fabric 1.0 tiene que ser instalado localmente. Este tutorial asume la última versión de Fabric.

source: The application already has to be a package and requires a working :file:`setup.py` file (:doc:`distribute`).
es_la: La aplicación ya tiene que ser un paquete y requiere un archivo :file:`setup.py` que funcione (:doc:`distribute`).

source: In the following example we are using `mod_wsgi` for the remote servers. You can of course use your own favourite server there, but for this example we chose Apache + `mod_wsgi` because it's very easy to setup and has a simple way to reload applications without root access.
es_la: En el siguiente ejemplo estamos usando `mod_wsgi` para los servidores remotos. Por supuesto, puedes usar tu propio servidor favorito, pero para este ejemplo elegimos Apache + `mod_wsgi` porque es muy fácil de configurar y tiene una forma sencilla de recargar las aplicaciones sin acceso de root.

source: Creating the first Fabfile
es_la: Creación del primer Fabfile

source: A fabfile is what controls what Fabric executes. It is named :file:`fabfile.py` and executed by the `fab` command. All the functions defined in that file will show up as `fab` subcommands. They are executed on one or more hosts. These hosts can be defined either in the fabfile or on the command line. In this case we will add them to the fabfile.
es_la: Un fabfile es lo que controla lo que ejecuta Fabric. Se llama :file:`fabfile.py` y es ejecutado por el comando `fab`. Todas las funciones definidas en ese fichero aparecerán como subcomandos `fab`. Se ejecutan en uno o más hosts. Estos hosts pueden ser definidos tanto en el fabfile como en la línea de comandos. En este caso los añadiremos al fabfile.

source: This is a basic first example that has the ability to upload the current source code to the server and install it into a pre-existing virtual environment::
es_la: Este es un primer ejemplo básico que tiene la capacidad de subir el código fuente actual al servidor e instalarlo en un entorno virtual preexistente::

source: Running Fabfiles
es_la: Ejecución de Fabfiles

source: Now how do you execute that fabfile? You use the `fab` command. To deploy the current version of the code on the remote server you would use this command::
es_la: Ahora, ¿cómo se ejecuta ese fabfile? Utiliza el comando `fab`. Para desplegar la versión actual del código en el servidor remoto usarías este comando::

source: However this requires that our server already has the :file:`/var/www/yourapplication` folder created and :file:`/var/www/yourapplication/env` to be a virtual environment. Furthermore are we not creating the configuration or ``.wsgi`` file on the server. So how do we bootstrap a new server into our infrastructure?
es_la: Sin embargo esto requiere que nuestro servidor ya tenga la carpeta :file:`/var/www/tuaplicacion` creada y :file:`/var/www/tuaplicacion/env` para ser un entorno virtual. Además no estamos creando el archivo de configuración o ``.wsgi`` en el servidor. Entonces, ¿como arrancamos un nuevo servidor en nuestra infraestructura?

source: This now depends on the number of servers we want to set up. If we just have one application server (which the majority of applications will have), creating a command in the fabfile for this is overkill. But obviously you can do that. In that case you would probably call it `setup` or `bootstrap` and then pass the servername explicitly on the command line::
es_la: Esto depende ahora del número de servidores que queramos configurar. Si sólo tenemos un servidor de aplicaciones (que es lo que tendrán la mayoría de las aplicaciones), crear un comando en el fabfile para esto es excesivo. Pero obviamente se puede hacer. En ese caso probablemente lo llamarías `setup` o `bootstrap` y luego pasarías el nombre del servidor explícitamente en la línea de comandos::

source: To setup a new server you would roughly do these steps:
es_la: Para configurar un nuevo servidor, se deben seguir los siguientes pasos:

source: Create the directory structure in :file:`/var/www`::
es_la: Cree la estructura de directorios en :file:`/var/www`::

source: Upload a new :file:`application.wsgi` file to the server and the configuration file for the application (eg: :file:`application.cfg`)
es_la: Suba un nuevo archivo :file:`aplicacion.wsgi` al servidor y el archivo de configuración de la aplicación (por ejemplo: :file:`aplicacion.cfg`)

source: Create a new Apache config for ``yourapplication`` and activate it. Make sure to activate watching for changes of the ``.wsgi`` file so that we can automatically reload the application by touching it. See :doc:`/deploying/mod_wsgi`.
es_la: Crea una nueva configuración de Apache para ``tuaplicacion`` y actívala. Asegúrate de activar la vigilancia de los cambios del archivo ``.wsgi`` para que podamos recargar automáticamente la aplicación al tocarlo. Ver :doc:`/deploying/mod_wsgi`.

source: So now the question is, where do the :file:`application.wsgi` and :file:`application.cfg` files come from?
es_la: Así que ahora la pregunta es, ¿de dónde vienen los archivos :file:`aplicacion.wsgi` y :file:`aplicacion.cfg`?

source: The WSGI File
es_la: El archivo WSGI

source: The WSGI file has to import the application and also to set an environment variable so that the application knows where to look for the config. This is a short example that does exactly that::
es_la: El archivo WSGI tiene que importar la aplicación y también establecer una variable de entorno para que la aplicación sepa dónde buscar la configuración. Este es un breve ejemplo que hace exactamente eso::

source: The application itself then has to initialize itself like this to look for the config at that environment variable::
es_la: La propia aplicación tiene que inicializarse así para buscar la configuración en esa variable de entorno::

source: This approach is explained in detail in the :doc:`/config` section of the documentation.
es_la: Este enfoque se explica en detalle en la sección :doc:`/config` de la documentación.

source: The Configuration File
es_la: El archivo de configuración

source: Now as mentioned above, the application will find the correct configuration file by looking up the ``YOURAPPLICATION_CONFIG`` environment variable. So we have to put the configuration in a place where the application will able to find it. Configuration files have the unfriendly quality of being different on all computers, so you do not version them usually.
es_la: Ahora, como se mencionó anteriormente, la aplicación encontrará el archivo de configuración correcto buscando la variable de entorno ``tuaplicacion_CONFIG``. Así que tenemos que poner la configuración en un lugar donde la aplicación sea capaz de encontrarla. Los ficheros de configuración tienen la antipática cualidad de ser diferentes en todos los ordenadores, por lo que no se suelen versionar.

source: A popular approach is to store configuration files for different servers in a separate version control repository and check them out on all servers. Then symlink the file that is active for the server into the location where it's expected (eg: :file:`/var/www/yourapplication`).
es_la: Un enfoque popular es almacenar los archivos de configuración para diferentes servidores en un repositorio de control de versiones separado y comprobarlos en todos los servidores. Entonces se hace un enlace simbólico al archivo que está activo para el servidor en la ubicación donde se espera (por ejemplo: :file:`/var/www/tuaplicacion`).

source: Either way, in our case here we only expect one or two servers and we can upload them ahead of time by hand.
es_la: De cualquier forma, en nuestro caso sólo esperamos uno o dos servidores y podemos subirlos antes a mano.

source: First Deployment
es_la: Primer despliegue

source: Now we can do our first deployment. We have set up the servers so that they have their virtual environments and activated apache configs. Now we can pack up the application and deploy it::
es_la: Ahora podemos hacer nuestro primer despliegue. Hemos configurado los servidores para que tengan sus entornos virtuales y activado las configuraciones de apache. Ahora podemos empaquetar la aplicación y desplegarla::

source: Fabric will now connect to all servers and run the commands as written down in the fabfile. First it will execute pack so that we have our tarball ready and then it will execute deploy and upload the source code to all servers and install it there. Thanks to the :file:`setup.py` file we will automatically pull in the required libraries into our virtual environment.
es_la: Fabric se conectará ahora a todos los servidores y ejecutará los comandos tal y como están escritos en el fabfile. Primero ejecutará pack para que tengamos nuestro tarball listo y luego ejecutará deploy y subirá el código fuente a todos los servidores y lo instalará allí. Gracias al archivo :file:`setup.py` automáticamente se incorporarán las librerías necesarias a nuestro entorno virtual.

source: Next Steps
es_la: Próximos pasos

source: From that point onwards there is so much that can be done to make deployment actually fun:
es_la: A partir de ahí, hay muchas cosas que se pueden hacer para que la implantación sea realmente divertida:

source: Create a `bootstrap` command that initializes new servers. It could initialize a new virtual environment, setup apache appropriately etc.
es_la: Crear un comando `bootstrap` que inicialice los nuevos servidores. Podría inicializar un nuevo entorno virtual, configurar apache adecuadamente, etc.

source: Put configuration files into a separate version control repository and symlink the active configs into place.
es_la: Poner los archivos de configuración en un repositorio de control de versiones separado y hacer un enlace simbólico a las configuraciones activas en su lugar.

source: You could also put your application code into a repository and check out the latest version on the server and then install. That way you can also easily go back to older versions.
es_la: También podría poner el código de su aplicación en un repositorio y comprobar la última versión en el servidor y luego instalar. De esta manera también puedes volver fácilmente a versiones anteriores.

source: hook in testing functionality so that you can deploy to an external server and run the test suite.
es_la: enganche en la funcionalidad de pruebas para que pueda desplegar a un servidor externo y ejecutar el conjunto de pruebas.

source: Working with Fabric is fun and you will notice that it's quite magical to type ``fab deploy`` and see your application being deployed automatically to one or more remote servers.
es_la: Trabajar con Fabric es divertido y te darás cuenta de que es bastante mágico escribir ``fab deploy`` y ver que tu aplicación se despliega automáticamente en uno o más servidores remotos.

source: Adding a favicon
es_la: Añadir un favicon

source: A "favicon" is an icon used by browsers for tabs and bookmarks. This helps to distinguish your website and to give it a unique brand.
es_la: Un "favicon" es un icono utilizado por los navegadores para las pestañas y los marcadores. Esto ayuda a distinguir su sitio web y a darle una marca única.

source: A common question is how to add a favicon to a Flask application. First, of course, you need an icon. It should be 16 × 16 pixels and in the ICO file format. This is not a requirement but a de-facto standard supported by all relevant browsers. Put the icon in your static directory as :file:`favicon.ico`.
es_la: Una pregunta común es cómo añadir un favicon a una aplicación Flask. Primero, por supuesto, necesitas un icono. Debe tener 16 × 16 píxeles y estar en el formato de archivo ICO. Esto no es un requisito, sino un estándar de facto soportado por todos los navegadores relevantes. Pon el icono en tu directorio estático como :file:`favicon.ico`.

source: Now, to get browsers to find your icon, the correct way is to add a link tag in your HTML. So, for example:
es_la: Ahora, para que los navegadores encuentren tu icono, la forma correcta es añadir una etiqueta de enlace en tu HTML. Así, por ejemplo:
