Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/patterns.po
Languages: es_la

source: There are four very common ways to use SQLAlchemy. I will outline each of them here:
es_la: Hay cuatro formas muy comunes de utilizar SQLAlchemy. A continuación, describiré cada una de ellas:

source: Flask-SQLAlchemy Extension
es_la: Extensión Flask-SQLAlchemy

source: Because SQLAlchemy is a common database abstraction layer and object relational mapper that requires a little bit of configuration effort, there is a Flask extension that handles that for you. This is recommended if you want to get started quickly.
es_la: Debido a que SQLAlchemy es una capa de abstracción de base de datos común y un mapeador relacional de objetos que requiere un poco de esfuerzo de configuración, hay una extensión de Flask que maneja eso por ti. Esto se recomienda si quieres empezar rápidamente.

source: You can download `Flask-SQLAlchemy`_ from `PyPI <https://pypi.org/project/Flask-SQLAlchemy/>`_.
es_la: Debido a que SQLAlchemy es una capa de abstracción de base de datos común y un mapeador relacional de objetos que requiere un poco de esfuerzo de configuración, hay una extensión de Flask que maneja eso por ti. Esto se recomienda si quieres empezar rápidamente.

source: Declarative
es_la: Declarativo

source: The declarative extension in SQLAlchemy is the most recent method of using SQLAlchemy. It allows you to define tables and models in one go, similar to how Django works. In addition to the following text I recommend the official documentation on the `declarative`_ extension.
es_la: La extensión declarativa en SQLAlchemy es el método más reciente de utilizar SQLAlchemy. Permite definir tablas y modelos de una sola vez, de forma similar a como funciona Django. Además del siguiente texto recomiendo la documentación oficial sobre la extensión `declarative`_.

source: Here's the example :file:`database.py` module for your application::
es_la: Aquí está el módulo de ejemplo :file:`database.py` para su aplicación::

source: To define your models, just subclass the `Base` class that was created by the code above. If you are wondering why we don't have to care about threads here (like we did in the SQLite3 example above with the :data:`~flask.g` object): that's because SQLAlchemy does that for us already with the :class:`~sqlalchemy.orm.scoped_session`.
es_la: Para definir tus modelos, sólo tienes que subclasificar la clase `Base` que fue creada por el código anterior. Si te preguntas por qué no tenemos que preocuparnos de los hilos aquí (como hicimos en el ejemplo de SQLite3 anterior con el objeto :data:`~flask.g`): es porque SQLAlchemy ya lo hace por nosotros con la clase :`~sqlalchemy.orm.scoped_session`.

source: To use SQLAlchemy in a declarative way with your application, you just have to put the following code into your application module. Flask will automatically remove database sessions at the end of the request or when the application shuts down::
es_la: Para utilizar SQLAlchemy de forma declarativa con tu aplicación, sólo tienes que poner el siguiente código en tu módulo de aplicación. Flask eliminará automáticamente las sesiones de la base de datos al final de la solicitud o cuando la aplicación se cierre::

source: Here is an example model (put this into :file:`models.py`, e.g.)::
es_la: He aquí un modelo de ejemplo (ponlo en :file:`models.py`, por ejemplo)::

source: To create the database you can use the `init_db` function:
es_la: Para crear la base de datos puedes utilizar la función `init_db`:

source: You can insert entries into the database like this:
es_la: Puede insertar entradas en la base de datos de la siguiente manera:

source: Querying is simple as well:
es_la: La consulta también es sencilla:

source: Manual Object Relational Mapping
es_la: Mapeo relacional de objetos manual

source: Manual object relational mapping has a few upsides and a few downsides versus the declarative approach from above. The main difference is that you define tables and classes separately and map them together. It's more flexible but a little more to type. In general it works like the declarative approach, so make sure to also split up your application into multiple modules in a package.
es_la: El mapeo relacional de objetos manual tiene algunas ventajas y algunas desventajas frente al enfoque declarativo anterior. La principal diferencia es que se definen tablas y clases por separado y se mapean juntas. Es más flexible, pero un poco más complicado de escribir. En general, funciona como el enfoque declarativo, así que asegúrese de dividir también su aplicación en varios módulos en un paquete.

source: Here is an example :file:`database.py` module for your application::
es_la: Aquí hay un ejemplo de módulo :file:`database.py` para tu aplicación::

source: As in the declarative approach, you need to close the session after each request or application context shutdown. Put this into your application module::
es_la: Al igual que en el enfoque declarativo, es necesario cerrar la sesión después de cada solicitud o cierre del contexto de la aplicación. Ponga esto en su módulo de aplicación::

source: Here is an example table and model (put this into :file:`models.py`)::
es_la: He aquí una tabla y un modelo de ejemplo (ponlo en :file:`models.py`)::

source: Querying and inserting works exactly the same as in the example above.
es_la: La consulta y la inserción funcionan exactamente igual que en el ejemplo anterior.

source: SQL Abstraction Layer
es_la: Capa de abstracción SQL

source: If you just want to use the database system (and SQL) abstraction layer you basically only need the engine::
es_la: Si sólo quieres utilizar la capa de abstracción del sistema de base de datos (y SQL) básicamente sólo necesitas el motor::

source: Then you can either declare the tables in your code like in the examples above, or automatically load them::
es_la: Entonces puedes declarar las tablas en tu código como en los ejemplos anteriores, o cargarlas automáticamente::

source: To insert data you can use the `insert` method. We have to get a connection first so that we can use a transaction:
es_la: Para insertar datos se puede utilizar el método `insert`. Primero tenemos que obtener una conexión para poder utilizar una transacción:

source: SQLAlchemy will automatically commit for us.
es_la: SQLAlchemy se compromete automáticamente por nosotros.

source: To query your database, you use the engine directly or use a connection:
es_la: Para consultar la base de datos, se utiliza el motor directamente o se utiliza una conexión:

source: These results are also dict-like tuples:
es_la: Estos resultados también son tuplas de tipo dictado:

source: You can also pass strings of SQL statements to the :meth:`~sqlalchemy.engine.base.Connection.execute` method:
es_la: También puedes pasar cadenas de sentencias SQL al método :meth:`~sqlalchemy.engine.base.Connection.execute`:

source: For more information about SQLAlchemy, head over to the `website <https://www.sqlalchemy.org/>`_.
es_la: Para obtener más información sobre SQLAlchemy, diríjase al `sitio web <https://www.sqlalchemy.org/>`_.

source: Using SQLite 3 with Flask
es_la: Uso de SQLite 3 con Flask

source: In Flask you can easily implement the opening of database connections on demand and closing them when the context dies (usually at the end of the request).
es_la: En Flask puedes implementar fácilmente la apertura de conexiones a la base de datos bajo demanda y el cierre de las mismas cuando el contexto muere (normalmente al final de la petición).

source: Here is a simple example of how you can use SQLite 3 with Flask::
es_la: Aquí hay un ejemplo sencillo de cómo se puede utilizar SQLite 3 con Flask::

source: Now, to use the database, the application must either have an active application context (which is always true if there is a request in flight) or create an application context itself. At that point the ``get_db`` function can be used to get the current database connection. Whenever the context is destroyed the database connection will be terminated.
es_la: Ahora, para usar la base de datos, la aplicación debe tener un contexto de aplicación activo (que siempre es cierto si hay una petición en vuelo) o crear un contexto de aplicación por sí misma. En ese momento se puede utilizar la función ``get_db`` para obtener la conexión a la base de datos actual. Siempre que el contexto se destruya, la conexión a la base de datos se terminará.

source: Note: if you use Flask 0.9 or older you need to use ``flask._app_ctx_stack.top`` instead of ``g`` as the :data:`flask.g` object was bound to the request and not application context.
es_la: Nota: si usas Flask 0.9 o anterior debes usar ``flask._app_ctx_stack.top`` en lugar de ``g`` ya que el objeto :data:`flask.g` estaba ligado a la petición y no al contexto de la aplicación.

source: Example::
es_la: Ejemplo::

source: Please keep in mind that the teardown request and appcontext functions are always executed, even if a before-request handler failed or was never executed. Because of this we have to make sure here that the database is there before we close it.
es_la: Ten en cuenta que las funciones teardown request y appcontext se ejecutan siempre, incluso si un manejador before-request falló o nunca se ejecutó. Debido a esto tenemos que asegurarnos aquí de que la base de datos está ahí antes de cerrarla.

source: Connect on Demand
es_la: Conectar a la carta

source: The upside of this approach (connecting on first use) is that this will only open the connection if truly necessary. If you want to use this code outside a request context you can use it in a Python shell by opening the application context by hand::
es_la: La ventaja de este enfoque (conectar en el primer uso) es que esto sólo abrirá la conexión si es realmente necesario. Si quieres usar este código fuera de un contexto de petición puedes usarlo en un shell de Python abriendo el contexto de aplicación a mano::

source: Easy Querying
es_la: Consulta fácil

source: Now in each request handling function you can access `get_db()` to get the current open database connection. To simplify working with SQLite, a row factory function is useful. It is executed for every result returned from the database to convert the result. For instance, in order to get dictionaries instead of tuples, this could be inserted into the ``get_db`` function we created above::
es_la: Ahora en cada función de manejo de peticiones puedes acceder a `get_db()` para obtener la conexión actual de la base de datos abierta. Para simplificar el trabajo con SQLite, es útil una función de fábrica de filas. Se ejecuta para cada resultado devuelto por la base de datos para convertir el resultado. Por ejemplo, para obtener diccionarios en lugar de tuplas, esto podría ser insertado en la función ``get_db`` que creamos anteriormente::

source: This will make the sqlite3 module return dicts for this database connection, which are much nicer to deal with. Even more simply, we could place this in ``get_db`` instead::
es_la: Esto hará que el módulo sqlite3 devuelva dicts para esta conexión de base de datos, que son mucho más agradables de manejar. Incluso más simple, podríamos colocar esto en ``get_db`` en su lugar::

source: This would use Row objects rather than dicts to return the results of queries. These are ``namedtuple`` s, so we can access them either by index or by key. For example, assuming we have a ``sqlite3.Row`` called ``r`` for the rows ``id``, ``FirstName``, ``LastName``, and ``MiddleInitial``::
es_la: Esto utilizaría objetos Row en lugar de dicts para devolver los resultados de las consultas. Son ``tuplas con nombre``, por lo que podemos acceder a ellas por índice o por clave. Por ejemplo, suponiendo que tenemos un ``sqlite3.Row`` llamado ``r`` para las filas ``id``, ``FirstName``, ``LastName``, y ``MiddleInitial``::

source: Additionally, it is a good idea to provide a query function that combines getting the cursor, executing and fetching the results::
es_la: Además, es una buena idea proporcionar una función de consulta que combine la obtención del cursor, la ejecución y la obtención de los resultados::

source: This handy little function, in combination with a row factory, makes working with the database much more pleasant than it is by just using the raw cursor and connection objects.
es_la: Esta pequeña y práctica función, en combinación con una fábrica de filas, hace que el trabajo con la base de datos sea mucho más agradable de lo que es utilizando sólo los objetos de cursor y conexión en bruto.

source: Here is how you can use it::
es_la: Así es como se puede utilizar::

source: Or if you just want a single result::
es_la: O si sólo quieres un único resultado::

source: To pass variable parts to the SQL statement, use a question mark in the statement and pass in the arguments as a list. Never directly add them to the SQL statement with string formatting because this makes it possible to attack the application using `SQL Injections <https://en.wikipedia.org/wiki/SQL_injection>`_.
es_la: Para pasar partes de variables a la sentencia SQL, utilice un signo de interrogación en la sentencia y pase los argumentos como una lista. Nunca los añada directamente a la sentencia SQL con formato de cadena porque esto hace posible atacar la aplicación usando `Inyecciones SQL <https://en.wikipedia.org/wiki/SQL_injection>`_.

source: Initial Schemas
es_la: Esquemas iniciales

source: Relational databases need schemas, so applications often ship a `schema.sql` file that creates the database. It's a good idea to provide a function that creates the database based on that schema. This function can do that for you::
es_la: Las bases de datos relacionales necesitan esquemas, por lo que las aplicaciones suelen enviar un archivo `schema.sql` que crea la base de datos. Es una buena idea proporcionar una función que cree la base de datos basada en ese esquema. Esta función puede hacerlo por ti::

source: You can then create such a database from the Python shell:
es_la: A continuación, puede crear dicha base de datos desde el shell de Python:

source: Streaming Contents
es_la: Contenidos en streaming

source: Sometimes you want to send an enormous amount of data to the client, much more than you want to keep in memory. When you are generating the data on the fly though, how do you send that back to the client without the roundtrip to the filesystem?
es_la: A veces quieres enviar una enorme cantidad de datos al cliente, mucho más de lo que quieres mantener en la memoria. Sin embargo, cuando estás generando los datos sobre la marcha, ¿Cómo los envías de vuelta al cliente sin el viaje de ida y vuelta al sistema de archivos?

source: The answer is by using generators and direct responses.
es_la: La respuesta es utilizar generadores y respuestas directas.

source: Basic Usage
es_la: Uso básico

source: This is a basic view function that generates a lot of CSV data on the fly. The trick is to have an inner function that uses a generator to generate data and to then invoke that function and pass it to a response object::
es_la: Esta es una función de vista básica que genera un montón de datos CSV sobre la marcha. El truco es tener una función interna que utilice un generador para generar los datos y luego invocar esa función y pasarla a un objeto de respuesta::

source: Each ``yield`` expression is directly sent to the browser. Note though that some WSGI middlewares might break streaming, so be careful there in debug environments with profilers and other things you might have enabled.
es_la: Cada expresión ``yield`` se envía directamente al navegador. Sin embargo, ten en cuenta que algunos middlewares WSGI pueden romper el streaming, así que ten cuidado en entornos de depuración con perfiladores y otras cosas que puedas tener activadas.

source: Streaming from Templates
es_la: Streaming desde plantillas

source: The Jinja2 template engine also supports rendering templates piece by piece. This functionality is not directly exposed by Flask because it is quite uncommon, but you can easily do it yourself::
es_la: El motor de plantillas de Jinja2 también soporta el renderizado de plantillas pieza a pieza. Esta funcionalidad no está expuesta directamente por Flask porque es bastante infrecuente, pero puedes hacerlo fácilmente tú mismo::

source: The trick here is to get the template object from the Jinja2 environment on the application and to call :meth:`~jinja2.Template.stream` instead of :meth:`~jinja2.Template.render` which returns a stream object instead of a string. Since we're bypassing the Flask template render functions and using the template object itself we have to make sure to update the render context ourselves by calling :meth:`~flask.Flask.update_template_context`. The template is then evaluated as the stream is iterated over. Since each time you do a yield the server will flush the content to the client you might want to buffer up a few items in the template which you can do with ``rv.enable_buffering(size)``. ``5`` is a sane default.
es_la: El truco aquí es obtener el objeto plantilla del entorno Jinja2 en la aplicación y llamar a :meth:`~jinja2.Template.stream` en lugar de :meth:`~jinja2.Template.render` que devuelve un objeto stream en lugar de una cadena. Dado que estamos obviando las funciones de renderizado de plantillas de Flask y utilizando el propio objeto plantilla, tenemos que asegurarnos de actualizar el contexto de renderizado nosotros mismos llamando a :meth:`~flask.Flask.update_template_context`.

source: Streaming with Context
es_la: Streaming con Contexto

source: Note that when you stream data, the request context is already gone the moment the function executes. Flask 0.9 provides you with a helper that can keep the request context around during the execution of the generator::
es_la: Ten en cuenta que cuando transmites datos, el contexto de la petición ya ha desaparecido en el momento en que se ejecuta la función. Flask 0.9 le proporciona un ayudante que puede mantener el contexto de la solicitud durante la ejecución del generador::

source: Without the :func:`~flask.stream_with_context` function you would get a :class:`RuntimeError` at that point.
es_la: Sin la función :func:`~flask.stream_with_context` obtendrías un :class:`RuntimeError` en ese punto.

source: Subclassing Flask
es_la: Subclases en Flask

source: The :class:`~flask.Flask` class is designed for subclassing.
es_la: La clase :class:`~flask.Flask` está diseñada para subclases.

source: For example, you may want to override how request parameters are handled to preserve their order::
es_la: Por ejemplo, puede querer anular la forma en que se manejan los parámetros de la solicitud para preservar su orden::

source: This is the recommended approach for overriding or augmenting Flask's internal functionality.
es_la: Este es el enfoque recomendado para anular o aumentar la funcionalidad interna de Flask.

source: Template Inheritance
es_la: Herencia de plantillas

source: The most powerful part of Jinja is template inheritance. Template inheritance allows you to build a base "skeleton" template that contains all the common elements of your site and defines **blocks** that child templates can override.
es_la: La parte más poderosa de Jinja es la herencia de plantillas. La herencia de plantillas te permite construir una plantilla base "esqueleto" que contiene todos los elementos comunes de tu sitio y define **bloques** que las plantillas hijas pueden sobrescribir.

source: Sounds complicated but is very basic. It's easiest to understand it by starting with an example.
es_la: Suena complicado pero es muy básico. Lo más fácil es entenderlo empezando con un ejemplo.

source: Base Template
es_la: Plantilla base

source: This template, which we'll call :file:`layout.html`, defines a simple HTML skeleton document that you might use for a simple two-column page. It's the job of "child" templates to fill the empty blocks with content:
es_la: Esta plantilla, a la que llamaremos :file:`layout.html`, define un simple documento esqueleto de HTML que podría utilizar para una simple página de dos columnas. El trabajo de las plantillas "hijas" es llenar los bloques vacíos con contenido:

source: In this example, the ``{% block %}`` tags define four blocks that child templates can fill in. All the `block` tag does is tell the template engine that a child template may override those portions of the template.
es_la: En este ejemplo, las etiquetas ``{% block %}`` definen cuatro bloques que las plantillas hijas pueden rellenar. Todo lo que hace la etiqueta `block` es indicar al motor de la plantilla que una plantilla hija puede anular esas partes de la plantilla.

source: Child Template
es_la: Plantilla hija

source: A child template might look like this:
es_la: Una plantilla hija podría tener el siguiente aspecto:

source: The ``{% extends %}`` tag is the key here. It tells the template engine that this template "extends" another template. When the template system evaluates this template, first it locates the parent. The extends tag must be the first tag in the template. To render the contents of a block defined in the parent template, use ``{{ super() }}``.
es_la: La etiqueta ``{% extends %}`` es la clave aquí. Indica al motor de plantillas que esta plantilla "extiende" otra plantilla. Cuando el sistema de plantillas evalúa esta plantilla, primero localiza el padre. La etiqueta extends debe ser la primera etiqueta de la plantilla. Para mostrar el contenido de un bloque definido en la plantilla principal, utilice ``{{ super() }}``.

source: Using URL Processors
es_la: Uso de procesadores de URL

source: Flask 0.7 introduces the concept of URL processors. The idea is that you might have a bunch of resources with common parts in the URL that you don't always explicitly want to provide. For instance you might have a bunch of URLs that have the language code in it but you don't want to have to handle it in every single function yourself.
es_la: Flask 0.7 introduce el concepto de procesadores de URL. La idea es que puedes tener un montón de recursos con partes comunes en la URL que no siempre quieres proporcionar explícitamente. Por ejemplo, puedes tener un montón de URLs que tienen el código del lenguaje en él, pero no quieres tener que manejarlo tú mismo en cada función.

source: URL processors are especially helpful when combined with blueprints. We will handle both application specific URL processors here as well as blueprint specifics.
es_la: Los procesadores de URL son especialmente útiles cuando se combinan con blueprints. Aquí trataremos tanto los procesadores de URL específicos de la aplicación como los específicos de los planos.

source: Internationalized Application URLs
es_la: URLs de aplicaciones internacionalizadas

source: Consider an application like this::
es_la: Considere una aplicación como esta::

source: This is an awful lot of repetition as you have to handle the language code setting on the :data:`~flask.g` object yourself in every single function. Sure, a decorator could be used to simplify this, but if you want to generate URLs from one function to another you would have to still provide the language code explicitly which can be annoying.
es_la: Esto es un montón de repeticiones, ya que tienes que manejar la configuración del código de idioma en el objeto :data:`~flask.g` tú mismo en cada función. Por supuesto, se podría utilizar un decorador para simplificar esto, pero si quieres generar URLs de una función a otra tendrías que seguir proporcionando el código de idioma explícitamente, lo que puede ser molesto.
