Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/patterns.po
Languages: es_la

source: For the latter, this is where :func:`~flask.Flask.url_defaults` functions come in. They can automatically inject values into a call to :func:`~flask.url_for`. The code below checks if the language code is not yet in the dictionary of URL values and if the endpoint wants a value named ``'lang_code'``::
es_la: Para esto último, es donde entran las funciones :func:`~flask.Flask.url_defaults`. Pueden inyectar automáticamente valores en una llamada a :func:`~flask.url_for`. El código siguiente comprueba si el código de idioma no está todavía en el diccionario de valores de URL y si el endpoint quiere un valor llamado ``'lang_code``::

source: The method :meth:`~werkzeug.routing.Map.is_endpoint_expecting` of the URL map can be used to figure out if it would make sense to provide a language code for the given endpoint.
es_la: El método :meth:`~werkzeug.routing.Map.is_endpoint_expecting` del mapa URL puede utilizarse para averiguar si tiene sentido proporcionar un código de idioma para el punto final dado.

source: The reverse of that function are :meth:`~flask.Flask.url_value_preprocessor`\s. They are executed right after the request was matched and can execute code based on the URL values. The idea is that they pull information out of the values dictionary and put it somewhere else::
es_la: El reverso de esa función son los :meth:`~flask.Flask.url_value_preprocessor`. Se ejecutan justo después de que la solicitud haya sido emparejada y pueden ejecutar código basado en los valores de la URL. La idea es que saquen información del diccionario de valores y la pongan en otro lugar::

source: That way you no longer have to do the `lang_code` assignment to :data:`~flask.g` in every function. You can further improve that by writing your own decorator that prefixes URLs with the language code, but the more beautiful solution is using a blueprint. Once the ``'lang_code'`` is popped from the values dictionary and it will no longer be forwarded to the view function reducing the code to this::
es_la: De esta manera ya no tienes que hacer la asignación de `lang_code` a :data:`~flask.g` en cada función. Puedes mejorar esto escribiendo tu propio decorador que anteponga a las URLs el código de idioma, pero la solución más bonita es usar un blueprint. Una vez que el ``'lang_code'`` es sacado del diccionario de valores y ya no será reenviado a la función de la vista reduciendo el código a esto::

source: Internationalized Blueprint URLs
es_la: URLs de Blueprint internacionalizadas

source: Because blueprints can automatically prefix all URLs with a common string it's easy to automatically do that for every function. Furthermore blueprints can have per-blueprint URL processors which removes a whole lot of logic from the :meth:`~flask.Flask.url_defaults` function because it no longer has to check if the URL is really interested in a ``'lang_code'`` parameter::
es_la: Debido a que los blueprints pueden anteponer automáticamente todas las URLs con una cadena común, es fácil hacerlo automáticamente para cada función. Además, los blueprints pueden tener procesadores de URL por blueprint, lo que elimina un montón de lógica de la función :meth:`~flask.Flask.url_defaults` porque ya no tiene que comprobar si la URL está realmente interesada en un parámetro ``'lang_code'``::

source: View Decorators
es_la: Ver decoradores

source: Python has a really interesting feature called function decorators. This allows some really neat things for web applications. Because each view in Flask is a function, decorators can be used to inject additional functionality to one or more functions. The :meth:`~flask.Flask.route` decorator is the one you probably used already. But there are use cases for implementing your own decorator. For instance, imagine you have a view that should only be used by people that are logged in. If a user goes to the site and is not logged in, they should be redirected to the login page. This is a good example of a use case where a decorator is an excellent solution.
es_la: Python tiene una característica muy interesante llamada decoradores de funciones. Esto permite algunas cosas realmente asombrosas para las aplicaciones web. Dado que cada vista en Flask es una función, los decoradores se pueden utilizar para inyectar funcionalidad adicional a una o más funciones. El decorador :meth:`~flask.Flask.route` es el que probablemente ya hayas utilizado.

source: Login Required Decorator
es_la: Decorador de inicio de sesión requerido

source: So let's implement such a decorator. A decorator is a function that wraps and replaces another function. Since the original function is replaced, you need to remember to copy the original function's information to the new function. Use :func:`functools.wraps` to handle this for you.
es_la: Así que vamos a implementar tal decorador. Un decorador es una función que envuelve y reemplaza a otra función. Como la función original es reemplazada, necesitas recordar copiar la información de la función original a la nueva función. Usa :func:`functools.wraps` para manejar esto por ti.

source: This example assumes that the login page is called ``'login'`` and that the current user is stored in ``g.user`` and is ``None`` if there is no-one logged in. ::
es_la: Este ejemplo asume que la página de inicio de sesión se llama ``inicio de sesión`` y que el usuario actual se almacena en ``g.user`` y es ``None`` si no hay nadie conectado. ::

source: To use the decorator, apply it as innermost decorator to a view function. When applying further decorators, always remember that the :meth:`~flask.Flask.route` decorator is the outermost. ::
es_la: Para utilizar el decorador, aplíquelo como decorador más interno a una función de la vista. Al aplicar otros decoradores, recuerde siempre que el decorador :meth:`~flask.Flask.route` es el más externo. ::

source: The ``next`` value will exist in ``request.args`` after a ``GET`` request for the login page. You'll have to pass it along when sending the ``POST`` request from the login form. You can do this with a hidden input tag, then retrieve it from ``request.form`` when logging the user in. ::
es_la: El valor ``next`` existirá en ``request.args`` después de una petición ``GET`` para la página de acceso. Tendrás que pasarlo cuando envíes la petición ``POST`` desde el formulario de acceso. Puedes hacer esto con una etiqueta de entrada oculta, y luego recuperarla de ``request.form`` cuando el usuario se registre. ::

source: Caching Decorator
es_la: Decoradores y caché

source: Imagine you have a view function that does an expensive calculation and because of that you would like to cache the generated results for a certain amount of time. A decorator would be nice for that. We're assuming you have set up a cache like mentioned in :doc:`caching`.
es_la: Imagina que tienes una función de la vista que realiza un cálculo costoso y por ello te gustaría almacenar en caché los resultados generados durante un tiempo determinado. Un decorador estaría bien para eso. Suponemos que has configurado una caché como la mencionada en :doc:`caching`.

source: Here is an example cache function. It generates the cache key from a specific prefix (actually a format string) and the current path of the request. Notice that we are using a function that first creates the decorator that then decorates the function. Sounds awful? Unfortunately it is a little bit more complex, but the code should still be straightforward to read.
es_la: He aquí un ejemplo de función de caché. Genera la clave de la caché a partir de un prefijo específico (en realidad una cadena de formato) y la ruta actual de la solicitud. Fíjate que estamos usando una función que primero crea el decorador que luego decora la función. ¿Suena horrible? Desgraciadamente es un poco más complejo, pero el código debería seguir siendo sencillo de leer.

source: The decorated function will then work as follows
es_la: La función decorada funcionará entonces de la siguiente manera

source: get the unique cache key for the current request based on the current path.
es_la: obtener la clave de caché única para la solicitud actual basada en la ruta actual.

source: get the value for that key from the cache. If the cache returned something we will return that value.
es_la: obtenga el valor de esa clave de la caché. Si la caché devolvió algo, devolveremos ese valor.

source: otherwise the original function is called and the return value is stored in the cache for the timeout provided (by default 5 minutes).
es_la: en caso contrario, se llama a la función original y el valor devuelto se almacena en la caché durante el tiempo de espera previsto (por defecto, 5 minutos).

source: Here the code::
es_la: Aquí el código::

source: Notice that this assumes an instantiated ``cache`` object is available, see :doc:`caching`.
es_la: Tenga en cuenta que esto asume que un objeto ``cache`` instanciado está disponible, ver :doc:`caching`.

source: Templating Decorator
es_la: Decorador de plantillas

source: A common pattern invented by the TurboGears guys a while back is a templating decorator. The idea of that decorator is that you return a dictionary with the values passed to the template from the view function and the template is automatically rendered. With that, the following three examples do exactly the same::
es_la: Un patrón común inventado por los chicos de TurboGears hace un tiempo es un decorador de plantillas. La idea de ese decorador es que devuelve un diccionario con los valores pasados a la plantilla desde la función de vista y la plantilla se renderiza automáticamente. Con eso, los siguientes tres ejemplos hacen exactamente lo mismo::

source: As you can see, if no template name is provided it will use the endpoint of the URL map with dots converted to slashes + ``'.html'``. Otherwise the provided template name is used. When the decorated function returns, the dictionary returned is passed to the template rendering function. If ``None`` is returned, an empty dictionary is assumed, if something else than a dictionary is returned we return it from the function unchanged. That way you can still use the redirect function or return simple strings.
es_la: Como puede ver, si no se proporciona un nombre de plantilla se utilizará el punto final del mapa de la URL con los puntos convertidos en barras inclinadas + ``'.html'``. En caso contrario, se utilizará el nombre de la plantilla proporcionada. Cuando la función decorada devuelve, el diccionario devuelto se pasa a la función de renderización de la plantilla. Si se devuelve ``None``, se asume un diccionario vacío, si se devuelve algo más que un diccionario lo devolvemos desde la función sin cambios. De este modo, se puede seguir utilizando la función de redirección o devolver cadenas simples.

source: Here is the code for that decorator::
es_la: Aquí está el código para ese decorador::

source: Endpoint Decorator
es_la: Decorador endpoint

source: When you want to use the werkzeug routing system for more flexibility you need to map the endpoint as defined in the :class:`~werkzeug.routing.Rule` to a view function. This is possible with this decorator. For example::
es_la: Cuando quieras utilizar el sistema de enrutamiento de werkzeug para tener más flexibilidad, necesitas mapear el endpoint definido en la :class:`~werkzeug.routing.Rule` a una función de la vista. Esto es posible con este decorador. Por ejemplo::

source: Form Validation with WTForms
es_la: Validación de formularios con WTForms

source: When you have to work with form data submitted by a browser view, code quickly becomes very hard to read. There are libraries out there designed to make this process easier to manage. One of them is `WTForms`_ which we will handle here. If you find yourself in the situation of having many forms, you might want to give it a try.
es_la: Cuando tienes que trabajar con datos de formularios enviados por una vista del navegador, el código se vuelve rápidamente muy difícil de leer. Existen librerías diseñadas para hacer este proceso más fácil de manejar. Una de ellas es `WTForms`_ que manejaremos aquí. Si te encuentras en la situación de tener muchos formularios, quizás quieras probarla.

source: When you are working with WTForms you have to define your forms as classes first. I recommend breaking up the application into multiple modules (:doc:`packages`) for that and adding a separate module for the forms.
es_la: Cuando se trabaja con WTForms hay que definir primero los formularios como clases. Recomiendo dividir la aplicación en múltiples módulos (:doc:`packages`) para ello y añadir un módulo separado para los formularios.

source: Getting the most out of WTForms with an Extension
es_la: Sacar el máximo partido a WTForms con una extensión

source: The `Flask-WTF`_ extension expands on this pattern and adds a few little helpers that make working with forms and Flask more fun. You can get it from `PyPI <https://pypi.org/project/Flask-WTF/>`_.
es_la: La extensión `Flask-WTF`_ amplía este patrón y añade algunos pequeños ayudantes que hacen que trabajar con formularios y Flask sea más divertido. Puedes conseguirla en `PyPI <https://pypi.org/project/Flask-WTF/>`_.

source: The Forms
es_la: Los formularios

source: This is an example form for a typical registration page::
es_la: Este es un ejemplo de formulario para una página de registro típica::

source: In the View
es_la: En la vista

source: In the view function, the usage of this form looks like this::
es_la: En la función de la vista, el uso de esta forma se ve así::

source: Notice we're implying that the view is using SQLAlchemy here (:doc:`sqlalchemy`), but that's not a requirement, of course. Adapt the code as necessary.
es_la: Fíjate que aquí estamos implicando que la vista está usando SQLAlchemy (:doc:`sqlalchemy`), pero eso no es un requisito, por supuesto. Adapta el código como sea necesario.

source: Things to remember:
es_la: Cosas para recordar:

source: create the form from the request :attr:`~flask.request.form` value if the data is submitted via the HTTP ``POST`` method and :attr:`~flask.request.args` if the data is submitted as ``GET``.
es_la: crear el formulario a partir del valor de la solicitud :attr:`~flask.request.form` si los datos se envían a través del método HTTP ``POST`` y :attr:`~flask.request.args` si los datos se envían como ``GET``.

source: to validate the data, call the :func:`~wtforms.form.Form.validate` method, which will return ``True`` if the data validates, ``False`` otherwise.
es_la: para validar los datos, llama al método :func:`~wtforms.form.Form.validate`, que devolverá ``True`` si los datos se validan, ``False`` en caso contrario.

source: to access individual values from the form, access `form.<NAME>.data`.
es_la: para acceder a valores individuales del formulario, accede a `form.<NAME>.data`.

source: Forms in Templates
es_la: Formularios en plantillas

source: Now to the template side. When you pass the form to the templates, you can easily render them there. Look at the following example template to see how easy this is. WTForms does half the form generation for us already. To make it even nicer, we can write a macro that renders a field with label and a list of errors if there are any.
es_la: Ahora al lado de las plantillas. Cuando pasas el formulario a las plantillas, puedes fácilmente renderizarlas allí. Mira la siguiente plantilla de ejemplo para ver lo fácil que es esto. WTForms ya hace la mitad de la generación de formularios por nosotros. Para hacerlo aún más bonito, podemos escribir una macro que renderice un campo con etiqueta y una lista de errores si los hay.

source: Here's an example :file:`_formhelpers.html` template with such a macro:
es_la: Aquí hay un ejemplo de plantilla :file:`_formhelpers.html` con dicha macro:

source: This macro accepts a couple of keyword arguments that are forwarded to WTForm's field function, which renders the field for us. The keyword arguments will be inserted as HTML attributes. So, for example, you can call ``render_field(form.username, class='username')`` to add a class to the input element. Note that WTForms returns standard Python strings, so we have to tell Jinja2 that this data is already HTML-escaped with the ``|safe`` filter.
es_la: Esta macro acepta un par de argumentos de palabras clave que se envían a la función de campo de WTForm, que renderiza el campo por nosotros. Los argumentos de la palabra clave serán insertados como atributos HTML. Así, por ejemplo, puedes llamar a ``render_field(form.username, class='username')`` para añadir una clase al elemento de entrada. Ten en cuenta que WTForms devuelve cadenas estándar de Python, por lo que tenemos que decirle a Jinja2 que estos datos ya están escaneados en HTML con el filtro ``|safe``.

source: Here is the :file:`register.html` template for the function we used above, which takes advantage of the :file:`_formhelpers.html` template:
es_la: Aquí está la plantilla :file:`register.html` para la función que usamos arriba, que aprovecha la plantilla :file:`_formhelpers.html`:

source: For more information about WTForms, head over to the `WTForms website`_.
es_la: Para obtener más información sobre WTForms, visite el sitio web de `WTForms`_.
