Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/tutorial.po
Languages: es

source: Copy this file to another machine, :ref:`set up a new virtualenv <install-create-env>`, then install the file with ``pip``.
es: Copie este archivo a otra máquina, :ref:`configure un nuevo virtualenv <install-create-env>`, luego instale el archivo con ``pip``.

source: Pip will install your project along with its dependencies.
es: Pip instalará su proyecto junto con sus dependencias.

source: Since this is a different machine, you need to run ``init-db`` again to create the database in the instance folder.
es: Como se trata de una máquina diferente, es necesario ejecutar ``init-db`` de nuevo para crear la base de datos en la carpeta de la instancia.

source: When Flask detects that it's installed (not in editable mode), it uses a different directory for the instance folder. You can find it at ``venv/var/flaskr-instance`` instead.
es: Cuando Flask detecta que está instalado (no en modo editable), utiliza un directorio diferente para la carpeta de la instancia. Puedes encontrarla en ``venv/var/flaskr-instance`` en su lugar.

source: Configure the Secret Key
es: Configurar la clave secreta

source: In the beginning of the tutorial that you gave a default value for :data:`SECRET_KEY`. This should be changed to some random bytes in production. Otherwise, attackers could use the public ``'dev'`` key to modify the session cookie, or anything else that uses the secret key.
es: Al principio del tutorial que dio un valor por defecto para :data:`SECRET_KEY`. Esto debería ser cambiado por algunos bytes aleatorios en producción. De lo contrario, los atacantes podrían utilizar la clave pública ``'dev'`` para modificar la cookie de sesión, o cualquier otra cosa que utilice la clave secreta.

source: You can use the following command to output a random secret key:
es: Puede utilizar el siguiente comando para obtener una clave secreta aleatoria:

source: Create the ``config.py`` file in the instance folder, which the factory will read from if it exists. Copy the generated value into it.
es: Crea el archivo ``config.py`` en la carpeta de la instancia, que la fábrica leerá si existe. Copie el valor generado en él.

source: You can also set any other necessary configuration here, although ``SECRET_KEY`` is the only one needed for Flaskr.
es: También puedes establecer aquí cualquier otra configuración necesaria, aunque ``SECRET_KEY`` es la única necesaria para Flaskr.

source: Run with a Production Server
es: Ejecutar con un servidor de producción

source: When running publicly rather than in development, you should not use the built-in development server (``flask run``). The development server is provided by Werkzeug for convenience, but is not designed to be particularly efficient, stable, or secure.
es: Cuando se ejecuta públicamente y no en desarrollo, no se debe utilizar el servidor de desarrollo incorporado (``flask run``). El servidor de desarrollo es proporcionado por Werkzeug por conveniencia, pero no está diseñado para ser particularmente eficiente, estable o seguro.

source: Instead, use a production WSGI server. For example, to use `Waitress`_, first install it in the virtual environment:
es: En su lugar, utilice un servidor WSGI de producción. Por ejemplo, para usar `Waitress`_, primero instálalo en el entorno virtual:

source: You need to tell Waitress about your application, but it doesn't use ``FLASK_APP`` like ``flask run`` does. You need to tell it to import and call the application factory to get an application object.
es: Necesitas decirle a Waitress sobre tu aplicación, pero no usa ``FLASK_APP`` como lo hace ``flask run``. Tienes que decirle que importe y llame a la fábrica de aplicaciones para obtener un objeto de aplicación.

source: See :doc:`/deploying/index` for a list of many different ways to host your application. Waitress is just an example, chosen for the tutorial because it supports both Windows and Linux. There are many more WSGI servers and deployment options that you may choose for your project.
es: Consulte :doc:`/deploying/index` para ver una lista de las diferentes formas de alojar su aplicación. Waitress es sólo un ejemplo, elegido para el tutorial porque soporta tanto Windows como Linux. Hay muchos más servidores WSGI y opciones de despliegue que puedes elegir para tu proyecto.

source: Continue to :doc:`next`.
es: Continuar con :doc:`next`.

source: Application Setup
es: Configuración de la aplicación

source: A Flask application is an instance of the :class:`Flask` class. Everything about the application, such as configuration and URLs, will be registered with this class.
es: Una aplicación Flask es una instancia de la clase :class:`Flask`. Todo lo relacionado con la aplicación, como la configuración y las URL, se registrará en esta clase.

source: The most straightforward way to create a Flask application is to create a global :class:`Flask` instance directly at the top of your code, like how the "Hello, World!" example did on the previous page. While this is simple and useful in some cases, it can cause some tricky issues as the project grows.
es: La forma más sencilla de crear una aplicación Flask es crear una instancia global :class:`Flask` directamente en la parte superior de su código, como lo hizo el ejemplo "¡Hola, mundo!" en la página anterior. Aunque esto es simple y útil en algunos casos, puede causar algunos problemas complicados cuando el proyecto crece.

source: Instead of creating a :class:`Flask` instance globally, you will create it inside a function. This function is known as the *application factory*. Any configuration, registration, and other setup the application needs will happen inside the function, then the application will be returned.
es: En lugar de crear una instancia de :class:`Flask` globalmente, la crearás dentro de una función. Esta función se conoce como la *fábrica de aplicaciones*. Cualquier configuración, registro, y otros ajustes que la aplicación necesite ocurrirán dentro de la función, entonces la aplicación será devuelta.

source: The Application Factory
es: La fábrica de aplicaciones

source: It's time to start coding! Create the ``flaskr`` directory and add the ``__init__.py`` file. The ``__init__.py`` serves double duty: it will contain the application factory, and it tells Python that the ``flaskr`` directory should be treated as a package.
es: ¡Es hora de empezar a codificar! Crea el directorio ``flaskr`` y añade el archivo ``init__.py``. El archivo ``__init__.py`` tiene una doble función: Contendrá la fábrica de la aplicación, y le dice a Python que el directorio ``flaskr`` debe ser tratado como un paquete.

source: ``create_app`` is the application factory function. You'll add to it later in the tutorial, but it already does a lot.
es: ``create_app`` es la función de fábrica de la aplicación. La añadirás más adelante en el tutorial, pero ya hace mucho.

source: ``app = Flask(__name__, instance_relative_config=True)`` creates the :class:`Flask` instance.
es: ``app = Flask(__name__, instance_relative_config=True)`` crea la instancia :class:`Flask`.

source: ``__name__`` is the name of the current Python module. The app needs to know where it's located to set up some paths, and ``__name__`` is a convenient way to tell it that.
es: ``__name__`` es el nombre del módulo actual de Python. La aplicación necesita saber dónde se encuentra para establecer algunas rutas, y ``__name__`` es una forma conveniente de decírselo.

source: ``instance_relative_config=True`` tells the app that configuration files are relative to the :ref:`instance folder <instance-folders>`. The instance folder is located outside the ``flaskr`` package and can hold local data that shouldn't be committed to version control, such as configuration secrets and the database file.
es: ``instance_relative_config=True`` indica a la aplicación que los archivos de configuración son relativos a la carpeta :ref:`instance <instance-folders>`. La carpeta de instancia se encuentra fuera del paquete ``flaskr`` y puede contener datos locales que no deben ser enviados al control de versiones, como los secretos de configuración y el archivo de base de datos.

source: :meth:`app.config.from_mapping() <Config.from_mapping>` sets some default configuration that the app will use:
es: :meth:`app.config.from_mapping() <Config.from_mapping>` establece alguna configuración por defecto que la aplicación utilizará:

source: :data:`SECRET_KEY` is used by Flask and extensions to keep data safe. It's set to ``'dev'`` to provide a convenient value during development, but it should be overridden with a random value when deploying.
es: :data:`SECRET_KEY` es utilizada por Flask y las extensiones para mantener los datos seguros. Se establece en ``'dev'`` para proporcionar un valor conveniente durante el desarrollo, pero debe ser anulado con un valor aleatorio al liberar tu aplicación.

source: ``DATABASE`` is the path where the SQLite database file will be saved. It's under :attr:`app.instance_path <Flask.instance_path>`, which is the path that Flask has chosen for the instance folder. You'll learn more about the database in the next section.
es: ``DATABASE`` es la ruta donde se guardará el archivo de la base de datos SQLite. Está bajo :attr:`app.instance_path <Flask.instance_path>`, que es la ruta que Flask ha elegido para la carpeta de la instancia. Aprenderás más sobre la base de datos en la siguiente sección.

source: :meth:`app.config.from_pyfile() <Config.from_pyfile>` overrides the default configuration with values taken from the ``config.py`` file in the instance folder if it exists. For example, when deploying, this can be used to set a real ``SECRET_KEY``.
es: :meth:`app.config.from_pyfile() <Config.from_pyfile>` anula la configuración por defecto con valores tomados del archivo ``config.py`` en la carpeta de la instancia si existe. Por ejemplo, al desplegar, esto puede usarse para establecer una ``SECRET_KEY`` real.

source: ``test_config`` can also be passed to the factory, and will be used instead of the instance configuration. This is so the tests you'll write later in the tutorial can be configured independently of any development values you have configured.
es: ``test_config`` también se puede pasar a la fábrica, y se utilizará en lugar de la configuración de la instancia. Esto es para que las pruebas que escribirás más adelante en el tutorial puedan ser configuradas independientemente de cualquier valor de desarrollo que hayas configurado.

source: :func:`os.makedirs` ensures that :attr:`app.instance_path <Flask.instance_path>` exists. Flask doesn't create the instance folder automatically, but it needs to be created because your project will create the SQLite database file there.
es: :func:`os.makedirs` asegura que :attr:`app.instance_path <Flask.instance_path>` existe. Flask no crea la carpeta de instancia automáticamente, pero es necesario crearla porque tu proyecto creará el archivo de base de datos SQLite allí.

source: :meth:`@app.route() <Flask.route>` creates a simple route so you can see the application working before getting into the rest of the tutorial. It creates a connection between the URL ``/hello`` and a function that returns a response, the string ``'Hello, World!'`` in this case.
es: :meth:`@app.route() <Flask.route>` crea una ruta simple para que puedas ver la aplicación funcionando antes de entrar en el resto del tutorial. Crea una conexión entre la URL ``/hello`` y una función que devuelve una respuesta, la cadena ``Hola, mundo`` en este caso.

source: Run The Application
es: Ejecutar la aplicación

source: Now you can run your application using the ``flask`` command. From the terminal, tell Flask where to find your application, then run it in development mode. Remember, you should still be in the top-level ``flask-tutorial`` directory, not the ``flaskr`` package.
es: Ahora puedes ejecutar tu aplicación usando el comando ``flask``. Desde el terminal, dile a Flask dónde encontrar tu aplicación, y ejecútala en modo de desarrollo. Recuerda que debes estar en el directorio de nivel superior ``flask-tutorial``, no en el paquete ``flaskr``.

source: Development mode shows an interactive debugger whenever a page raises an exception, and restarts the server whenever you make changes to the code. You can leave it running and just reload the browser page as you follow the tutorial.
es: El modo de desarrollo muestra un depurador interactivo cada vez que una página lanza una excepción, y reinicia el servidor cada vez que haces cambios en el código. Puedes dejarlo funcionando y simplemente recargar la página del navegador mientras sigues el tutorial.

source: You'll see output similar to this:
es: Verás un resultado similar a este:

source: Visit http://127.0.0.1:5000/hello in a browser and you should see the "Hello, World!" message. Congratulations, you're now running your Flask web application!
es: Visita http://127.0.0.1:5000/hello en un navegador y deberías ver el mensaje "¡Hola, mundo!". Enhorabuena, ¡ya estás ejecutando tu aplicación web Flask!

source: Continue to :doc:`database`.
es: Continuar con :doc:`database`.

source: Contents:
es: Contenido:

source: This tutorial will walk you through creating a basic blog application called Flaskr. Users will be able to register, log in, create posts, and edit or delete their own posts. You will be able to package and install the application on other computers.
es: Este tutorial le guiará a través de la creación de una aplicación básica de blog llamada Flaskr. Los usuarios podrán registrarse, iniciar sesión, crear mensajes y editar o eliminar sus propios mensajes. Podrás empaquetar e instalar la aplicación en otros ordenadores.

source: screenshot of index page
es: captura de pantalla de la página de índice

source: It's assumed that you're already familiar with Python. The `official tutorial`_ in the Python docs is a great way to learn or review first.
es: Se asume que ya estás familiarizado con Python. El `tutorial oficial`_ en los documentos de Python es una buena manera de aprender o repasar primero.

source: While it's designed to give a good starting point, the tutorial doesn't cover all of Flask's features. Check out the :doc:`/quickstart` for an overview of what Flask can do, then dive into the docs to find out more. The tutorial only uses what's provided by Flask and Python. In another project, you might decide to use :doc:`/extensions` or other libraries to make some tasks simpler.
es: Aunque está diseñado para dar un buen punto de partida, el tutorial no cubre todas las características de Flask. Echa un vistazo al :doc:`/quickstart` para obtener una visión general de lo que Flask puede hacer, y luego bucea en los documentos para obtener más información. El tutorial sólo utiliza lo que proporcionan Flask y Python. En otro proyecto, podrías decidir usar :doc:`/extensions` u otras bibliotecas para hacer algunas tareas más simples.

source: screenshot of login page
es: captura de pantalla de la página de inicio de sesión

source: Flask is flexible. It doesn't require you to use any particular project or code layout. However, when first starting, it's helpful to use a more structured approach. This means that the tutorial will require a bit of boilerplate up front, but it's done to avoid many common pitfalls that new developers encounter, and it creates a project that's easy to expand on. Once you become more comfortable with Flask, you can step out of this structure and take full advantage of Flask's flexibility.
es: Flask es flexible. No requiere que uses ningún proyecto o diseño de código en particular. Sin embargo, cuando se empieza, es útil utilizar un enfoque más estructurado. Esto significa que el tutorial requerirá un poco de placa repetitiva al principio, pero se hace para evitar muchas trampas comunes que los nuevos desarrolladores encuentran, y crea un proyecto que es fácil de ampliar. Una vez que te sientas más cómodo con Flask, podrás salir de esta estructura y aprovechar al máximo la flexibilidad de Flask.

source: screenshot of edit page
es: captura de pantalla de la página de inicio de sesión

source: :gh:`The tutorial project is available as an example in the Flask repository <examples/tutorial>`, if you want to compare your project with the final product as you follow the tutorial.
es: :gh:`El proyecto del tutorial está disponible como ejemplo en el repositorio de Flask <examples/tutorial>`, si quieres comparar tu proyecto con el producto final mientras sigues el tutorial.

source: Continue to :doc:`layout`.
es: Continúe con :doc:`layout`.

source: Make the Project Installable
es: Hacer que el proyecto sea instalable

source: Making your project installable means that you can build a *distribution* file and install that in another environment, just like you installed Flask in your project's environment. This makes deploying your project the same as installing any other library, so you're using all the standard Python tools to manage everything.
es: Hacer que tu proyecto sea instalable significa que puedes construir un archivo de *distribución* e instalarlo en otro entorno, al igual que has instalado Flask en el entorno de tu proyecto. Esto hace que el despliegue de su proyecto sea igual que la instalación de cualquier otra biblioteca, por lo que está utilizando todas las herramientas estándar de Python para gestionar todo.

source: Installing also comes with other benefits that might not be obvious from the tutorial or as a new Python user, including:
es: La instalación también viene con otros beneficios que podrían no ser obvios desde el tutorial o como un nuevo usuario de Python, incluyendo:

source: Currently, Python and Flask understand how to use the ``flaskr`` package only because you're running from your project's directory. Installing means you can import it no matter where you run from.
es: Actualmente, Python y Flask entienden cómo usar el paquete ``flaskr`` sólo porque lo ejecutas desde el directorio de tu proyecto. Instalarlo significa que puedes importarlo sin importar desde dónde lo ejecutes.

source: You can manage your project's dependencies just like other packages do, so ``pip install yourproject.whl`` installs them.
es: Puedes gestionar las dependencias de tu proyecto igual que otros paquetes, así que ``pip install tuproyecto.whl`` las instala.

source: Test tools can isolate your test environment from your development environment.
es: Las herramientas de prueba pueden aislar el entorno de prueba del entorno de desarrollo.

source: This is being introduced late in the tutorial, but in your future projects you should always start with this.
es: Esto se está introduciendo tarde en el tutorial, pero en tus futuros proyectos deberías empezar siempre con esto.

source: Describe the Project
es: Describa el proyecto

source: The ``setup.py`` file describes your project and the files that belong to it.
es: El archivo ``setup.py`` describe tu proyecto y los archivos que le pertenecen.

source: ``packages`` tells Python what package directories (and the Python files they contain) to include. ``find_packages()`` finds these directories automatically so you don't have to type them out. To include other files, such as the static and templates directories, ``include_package_data`` is set. Python needs another file named ``MANIFEST.in`` to tell what this other data is.
es: ``packages`` le dice a Python qué directorios de paquetes (y los archivos de Python que contienen) debe incluir. ``find_packages()`` encuentra estos directorios automáticamente para que no tengas que escribirlos. Para incluir otros archivos, como los directorios static y templates, se establece ``include_package_data``. Python necesita otro archivo llamado ``MANIFEST.in`` para decir cuáles son estos otros datos.

source: This tells Python to copy everything in the ``static`` and ``templates`` directories, and the ``schema.sql`` file, but to exclude all bytecode files.
es: Esto le dice a Python que copie todo en los directorios ``static`` y ``templates``, y el archivo ``schema.sql``, pero que excluya todos los archivos del tipo ``bytecode``.

source: See the `official packaging guide`_ for another explanation of the files and options used.
es: Consulte la `guía oficial de empaquetado`_ para obtener otra explicación de los archivos y opciones utilizados.

source: Install the Project
es: Instalar el proyecto

source: Use ``pip`` to install your project in the virtual environment.
es: Utilice ``pip`` para instalar su proyecto en el entorno virtual.

source: This tells pip to find ``setup.py`` in the current directory and install it in *editable* or *development* mode. Editable mode means that as you make changes to your local code, you'll only need to re-install if you change the metadata about the project, such as its dependencies.
es: Esto le dice a pip que encuentre ``setup.py`` en el directorio actual y lo instale en modo *editable* o *desarrollo*. El modo editable significa que a medida que se realicen cambios en el código local, sólo será necesario reinstalar si se cambian los metadatos del proyecto, como sus dependencias.

source: You can observe that the project is now installed with ``pip list``.
es: Se puede observar que el proyecto se instala ahora con ``pip list``.

source: Nothing changes from how you've been running your project so far. ``FLASK_APP`` is still set to ``flaskr`` and ``flask run`` still runs the application, but you can call it from anywhere, not just the ``flask-tutorial`` directory.
es: Nada cambia de cómo has estado ejecutando tu proyecto hasta ahora. ``FLASK_APP`` sigue siendo ``flaskr`` y ``flask run`` sigue ejecutando la aplicación, pero puedes llamarla desde cualquier lugar, no sólo desde el directorio ``flask-tutorial``.

source: Continue to :doc:`tests`.
es: Continúe con :doc:`tests`.

source: Project Layout
es: Diseño del proyecto

source: Create a project directory and enter it:
es: Cree un directorio de proyecto y entre en él:

source: Then follow the :doc:`installation instructions </installation>` to set up a Python virtual environment and install Flask for your project.
es: A continuación, sigue las instrucciones de :doc:`instalación </installation>` para configurar un entorno virtual de Python e instalar Flask para tu proyecto.

source: The tutorial will assume you're working from the ``flask-tutorial`` directory from now on. The file names at the top of each code block are relative to this directory.
es: El tutorial asumirá que estás trabajando desde el directorio ``flask-tutorial`` a partir de ahora. Los nombres de los archivos en la parte superior de cada bloque de código son relativos a este directorio.

source: A Flask application can be as simple as a single file.
es: Una aplicación Flask puede ser tan simple como un solo archivo.

source: However, as a project gets bigger, it becomes overwhelming to keep all the code in one file. Python projects use *packages* to organize code into multiple modules that can be imported where needed, and the tutorial will do this as well.
es: Sin embargo, a medida que un proyecto se hace más grande, se vuelve abrumador mantener todo el código en un solo archivo. Los proyectos de Python utilizan *paquetes* para organizar el código en múltiples módulos que pueden ser importados cuando sea necesario, y el tutorial también lo hará.

source: The project directory will contain:
es: El directorio del proyecto contendrá:

source: ``flaskr/``, a Python package containing your application code and files.
es: ``flaskr/``, un paquete de Python que contiene el código y los archivos de tu aplicación.

source: ``tests/``, a directory containing test modules.
es: ``tests/``, un directorio que contiene módulos de prueba.
