Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/tutorial.po
Languages: es

source: ``venv/``, a Python virtual environment where Flask and other dependencies are installed.
es: ``venv/``, un entorno virtual de Python donde se instalan Flask y otras dependencias.

source: Installation files telling Python how to install your project.
es: Archivos de instalación que indican a Python cómo instalar tu proyecto.

source: Version control config, such as `git`_. You should make a habit of using some type of version control for all your projects, no matter the size.
es: Configuración del control de versiones, como `git`_. Deberías tener el hábito de usar algún tipo de control de versiones para todos tus proyectos, sin importar el tamaño.

source: Any other project files you might add in the future.
es: Cualquier otro archivo del proyecto que puedas añadir en el futuro.

source: By the end, your project layout will look like this:
es: Al final, el diseño de tu proyecto tendrá este aspecto:

source: If you're using version control, the following files that are generated while running your project should be ignored. There may be other files based on the editor you use. In general, ignore files that you didn't write. For example, with git:
es: Si está utilizando el control de versiones, los siguientes archivos que se generan mientras se ejecuta el proyecto deben ser ignorados. Puede haber otros archivos en función del editor que utilices. En general, ignora los archivos que no has escrito. Por ejemplo, con git:

source: Continue to :doc:`factory`.
es: Continuar con :doc:`factory`.

source: Keep Developing!
es: ¡Siga desarrollando!

source: You've learned about quite a few Flask and Python concepts throughout the tutorial. Go back and review the tutorial and compare your code with the steps you took to get there. Compare your project to the :gh:`example project <examples/tutorial>`, which might look a bit different due to the step-by-step nature of the tutorial.
es: Has aprendido bastantes conceptos de Flask y Python a lo largo del tutorial. Vuelve a repasar el tutorial y compara tu código con los pasos que has dado para llegar a él. Compara tu proyecto con el :gh:`proyecto de ejemplo <examples/tutorial>`, que puede parecer un poco diferente debido a la naturaleza paso a paso del tutorial.

source: There's a lot more to Flask than what you've seen so far. Even so, you're now equipped to start developing your own web applications. Check out the :doc:`/quickstart` for an overview of what Flask can do, then dive into the docs to keep learning. Flask uses `Jinja`_, `Click`_, `Werkzeug`_, and `ItsDangerous`_ behind the scenes, and they all have their own documentation too. You'll also be interested in :doc:`/extensions` which make tasks like working with the database or validating form data easier and more powerful.
es: Hay mucho más en Flask de lo que has visto hasta ahora. Aun así, ahora estás equipado para empezar a desarrollar tus propias aplicaciones web. Echa un vistazo al :doc:`/quickstart` para obtener una visión general de lo que Flask puede hacer, y luego bucea en los documentos para seguir aprendiendo. Flask utiliza `Jinja`_, `Click`_, `Werkzeug`_ y `ItsDangerous`_ entre bastidores, y todos ellos tienen también su propia documentación. También te interesará :doc:`/extensions` que facilitan y potencian tareas como el trabajo con la base de datos o la validación de datos de formularios.

source: If you want to keep developing your Flaskr project, here are some ideas for what to try next:
es: Si quieres seguir desarrollando tu proyecto Flaskr, aquí tienes algunas ideas sobre lo que puedes probar a continuación:

source: A detail view to show a single post. Click a post's title to go to its page.
es: Una vista detallada para mostrar una sola entrada. Haga clic en el título de una entrada para ir a su página.

source: Like / unlike a post.
es: Me gusta/no me gusta una entrada.

source: Comments.
es: Comentarios.

source: Tags. Clicking a tag shows all the posts with that tag.
es: Etiquetas. Al hacer clic en una etiqueta se muestran todos los mensajes con esa etiqueta.

source: A search box that filters the index page by name.
es: Una caja de búsqueda que filtra la página del índice por nombre.

source: Paged display. Only show 5 posts per page.
es: Visualización por páginas. Sólo muestra 5 posts por página.

source: Upload an image to go along with a post.
es: Cargar una imagen para acompañar un mensaje.

source: Format posts using Markdown.
es: Formatear los posts usando Markdown.

source: An RSS feed of new posts.
es: Una fuente RSS de nuevos mensajes.

source: Have fun and make awesome applications!
es: ¡Diviértete y haz aplicaciones increíbles!

source: Static Files
es: Archivos estáticos

source: The authentication views and templates work, but they look very plain right now. Some `CSS`_ can be added to add style to the HTML layout you constructed. The style won't change, so it's a *static* file rather than a template.
es: Las vistas y plantillas de autenticación funcionan, pero ahora mismo tienen un aspecto muy sencillo. Se puede añadir algo de `CSS`_ para añadir estilo al diseño HTML que has construido. El estilo no cambiará, por lo que es un archivo *estático* en lugar de una plantilla.

source: Flask automatically adds a ``static`` view that takes a path relative to the ``flaskr/static`` directory and serves it. The ``base.html`` template already has a link to the ``style.css`` file:
es: Flask añade automáticamente una vista ``static`` que toma una ruta relativa al directorio ``flaskr/static`` y la sirve. La plantilla ``base.html`` ya tiene un enlace al archivo ``style.css``:

source: Besides CSS, other types of static files might be files with JavaScript functions, or a logo image. They are all placed under the ``flaskr/static`` directory and referenced with ``url_for('static', filename='...')``.
es: Además de CSS, otros tipos de archivos estáticos pueden ser archivos con funciones de JavaScript, o una imagen de logotipo. Todos ellos se colocan en el directorio ``flaskr/static`` y se referencian con ``url_for('static', filename='...')``.

source: This tutorial isn't focused on how to write CSS, so you can just copy the following into the ``flaskr/static/style.css`` file:
es: Este tutorial no se centra en cómo escribir CSS, así que puedes copiar lo siguiente en el archivo ``flaskr/static/style.css``:

source: You can find a less compact version of ``style.css`` in the :gh:`example code <examples/tutorial/flaskr/static/style.css>`.
es: Puedes encontrar una versión menos compacta de ``style.css`` en el código de :gh:`ejemplo <examples/tutorial/flaskr/static/style.css>`.

source: Go to http://127.0.0.1:5000/auth/login and the page should look like the screenshot below.
es: Vaya a http://127.0.0.1:5000/auth/login y la página debería ser como la captura de pantalla de abajo.

source: You can read more about CSS from `Mozilla's documentation <CSS_>`_. If you change a static file, refresh the browser page. If the change doesn't show up, try clearing your browser's cache.
es: Puede leer más sobre CSS en la documentación de `Mozilla <CSS_>`_. Si cambia un archivo estático, actualice la página del navegador. Si el cambio no aparece, prueba a borrar la caché del navegador.

source: Continue to :doc:`blog`.
es: Continuar con :doc:`blog`.

source: Templates
es: Plantillas

source: You've written the authentication views for your application, but if you're running the server and try to go to any of the URLs, you'll see a ``TemplateNotFound`` error. That's because the views are calling :func:`render_template`, but you haven't written the templates yet. The template files will be stored in the ``templates`` directory inside the ``flaskr`` package.
es: Has escrito las vistas de autenticación para tu aplicación, pero si estás ejecutando el servidor e intentas ir a cualquiera de las URLs, verás un error ``TemplateNotFound``. Esto se debe a que las vistas están llamando a :func:`render_template`, pero aún no has escrito las plantillas. Los archivos de plantillas se almacenan en el directorio ``templates`` dentro del paquete ``flaskr``.

source: Templates are files that contain static data as well as placeholders for dynamic data. A template is rendered with specific data to produce a final document. Flask uses the `Jinja`_ template library to render templates.
es: Las plantillas son archivos que contienen datos estáticos así como marcadores de posición para datos dinámicos. Una plantilla se renderiza con datos específicos para producir un documento final. Flask utiliza la biblioteca de plantillas `Jinja`_ para renderizar las plantillas.

source: In your application, you will use templates to render `HTML`_ which will display in the user's browser. In Flask, Jinja is configured to *autoescape* any data that is rendered in HTML templates. This means that it's safe to render user input; any characters they've entered that could mess with the HTML, such as ``<`` and ``>`` will be *escaped* with *safe* values that look the same in the browser but don't cause unwanted effects.
es: En tu aplicación, usarás plantillas para renderizar `HTML`_ que se mostrará en el navegador del usuario. En Flask, Jinja está configurado para *autoescapar* cualquier dato que se renderice en las plantillas HTML. Esto significa que es seguro renderizar la entrada del usuario; cualquier carácter que haya introducido que pueda estropear el HTML, como ``<`` y ``>`` será *escapado* con valores *seguros* que se vean igual en el navegador pero que no causen efectos no deseados.

source: Jinja looks and behaves mostly like Python. Special delimiters are used to distinguish Jinja syntax from the static data in the template. Anything between ``{{`` and ``}}`` is an expression that will be output to the final document. ``{%`` and ``%}`` denotes a control flow statement like ``if`` and ``for``. Unlike Python, blocks are denoted by start and end tags rather than indentation since static text within a block could change indentation.
es: Jinja se ve y se comporta principalmente como Python. Se utilizan delimitadores especiales para distinguir la sintaxis de Jinja de los datos estáticos de la plantilla. Todo lo que esté entre ``{{`` y ``}}`` es una expresión que se enviará al documento final. ``{%`` y ``%}`` denota una declaración de flujo de control como ``if`` y ``for``. A diferencia de Python, los bloques se denotan mediante etiquetas de inicio y fin en lugar de indentación, ya que el texto estático dentro de un bloque podría cambiar la indentación.

source: The Base Layout
es: La disposición de la base

source: Each page in the application will have the same basic layout around a different body. Instead of writing the entire HTML structure in each template, each template will *extend* a base template and override specific sections.
es: Cada página de la aplicación tendrá el mismo diseño básico alrededor de un cuerpo diferente. En lugar de escribir toda la estructura HTML en cada plantilla, cada plantilla *extenderá* una plantilla base y anulará secciones específicas.

source: :data:`g` is automatically available in templates. Based on if ``g.user`` is set (from ``load_logged_in_user``), either the username and a log out link are displayed, or links to register and log in are displayed. :func:`url_for` is also automatically available, and is used to generate URLs to views instead of writing them out manually.
es: :data:`g` está disponible automáticamente en las plantillas. En función de si se establece ``g.user`` (desde ``load_logged_in_user``), se muestra el nombre de usuario y un enlace de cierre de sesión, o se muestran enlaces para registrarse e iniciar sesión. :func:`url_for` también está disponible automáticamente, y se utiliza para generar URLs a las vistas en lugar de escribirlas manualmente.

source: After the page title, and before the content, the template loops over each message returned by :func:`get_flashed_messages`. You used :func:`flash` in the views to show error messages, and this is the code that will display them.
es: Después del título de la página, y antes del contenido, la plantilla hace un bucle sobre cada mensaje devuelto por :func:`get_flashed_messages`. Has utilizado :func:`flash` en las vistas para mostrar los mensajes de error, y este es el código que los mostrará.

source: There are three blocks defined here that will be overridden in the other templates:
es: Hay tres bloques definidos aquí que serán anulados en las otras plantillas:

source: ``{% block title %}`` will change the title displayed in the browser's tab and window title.
es: ``{% block title %}`` cambiará el título mostrado en la pestaña del navegador y el título de la ventana.

source: ``{% block header %}`` is similar to ``title`` but will change the title displayed on the page.
es: ``{% block header %}`` es similar a ``title`` pero cambiará el título mostrado en la página.

source: ``{% block content %}`` is where the content of each page goes, such as the login form or a blog post.
es: ``{% block content %}`` es donde va el contenido de cada página, como el formulario de acceso o una entrada del blog.

source: The base template is directly in the ``templates`` directory. To keep the others organized, the templates for a blueprint will be placed in a directory with the same name as the blueprint.
es: La plantilla base está directamente en el directorio ``templates``. Para mantener los demás organizados, las plantillas de un plano se colocarán en un directorio con el mismo nombre que el plano.

source: Register
es: Registro

source: ``{% extends 'base.html' %}`` tells Jinja that this template should replace the blocks from the base template. All the rendered content must appear inside ``{% block %}`` tags that override blocks from the base template.
es: ``{% extends 'base.html' %}`` indica a Jinja que esta plantilla debe reemplazar los bloques de la plantilla base. Todo el contenido renderizado debe aparecer dentro de las etiquetas ``{% block %}`` que anulan los bloques de la plantilla base.

source: A useful pattern used here is to place ``{% block title %}`` inside ``{% block header %}``. This will set the title block and then output the value of it into the header block, so that both the window and page share the same title without writing it twice.
es: Un patrón útil utilizado aquí es colocar ``{% block title %}`` dentro de ``{% block header %}``. Esto establecerá el bloque title y luego emitirá el valor del mismo en el bloque header, para que tanto la ventana como la página compartan el mismo título sin escribirlo dos veces.

source: The ``input`` tags are using the ``required`` attribute here. This tells the browser not to submit the form until those fields are filled in. If the user is using an older browser that doesn't support that attribute, or if they are using something besides a browser to make requests, you still want to validate the data in the Flask view. It's important to always fully validate the data on the server, even if the client does some validation as well.
es: Las etiquetas ``input`` están usando el atributo ``required`` aquí. Esto le dice al navegador que no envíe el formulario hasta que esos campos sean rellenados. Si el usuario está usando un navegador antiguo que no soporta ese atributo, o si está usando algo más que un navegador para hacer peticiones, todavía quieres validar los datos en la vista Flask. Es importante siempre validar completamente los datos en el servidor, incluso si el cliente hace alguna validación también.

source: Log In
es: Iniciar sesión

source: This is identical to the register template except for the title and submit button.
es: Es idéntica a la plantilla de registro, excepto por el título y el botón de envío.

source: Register A User
es: Registrar un usuario

source: Now that the authentication templates are written, you can register a user. Make sure the server is still running (``flask run`` if it's not), then go to http://127.0.0.1:5000/auth/register.
es: Ahora que las plantillas de autenticación están escritas, puedes registrar un usuario. Asegúrate de que el servidor sigue funcionando (``flask run`` si no lo está), y luego ve a http://127.0.0.1:5000/auth/register.

source: Try clicking the "Register" button without filling out the form and see that the browser shows an error message. Try removing the ``required`` attributes from the ``register.html`` template and click "Register" again. Instead of the browser showing an error, the page will reload and the error from :func:`flash` in the view will be shown.
es: Prueba a hacer clic en el botón "Registrarse" sin rellenar el formulario y comprueba que el navegador muestra un mensaje de error. Prueba a eliminar los atributos ``required`` de la plantilla ``register.html`` y vuelve a hacer clic en "Registrarse". En lugar de que el navegador muestre un error, la página se recargará y se mostrará el error de :func:`flash` en la vista.

source: Fill out a username and password and you'll be redirected to the login page. Try entering an incorrect username, or the correct username and incorrect password. If you log in you'll get an error because there's no ``index`` view to redirect to yet.
es: Rellena un nombre de usuario y una contraseña y serás redirigido a la página de inicio de sesión. Intenta introducir un nombre de usuario incorrecto, o el nombre de usuario correcto y una contraseña incorrecta. Si te conectas obtendrás un error porque todavía no hay una vista ``index`` a la que redirigir.

source: Continue to :doc:`static`.
es: Continuar con :doc:`static`.

source: Test Coverage
es: Cobertura de la prueba

source: Writing unit tests for your application lets you check that the code you wrote works the way you expect. Flask provides a test client that simulates requests to the application and returns the response data.
es: Escribir pruebas unitarias para tu aplicación te permite comprobar que el código que has escrito funciona como esperas. Flask proporciona un cliente de pruebas que simula peticiones a la aplicación y devuelve los datos de respuesta.

source: You should test as much of your code as possible. Code in functions only runs when the function is called, and code in branches, such as ``if`` blocks, only runs when the condition is met. You want to make sure that each function is tested with data that covers each branch.
es: Deberías probar la mayor parte posible de tu código. El código de las funciones sólo se ejecuta cuando se llama a la función, y el código de las ramas, como los bloques ``if``, sólo se ejecuta cuando se cumple la condición. Debes asegurarte de que cada función se pruebe con datos que cubran cada rama.

source: This is being introduced late in the tutorial, but in your future projects you should test as you develop.
es: Esto se está introduciendo tarde en el tutorial, pero en tus futuros proyectos deberías hacer pruebas mientras desarrollas.

source: You'll use `pytest`_ and `coverage`_ to test and measure your code. Install them both:
es: Utilizarás `pytest`_ y `coverage`_ para probar y medir tu código. Instala ambos:

source: Setup and Fixtures
es: Configuración y fixtures

source: The test code is located in the ``tests`` directory. This directory is *next to* the ``flaskr`` package, not inside it. The ``tests/conftest.py`` file contains setup functions called *fixtures* that each test will use. Tests are in Python modules that start with ``test_``, and each test function in those modules also starts with ``test_``.
es: El código de prueba se encuentra en el directorio ``tests``. Este directorio está *al lado* del paquete ``flaskr``, no dentro de él. El archivo ``tests/conftest.py`` contiene funciones de configuración llamadas *fixtures* que cada prueba utilizará. Las pruebas están en módulos de Python que empiezan por ``test_``, y cada función de prueba en esos módulos también empieza por ``test_``.

source: Each test will create a new temporary database file and populate some data that will be used in the tests. Write a SQL file to insert that data.
es: Cada prueba creará un nuevo archivo de base de datos temporal y rellenará algunos datos que se utilizarán en las pruebas. Escribe un archivo SQL para insertar esos datos.

source: The ``app`` fixture will call the factory and pass ``test_config`` to configure the application and database for testing instead of using your local development configuration.
es: El fixture ``app`` llamará a la fábrica y pasará ``test_config`` para configurar la aplicación y la base de datos para las pruebas en lugar de utilizar su configuración local de desarrollo.

source: :func:`tempfile.mkstemp` creates and opens a temporary file, returning the file descriptor and the path to it. The ``DATABASE`` path is overridden so it points to this temporary path instead of the instance folder. After setting the path, the database tables are created and the test data is inserted. After the test is over, the temporary file is closed and removed.
es: :func:`tempfile.mkstemp` crea y abre un archivo temporal, devolviendo el descriptor del archivo y la ruta al mismo. La ruta de ``DATABASE`` se anula para que apunte a esta ruta temporal en lugar de a la carpeta de la instancia. Después de establecer la ruta, se crean las tablas de la base de datos y se insertan los datos de la prueba. Una vez finalizada la prueba, el archivo temporal se cierra y se elimina.

source: :data:`TESTING` tells Flask that the app is in test mode. Flask changes some internal behavior so it's easier to test, and other extensions can also use the flag to make testing them easier.
es: :data:`TESTING` indica a Flask que la aplicación está en modo de prueba. Flask cambia algunos comportamientos internos para que sea más fácil de probar, y otras extensiones también pueden utilizar la bandera para hacer que las pruebas sean más fáciles.

source: The ``client`` fixture calls :meth:`app.test_client() <Flask.test_client>` with the application object created by the ``app`` fixture. Tests will use the client to make requests to the application without running the server.
es: El fixture ``client`` llama a :meth:`app.test_client() <Flask.test_client>` con el objeto de aplicación creado por el fixture ``app``. Las pruebas utilizarán el cliente para hacer peticiones a la aplicación sin ejecutar el servidor.

source: The ``runner`` fixture is similar to ``client``. :meth:`app.test_cli_runner() <Flask.test_cli_runner>` creates a runner that can call the Click commands registered with the application.
es: El fixture ``runner`` es similar al ``client``. :meth:`app.test_cli_runner() <Flask.test_cli_runner>` crea un runner que puede llamar a los comandos Click registrados con la aplicación.

source: Pytest uses fixtures by matching their function names with the names of arguments in the test functions. For example, the ``test_hello`` function you'll write next takes a ``client`` argument. Pytest matches that with the ``client`` fixture function, calls it, and passes the returned value to the test function.
es: Pytest utiliza fixtures haciendo coincidir sus nombres de función con los nombres de los argumentos de las funciones de prueba. Por ejemplo, la función ``test_hello`` que escribirás a continuación toma un argumento ``client``. Pytest hace coincidir eso con la función fixture ``client``, la llama, y pasa el valor devuelto a la función de prueba.

source: Factory
es: Fábrica

source: There's not much to test about the factory itself. Most of the code will be executed for each test already, so if something fails the other tests will notice.
es: No hay mucho que probar sobre la fábrica en sí. La mayor parte del código se ejecutará ya para cada prueba, así que si algo falla las otras pruebas lo notarán.
