Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/tutorial.po
Languages: es

source: Creating, editing, and deleting blog posts will require a user to be logged in. A *decorator* can be used to check this for each view it's applied to.
es: La creación, edición y eliminación de entradas del blog requerirá que el usuario esté conectado. Se puede utilizar un *decorador* para comprobar esto para cada vista a la que se aplique.

source: This decorator returns a new view function that wraps the original view it's applied to. The new function checks if a user is loaded and redirects to the login page otherwise. If a user is loaded the original view is called and continues normally. You'll use this decorator when writing the blog views.
es: Este decorador devuelve una nueva función de vista que envuelve la vista original a la que se aplica. La nueva función comprueba si hay un usuario cargado y redirige a la página de inicio de sesión en caso contrario. Si se carga un usuario, se llama a la vista original y continúa normalmente. Utilizarás este decorador cuando escribas las vistas del blog.

source: Endpoints and URLs
es: Endpoints y URLs

source: The :func:`url_for` function generates the URL to a view based on a name and arguments. The name associated with a view is also called the *endpoint*, and by default it's the same as the name of the view function.
es: La función :func:`url_for` genera la URL de una vista basándose en un nombre y unos argumentos. El nombre asociado a una vista también se llama *endpoint*, y por defecto es el mismo que el nombre de la función de la vista.

source: For example, the ``hello()`` view that was added to the app factory earlier in the tutorial has the name ``'hello'`` and can be linked to with ``url_for('hello')``. If it took an argument, which you'll see later, it would be linked to using ``url_for('hello', who='World')``.
es: Por ejemplo, la vista ``hello()`` que fue añadida a la fábrica de aplicaciones anteriormente en el tutorial tiene el nombre ``'hello'`` y puede ser enlazada con ``url_for('hello')``. Si tuviera un argumento, que verás más adelante, se enlazaría con ``url_for('hello', who='World')``.

source: When using a blueprint, the name of the blueprint is prepended to the name of the function, so the endpoint for the ``login`` function you wrote above is ``'auth.login'`` because you added it to the ``'auth'`` blueprint.
es: Cuando se utiliza un blueprint, el nombre del blueprint se antepone al nombre de la función, por lo que el punto final de la función ``login`` que escribiste arriba es ``'auth.login'`` porque lo agregaste al blueprint ``'auth'``.

source: Continue to :doc:`templates`.
es: Continuar con :doc:`templates`.
