Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/tutorial.po
Languages: es

source: The only behavior that can change is passing test config. If config is not passed, there should be some default configuration, otherwise the configuration should be overridden.
es: El único comportamiento que puede cambiar es pasar la configuración de la prueba. Si no se pasa config, debe haber alguna configuración por defecto, de lo contrario la configuración debe ser anulada.

source: You added the ``hello`` route as an example when writing the factory at the beginning of the tutorial. It returns "Hello, World!", so the test checks that the response data matches.
es: Has añadido la ruta ``hello`` como ejemplo al escribir la fábrica al principio del tutorial. Devuelve "¡Hola, mundo!", por lo que la prueba comprueba que los datos de respuesta coinciden.

source: Database
es: Base de datos

source: Within an application context, ``get_db`` should return the same connection each time it's called. After the context, the connection should be closed.
es: Dentro de un contexto de aplicación, ``get_db`` debe devolver la misma conexión cada vez que se llame. Después del contexto, la conexión debe ser cerrada.

source: The ``init-db`` command should call the ``init_db`` function and output a message.
es: El comando ``init-db`` debe llamar a la función ``init_db`` y mostrar un mensaje.

source: This test uses Pytest's ``monkeypatch`` fixture to replace the ``init_db`` function with one that records that it's been called. The ``runner`` fixture you wrote above is used to call the ``init-db`` command by name.
es: Esta prueba utiliza el fixture ``monkeypatch`` de Pytest para sustituir la función ``init_db`` por otra que registre que ha sido llamada. El fixture ``runner`` que escribiste arriba se utiliza para llamar al comando ``init-db`` por su nombre.

source: Authentication
es: Autenticación

source: For most of the views, a user needs to be logged in. The easiest way to do this in tests is to make a ``POST`` request to the ``login`` view with the client. Rather than writing that out every time, you can write a class with methods to do that, and use a fixture to pass it the client for each test.
es: Para la mayoría de las vistas, un usuario necesita estar conectado. La forma más fácil de hacer esto en las pruebas es hacer una petición ``POST`` a la vista ``login`` con el cliente. En lugar de escribir eso cada vez, puedes escribir una clase con métodos para hacer eso, y usar un fixture para pasarle el cliente para cada prueba.

source: With the ``auth`` fixture, you can call ``auth.login()`` in a test to log in as the ``test`` user, which was inserted as part of the test data in the ``app`` fixture.
es: Con el fixture ``auth``, puedes llamar a ``auth.login()`` en una prueba para iniciar sesión como el usuario ``test``, que fue insertado como parte de los datos de la prueba en el fixture ``app``.

source: The ``register`` view should render successfully on ``GET``. On ``POST`` with valid form data, it should redirect to the login URL and the user's data should be in the database. Invalid data should display error messages.
es: La vista ``register`` debería ser mostrada con éxito en ``GET``. En ``POST`` con datos de formulario válidos, debería redirigir a la URL de acceso y los datos del usuario deberían estar en la base de datos. Los datos no válidos deberían mostrar mensajes de error.

source: :meth:`client.get() <werkzeug.test.Client.get>` makes a ``GET`` request and returns the :class:`Response` object returned by Flask. Similarly, :meth:`client.post() <werkzeug.test.Client.post>` makes a ``POST`` request, converting the ``data`` dict into form data.
es: :meth:`client.get() <werkzeug.test.Client.get>` realiza una petición ``GET`` y devuelve el objeto :class:`Response` devuelto por Flask. Del mismo modo, :meth:`client.post() <werkzeug.test.Client.post>` realiza una petición ``POST``, convirtiendo el dictado ``data`` en datos del formulario.

source: To test that the page renders successfully, a simple request is made and checked for a ``200 OK`` :attr:`~Response.status_code`. If rendering failed, Flask would return a ``500 Internal Server Error`` code.
es: Para comprobar que la página se renderiza correctamente, se hace una petición simple y se comprueba si hay un ``200 OK`` :attr:`~Response.status_code`. Si el renderizado falla, Flask devolverá un código ``500 Internal Server Error``.

source: :attr:`~Response.headers` will have a ``Location`` header with the login URL when the register view redirects to the login view.
es: :attr:`~Response.headers` tendrá una cabecera ``Location`` con la URL de acceso cuando la vista de registro redirija a la vista de acceso.

source: :attr:`~Response.data` contains the body of the response as bytes. If you expect a certain value to render on the page, check that it's in ``data``. Bytes must be compared to bytes. If you want to compare text, use :meth:`get_data(as_text=True) <werkzeug.wrappers.Response.get_data>` instead.
es: :attr:`~Response.data` contiene el cuerpo de la respuesta en forma de bytes. Si esperas que un determinado valor se renderice en la página, comprueba que está en ``data``. Los bytes deben ser comparados con bytes. Si quieres comparar texto, utiliza :meth:`get_data(as_text=True) <werkzeug.wrappers.Response.get_data>` en su lugar.

source: ``pytest.mark.parametrize`` tells Pytest to run the same test function with different arguments. You use it here to test different invalid input and error messages without writing the same code three times.
es: ``pytest.mark.parametrize`` le dice a Pytest que ejecute la misma función de prueba con diferentes argumentos. Se utiliza aquí para probar diferentes entradas no válidas y mensajes de error sin tener que escribir el mismo código tres veces.

source: The tests for the ``login`` view are very similar to those for ``register``. Rather than testing the data in the database, :data:`session` should have ``user_id`` set after logging in.
es: Las pruebas para la vista ``login`` son muy similares a las de ``register``. En lugar de probar los datos en la base de datos, :data:`session` debe tener ``user_id`` establecido después de iniciar la sesión.

source: Using ``client`` in a ``with`` block allows accessing context variables such as :data:`session` after the response is returned. Normally, accessing ``session`` outside of a request would raise an error.
es: El uso de ``client`` en un bloque ``with`` permite acceder a variables de contexto como :data:`session` después de que se devuelva la respuesta. Normalmente, acceder a ``session`` fuera de una petición daría un error.

source: Testing ``logout`` is the opposite of ``login``. :data:`session` should not contain ``user_id`` after logging out.
es: Probar ``logout`` es lo contrario de ``login``. :data:`session` no debe contener ``user_id`` después de cerrar la sesión.

source: All the blog views use the ``auth`` fixture you wrote earlier. Call ``auth.login()`` and subsequent requests from the client will be logged in as the ``test`` user.
es: Todas las vistas del blog utilizan el fixture ``auth`` que escribiste antes. Llama a ``auth.login()`` y las siguientes peticiones del cliente se registrarán como el usuario ``test``.

source: The ``index`` view should display information about the post that was added with the test data. When logged in as the author, there should be a link to edit the post.
es: La vista ``index`` debería mostrar información sobre el post que fue añadido con los datos de prueba. Cuando se inicie la sesión como autor, debería haber un enlace para editar la entrada.

source: You can also test some more authentication behavior while testing the ``index`` view. When not logged in, each page shows links to log in or register. When logged in, there's a link to log out.
es: También puedes probar más comportamientos de autenticación mientras pruebas la vista ``index``. Cuando no se ha iniciado la sesión, cada página muestra enlaces para iniciar la sesión o registrarse. Cuando se ha iniciado la sesión, hay un enlace para cerrar la sesión.

source: A user must be logged in to access the ``create``, ``update``, and ``delete`` views. The logged in user must be the author of the post to access ``update`` and ``delete``, otherwise a ``403 Forbidden`` status is returned. If a ``post`` with the given ``id`` doesn't exist, ``update`` and ``delete`` should return ``404 Not Found``.
es: Un usuario debe estar conectado para acceder a las vistas ``create``, ``update`` y ``delete``. El usuario conectado debe ser el autor de la entrada para acceder a ``update`` y ``delete``, de lo contrario se devuelve el estado ``403 Forbidden``. Si un ``post`` con el ``id`` dado no existe, ``update`` y ``delete`` deben devolver ``404 Not Found``.

source: The ``create`` and ``update`` views should render and return a ``200 OK`` status for a ``GET`` request. When valid data is sent in a ``POST`` request, ``create`` should insert the new post data into the database, and ``update`` should modify the existing data. Both pages should show an error message on invalid data.
es: Las vistas ``create`` y ``update`` deben generar y devolver un estado ``200 OK`` para una petición ``GET``. Cuando se envían datos válidos en una petición ``POST``, ``create`` debe insertar los nuevos datos de la entrada en la base de datos, y ``update`` debe modificar los datos existentes. Ambas páginas deben mostrar un mensaje de error si los datos no son válidos.

source: The ``delete`` view should redirect to the index URL and the post should no longer exist in the database.
es: La vista ``delete`` debería redirigir a la URL del índice y la entrada ya no debería existir en la base de datos.

source: Running the Tests
es: Ejecución de las pruebas

source: Some extra configuration, which is not required but makes running tests with coverage less verbose, can be added to the project's ``setup.cfg`` file.
es: En el archivo ``setup.cfg`` del proyecto se puede añadir alguna configuración extra, que no es necesaria pero que hace que la ejecución de las pruebas con cobertura sea menos verbosa.

source: To run the tests, use the ``pytest`` command. It will find and run all the test functions you've written.
es: Para ejecutar las pruebas, utiliza el comando ``pytest``. Encontrará y ejecutará todas las funciones de prueba que hayas escrito.

source: If any tests fail, pytest will show the error that was raised. You can run ``pytest -v`` to get a list of each test function rather than dots.
es: Si alguna prueba falla, pytest mostrará el error que se produjo. Puedes ejecutar ``pytest -v`` para obtener una lista de cada función de prueba en lugar de puntos.

source: To measure the code coverage of your tests, use the ``coverage`` command to run pytest instead of running it directly.
es: Para medir la cobertura de código de tus pruebas, utiliza el comando ``coverage`` para ejecutar pytest en lugar de ejecutarlo directamente.

source: You can either view a simple coverage report in the terminal:
es: Puede ver un simple informe de cobertura en el terminal:

source: An HTML report allows you to see which lines were covered in each file:
es: Un informe HTML le permite ver qué líneas se han cubierto en cada archivo:

source: This generates files in the ``htmlcov`` directory. Open ``htmlcov/index.html`` in your browser to see the report.
es: Esto genera archivos en el directorio ``htmlcov``. Abra ``htmlcov/index.html`` en su navegador para ver el informe.

source: Continue to :doc:`deploy`.
es: Continúe con :doc:`deploy`.

source: Blueprints and Views
es: Blueprints y vistas

source: A view function is the code you write to respond to requests to your application. Flask uses patterns to match the incoming request URL to the view that should handle it. The view returns data that Flask turns into an outgoing response. Flask can also go the other direction and generate a URL to a view based on its name and arguments.
es: Una función de vista es el código que escribes para responder a las peticiones de tu aplicación. Flask utiliza patrones para hacer coincidir la URL de la solicitud entrante con la vista que debe manejarla. La vista devuelve datos que Flask convierte en una respuesta saliente. Flask también puede ir en la otra dirección y generar una URL a una vista basada en su nombre y argumentos.

source: Create a Blueprint
es: Crear un Blueprint

source: A :class:`Blueprint` is a way to organize a group of related views and other code. Rather than registering views and other code directly with an application, they are registered with a blueprint. Then the blueprint is registered with the application when it is available in the factory function.
es: Un :class:`Blueprint` es una forma de organizar un grupo de vistas y otro código relacionados. En lugar de registrar las vistas y otro código directamente con una aplicación, se registran con un blueprint. Entonces el blueprint se registra con la aplicación cuando está disponible en la función de fábrica.

source: Flaskr will have two blueprints, one for authentication functions and one for the blog posts functions. The code for each blueprint will go in a separate module. Since the blog needs to know about authentication, you'll write the authentication one first.
es: Flaskr tendrá dos blueprints, uno para las funciones de autenticación y otro para las funciones de las entradas del blog. El código para cada blueprint irá en un módulo separado. Dado que el blog necesita conocer la autenticación, escribirás primero el de autenticación.

source: This creates a :class:`Blueprint` named ``'auth'``. Like the application object, the blueprint needs to know where it's defined, so ``__name__`` is passed as the second argument. The ``url_prefix`` will be prepended to all the URLs associated with the blueprint.
es: Esto crea un :class:`Blueprint` llamado ``'auth'``. Al igual que el objeto de aplicación, el blueprint necesita saber dónde está definido, por lo que se pasa ``nombre__`` como segundo argumento. El ``url_prefix`` se añadirá a todas las URLs asociadas al blueprint.

source: The authentication blueprint will have views to register new users and to log in and log out.
es: El Blueprint de autenticación tendrá vistas para registrar nuevos usuarios y para iniciar y cerrar la sesión.

source: The First View: Register
es: La primera vista: Registro

source: When the user visits the ``/auth/register`` URL, the ``register`` view will return `HTML`_ with a form for them to fill out. When they submit the form, it will validate their input and either show the form again with an error message or create the new user and go to the login page.
es: Cuando el usuario visita la URL ``/auth/register``, la vista ``register`` devolverá `HTML`_ con un formulario para que lo rellenen. Cuando envíen el formulario, se validará su entrada y se mostrará de nuevo el formulario con un mensaje de error o se creará el nuevo usuario y se irá a la página de inicio de sesión.

source: For now you will just write the view code. On the next page, you'll write templates to generate the HTML form.
es: Por ahora sólo escribirás el código de la vista. En la siguiente página, escribirás las plantillas para generar el formulario HTML.

source: Here's what the ``register`` view function is doing:
es: Esto es lo que hace la función de vista ``register``:

source: :meth:`@bp.route <Blueprint.route>` associates the URL ``/register`` with the ``register`` view function. When Flask receives a request to ``/auth/register``, it will call the ``register`` view and use the return value as the response.
es: :meth:`@bp.route <Blueprint.route>` asocia la URL ``/register`` con la función de la vista ``register``. Cuando Flask reciba una petición a ``/auth/register``, llamará a la vista ``register`` y utilizará el valor devuelto como respuesta.

source: If the user submitted the form, :attr:`request.method <Request.method>` will be ``'POST'``. In this case, start validating the input.
es: Si el usuario ha enviado el formulario, :attr:`request.method <Request.method>` será ``'POST'``. En este caso, empieza a validar la entrada.

source: :attr:`request.form <Request.form>` is a special type of :class:`dict` mapping submitted form keys and values. The user will input their ``username`` and ``password``.
es: :attr:`request.form <Request.form>` es un tipo especial de :class:`dict` que mapea las claves y valores del formulario enviado. El usuario introducirá su ``nombre de usuario`` y su ``contraseña``.

source: Validate that ``username`` and ``password`` are not empty.
es: Valida que ``nombre de usuario`` y ``contraseña`` no estén vacíos.

source: Validate that ``username`` is not already registered by querying the database and checking if a result is returned. :meth:`db.execute <sqlite3.Connection.execute>` takes a SQL query with ``?`` placeholders for any user input, and a tuple of values to replace the placeholders with. The database library will take care of escaping the values so you are not vulnerable to a *SQL injection attack*.
es: Valida que ``nombre de usuario`` no está ya registrado consultando la base de datos y comprobando si se devuelve un resultado. :meth:`db.execute <sqlite3.Connection.execute>` toma una consulta SQL con ``?`` marcadores de posición para cualquier entrada del usuario, y una tupla de valores para reemplazar los marcadores de posición. La biblioteca de la base de datos se encargará de escapar los valores para que no seas vulnerable a un *ataque de inyección SQL*.

source: :meth:`~sqlite3.Cursor.fetchone` returns one row from the query. If the query returned no results, it returns ``None``. Later, :meth:`~sqlite3.Cursor.fetchall` is used, which returns a list of all results.
es: :meth:`~sqlite3.Cursor.fetchone` devuelve una fila de la consulta. Si la consulta no devuelve ningún resultado, devuelve ``None``. Más tarde, :meth:`~sqlite3.Cursor.fetchall` es utilizado, que devuelve una lista de todos los resultados.

source: If validation succeeds, insert the new user data into the database. For security, passwords should never be stored in the database directly. Instead, :func:`~werkzeug.security.generate_password_hash` is used to securely hash the password, and that hash is stored. Since this query modifies data, :meth:`db.commit() <sqlite3.Connection.commit>` needs to be called afterwards to save the changes.
es: Si la validación tiene éxito, inserte los nuevos datos del usuario en la base de datos. Por seguridad, las contraseñas nunca deben ser almacenadas en la base de datos directamente. En su lugar, se utiliza :func:`~werkzeug.security.generate_password_hash` para hacer un hash seguro de la contraseña, y ese hash se almacena. Como esta consulta modifica los datos, es necesario llamar después a :meth:`db.commit() <sqlite3.Connection.commit>` para guardar los cambios.

source: After storing the user, they are redirected to the login page. :func:`url_for` generates the URL for the login view based on its name. This is preferable to writing the URL directly as it allows you to change the URL later without changing all code that links to it. :func:`redirect` generates a redirect response to the generated URL.
es: Después de almacenar al usuario, se le redirige a la página de inicio de sesión. :func:`url_for` genera la URL para la vista de inicio de sesión basándose en su nombre. Esto es preferible a escribir la URL directamente ya que permite cambiar la URL más tarde sin cambiar todo el código que enlaza con ella. :func:`redirect` genera una respuesta de redirección a la URL generada.

source: If validation fails, the error is shown to the user. :func:`flash` stores messages that can be retrieved when rendering the template.
es: Si la validación falla, se muestra el error al usuario. :func:`flash` almacena mensajes que pueden ser recuperados al renderizar la plantilla.

source: When the user initially navigates to ``auth/register``, or there was a validation error, an HTML page with the registration form should be shown. :func:`render_template` will render a template containing the HTML, which you'll write in the next step of the tutorial.
es: Cuando el usuario navega inicialmente a ``auth/register``, o hay un error de validación, se debe mostrar una página HTML con el formulario de registro. :func:`render_template` renderizará una plantilla que contiene el HTML, que escribirás en el siguiente paso del tutorial.

source: Login
es: Inicio de sesión

source: This view follows the same pattern as the ``register`` view above.
es: Esta vista sigue el mismo patrón que la vista ``registro`` anterior.

source: There are a few differences from the ``register`` view:
es: Hay algunas diferencias con la vista ``register``:

source: The user is queried first and stored in a variable for later use.
es: El usuario se consulta primero y se almacena en una variable para su uso posterior.

source: :func:`~werkzeug.security.check_password_hash` hashes the submitted password in the same way as the stored hash and securely compares them. If they match, the password is valid.
es: :func:`~werkzeug.security.check_password_hash` realiza el hash de la contraseña enviada de la misma forma que el hash almacenado y los compara de forma segura. Si coinciden, la contraseña es válida.

source: :data:`session` is a :class:`dict` that stores data across requests. When validation succeeds, the user's ``id`` is stored in a new session. The data is stored in a *cookie* that is sent to the browser, and the browser then sends it back with subsequent requests. Flask securely *signs* the data so that it can't be tampered with.
es: :data:`session` es una :class:`dict` que almacena datos a través de las peticiones. Cuando la validación tiene éxito, el ``id`` del usuario se almacena en una nueva sesión. Los datos se almacenan en una *cookie* que se envía al navegador, y éste la devuelve con las siguientes peticiones. Flask *firma* de forma segura los datos para que no puedan ser manipulados.

source: Now that the user's ``id`` is stored in the :data:`session`, it will be available on subsequent requests. At the beginning of each request, if a user is logged in their information should be loaded and made available to other views.
es: Ahora que el ``id`` del usuario está almacenado en el :data:`session`, estará disponible en las siguientes peticiones. Al principio de cada petición, si un usuario está conectado, su información debe ser cargada and made available to other views.

source: :meth:`bp.before_app_request() <Blueprint.before_app_request>` registers a function that runs before the view function, no matter what URL is requested. ``load_logged_in_user`` checks if a user id is stored in the :data:`session` and gets that user's data from the database, storing it on :data:`g.user <g>`, which lasts for the length of the request. If there is no user id, or if the id doesn't exist, ``g.user`` will be ``None``.
es: :meth:`bp.before_app_request() <Blueprint.before_app_request>` registra una función que se ejecuta antes de la función de vista, sin importar la URL solicitada. ``load_logged_in_user`` comprueba si hay un id de usuario almacenado en la :data:`session` y obtiene los datos de ese usuario de la base de datos, almacenándolos en :data:`g.user <g>`, que dura lo que dure la petición. Si no hay id de usuario, o si el id no existe, ``g.user`` será ``None``.

source: Logout
es: Cierre de sesión

source: To log out, you need to remove the user id from the :data:`session`. Then ``load_logged_in_user`` won't load a user on subsequent requests.
es: Para cerrar la sesión, es necesario eliminar el id de usuario de la :data:`session`. Entonces ``load_logged_in_user`` no cargará un usuario en las siguientes peticiones.

source: Require Authentication in Other Views
es: Requerir autenticación en otras vistas
