Repository: moisesjurad0/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/tutorial.po
Languages: es

source: You'll use the same techniques you learned about when writing the authentication blueprint to write the blog blueprint. The blog should list all posts, allow logged in users to create posts, and allow the author of a post to edit or delete it.
es: Utilizarás las mismas técnicas que aprendiste al escribir el Blueprint de autenticación para escribir el Blueprint del blog. El blog debe listar todas las entradas, permitir a los usuarios registrados crear entradas, y permitir al autor de una entrada editarla o eliminarla.

source: As you implement each view, keep the development server running. As you save your changes, try going to the URL in your browser and testing them out.
es: A medida que implementes cada vista, mantén el servidor de desarrollo en funcionamiento. A medida que guarde los cambios, intente ir a la URL en su navegador y probarlos.

source: The Blueprint
es: El Blueprint

source: Define the blueprint and register it in the application factory.
es: Define el blueprint y regístralo en la fábrica de aplicaciones.

source: Import and register the blueprint from the factory using :meth:`app.register_blueprint() <Flask.register_blueprint>`. Place the new code at the end of the factory function before returning the app.
es: Importa y registra el blueprint de la fábrica usando :meth:`app.register_blueprint() <Flask.register_blueprint>`. Coloca el nuevo código al final de la función de fábrica antes de devolver la app.

source: Unlike the auth blueprint, the blog blueprint does not have a ``url_prefix``. So the ``index`` view will be at ``/``, the ``create`` view at ``/create``, and so on. The blog is the main feature of Flaskr, so it makes sense that the blog index will be the main index.
es: A diferencia del plano de autenticidad, el blueprint del blog no tiene una ``url_prefix``. Así que la vista ``index`` estará en ``/``, la vista ``create`` en ``/create``, y así sucesivamente. El blog es la característica principal de Flaskr, así que tiene sentido que el índice del blog sea el índice principal.

source: However, the endpoint for the ``index`` view defined below will be ``blog.index``. Some of the authentication views referred to a plain ``index`` endpoint. :meth:`app.add_url_rule() <Flask.add_url_rule>` associates the endpoint name ``'index'`` with the ``/`` url so that ``url_for('index')`` or ``url_for('blog.index')`` will both work, generating the same ``/`` URL either way.
es: Sin embargo, el punto final para la vista ``index`` definida a continuación será ``blog.index``. Algunas de las vistas de autenticación hacían referencia a un punto final simple ``index``. :meth:`app.add_url_rule() <Flask.add_url_rule>` asocia el nombre del punto final ``'index`` con la url ``/`` para que ``url_for('index')`` o ``url_for('blog.index')`` funcionen ambos, generando la misma URL ``/`` de cualquier manera.

source: In another application you might give the blog blueprint a ``url_prefix`` and define a separate ``index`` view in the application factory, similar to the ``hello`` view. Then the ``index`` and ``blog.index`` endpoints and URLs would be different.
es: En otra aplicación podrías dar al blueprint del blog un ``url_prefix`` y definir una vista ``index`` separada en la fábrica de la aplicación, similar a la vista ``hello``. Entonces los puntos finales y las URL de ``index`` y ``blog.index`` serían diferentes.

source: Index
es: Índice

source: The index will show all of the posts, most recent first. A ``JOIN`` is used so that the author information from the ``user`` table is available in the result.
es: El índice mostrará todos los mensajes, el más reciente primero. Se utiliza un ``JOIN`` para que la información del autor de la tabla ``user`` esté disponible en el resultado.

source: When a user is logged in, the ``header`` block adds a link to the ``create`` view. When the user is the author of a post, they'll see an "Edit" link to the ``update`` view for that post. ``loop.last`` is a special variable available inside `Jinja for loops`_. It's used to display a line after each post except the last one, to visually separate them.
es: Cuando un usuario está conectado, el bloque ``header`` añade un enlace a la vista ``create``. Cuando el usuario es el autor de una entrada, verá un enlace "Edit" a la vista ``update`` para esa entrada. ``loop.last`` es una variable especial disponible dentro de `Jinja para bucles`_. Se utiliza para mostrar una línea después de cada entrada excepto la última, para separarlas visualmente.

source: Create
es: Crear

source: The ``create`` view works the same as the auth ``register`` view. Either the form is displayed, or the posted data is validated and the post is added to the database or an error is shown.
es: La vista ``create`` funciona igual que la vista auth ``register``. O bien se muestra el formulario, o bien se validan los datos publicados y se añaden a la base de datos o se muestra un error.

source: The ``login_required`` decorator you wrote earlier is used on the blog views. A user must be logged in to visit these views, otherwise they will be redirected to the login page.
es: El decorador ``login_required`` que escribiste antes se utiliza en las vistas del blog. Un usuario debe estar conectado para visitar estas vistas, de lo contrario será redirigido a la página de inicio de sesión.

source: Update
es: Actualización

source: Both the ``update`` and ``delete`` views will need to fetch a ``post`` by ``id`` and check if the author matches the logged in user. To avoid duplicating code, you can write a function to get the ``post`` and call it from each view.
es: Tanto la vista ``update`` como la vista ``delete`` necesitarán obtener un ``post`` por ``id`` y comprobar si el autor coincide con el usuario conectado. Para evitar duplicar el código, puedes escribir una función para obtener el ``post`` y llamarla desde cada vista.

source: :func:`abort` will raise a special exception that returns an HTTP status code. It takes an optional message to show with the error, otherwise a default message is used. ``404`` means "Not Found", and ``403`` means "Forbidden". (``401`` means "Unauthorized", but you redirect to the login page instead of returning that status.)
es: :func:`abort` lanzará una excepción especial que devuelve un código de estado HTTP. Toma un mensaje opcional para mostrar con el error, de lo contrario se utiliza un mensaje por defecto. ``404`` significa "Not Found", y ``403`` significa "Forbidden". (``401`` significa "Unauthorized", pero redirige a la página de acceso en lugar de devolver ese estado).

source: The ``check_author`` argument is defined so that the function can be used to get a ``post`` without checking the author. This would be useful if you wrote a view to show an individual post on a page, where the user doesn't matter because they're not modifying the post.
es: El argumento ``check_author`` se define para que la función pueda ser utilizada para obtener un ``post`` sin comprobar el autor. Esto sería útil si escribes una vista para mostrar un post individual en una página, donde el usuario no importa porque no está modificando el post.

source: Unlike the views you've written so far, the ``update`` function takes an argument, ``id``. That corresponds to the ``<int:id>`` in the route. A real URL will look like ``/1/update``. Flask will capture the ``1``, ensure it's an :class:`int`, and pass it as the ``id`` argument. If you don't specify ``int:`` and instead do ``<id>``, it will be a string. To generate a URL to the update page, :func:`url_for` needs to be passed the ``id`` so it knows what to fill in: ``url_for('blog.update', id=post['id'])``. This is also in the ``index.html`` file above.
es: A diferencia de las vistas que has escrito hasta ahora, la función ``update`` toma un argumento, ``id``. Este corresponde al ``<int:id>` de la ruta. Una URL real será como ``/1/update``. Flask capturará el ``1``, se asegurará de que es un :class:`int`, y lo pasará como el argumento ``id``. Si no especificas ``int:`` y en su lugar haces ``<id>``, será una cadena. Para generar una URL a la página de actualización, a :func:`url_for` hay que pasarle el ``id`` para que sepa qué rellenar: ``url_for('blog.update', id=post['id'])``. Esto también está en el archivo ``index.html`` de arriba.

source: The ``create`` and ``update`` views look very similar. The main difference is that the ``update`` view uses a ``post`` object and an ``UPDATE`` query instead of an ``INSERT``. With some clever refactoring, you could use one view and template for both actions, but for the tutorial it's clearer to keep them separate.
es: Las vistas ``create`` y ``update`` son muy similares. La principal diferencia es que la vista ``update`` utiliza un objeto ``post`` y una consulta ``UPDATE`` en lugar de un ``INSERT``. Con un poco de refactorización inteligente, podrías usar una vista y una plantilla para ambas acciones, pero para el tutorial es más claro mantenerlas separadas.

source: This template has two forms. The first posts the edited data to the current page (``/<id>/update``). The other form contains only a button and specifies an ``action`` attribute that posts to the delete view instead. The button uses some JavaScript to show a confirmation dialog before submitting.
es: Esta plantilla tiene dos formas. El primero publica los datos editados en la página actual (``/<id>/update``). El otro formulario contiene sólo un botón y especifica un atributo ``action`` que envía a la vista de borrado. El botón utiliza algo de JavaScript para mostrar un diálogo de confirmación antes de enviarlo.

source: The pattern ``{{ request.form['title'] or post['title'] }}`` is used to choose what data appears in the form. When the form hasn't been submitted, the original ``post`` data appears, but if invalid form data was posted you want to display that so the user can fix the error, so ``request.form`` is used instead. :data:`request` is another variable that's automatically available in templates.
es: El patrón ``{{ request.form['title'] o post['title'] }}` se utiliza para elegir qué datos aparecen en el formulario. Cuando el formulario no se ha enviado, aparecen los datos originales de ``post``, pero si se han publicado datos de formulario no válidos, se desea mostrarlos para que el usuario pueda solucionar el error, por lo que se utiliza ``request.form`` en su lugar. :data:`request` es otra variable que está disponible automáticamente en las plantillas.

source: Delete
es: Borrar

source: The delete view doesn't have its own template, the delete button is part of ``update.html`` and posts to the ``/<id>/delete`` URL. Since there is no template, it will only handle the ``POST`` method and then redirect to the ``index`` view.
es: La vista de borrado no tiene su propia plantilla, el botón de borrado es parte de ``update.html`` y publica en la URL ``/<id>/delete``. Como no hay plantilla, sólo manejará el método ``POST`` y luego redirigirá a la vista ``index``.

source: Congratulations, you've now finished writing your application! Take some time to try out everything in the browser. However, there's still more to do before the project is complete.
es: Enhorabuena, ya has terminado de escribir tu aplicación. Tómate un tiempo para probarlo todo en el navegador. Sin embargo, todavía hay más cosas que hacer antes de que el proyecto esté completo.

source: Continue to :doc:`install`.
es: Continúa con :doc:`install`.

source: Define and Access the Database
es: Definir y acceder a la base de datos

source: The application will use a `SQLite`_ database to store users and posts. Python comes with built-in support for SQLite in the :mod:`sqlite3` module.
es: La aplicación utilizará una base de datos `SQLite`_ para almacenar los usuarios y los mensajes. Python viene con soporte incorporado para SQLite en el módulo :mod:`sqlite3`.

source: SQLite is convenient because it doesn't require setting up a separate database server and is built-in to Python. However, if concurrent requests try to write to the database at the same time, they will slow down as each write happens sequentially. Small applications won't notice this. Once you become big, you may want to switch to a different database.
es: SQLite es conveniente porque no requiere configurar un servidor de base de datos separado y está incorporado a Python. Sin embargo, si las solicitudes concurrentes intentan escribir en la base de datos al mismo tiempo, se ralentizarán ya que cada escritura se produce de forma secuencial. Las aplicaciones pequeñas no notarán esto. Una vez que se convierta en grande, es posible que desee cambiar a una base de datos diferente.

source: The tutorial doesn't go into detail about SQL. If you are not familiar with it, the SQLite docs describe the `language`_.
es: El tutorial no entra en detalles sobre SQL. Si no estás familiarizado con él, los documentos de SQLite describen el `lenguaje`_.

source: Connect to the Database
es: Conectar con la base de datos

source: The first thing to do when working with a SQLite database (and most other Python database libraries) is to create a connection to it. Any queries and operations are performed using the connection, which is closed after the work is finished.
es: Lo primero que hay que hacer cuando se trabaja con una base de datos SQLite (y con la mayoría de las bibliotecas de bases de datos de Python) es crear una conexión a la misma. Todas las consultas y operaciones se realizan utilizando la conexión, que se cierra una vez finalizado el trabajo.

source: In web applications this connection is typically tied to the request. It is created at some point when handling a request, and closed before the response is sent.
es: En las aplicaciones web esta conexión suele estar ligada a la petición. Se crea en algún momento cuando se maneja una solicitud, y se cierra antes de que se envíe la respuesta.

source: :data:`g` is a special object that is unique for each request. It is used to store data that might be accessed by multiple functions during the request. The connection is stored and reused instead of creating a new connection if ``get_db`` is called a second time in the same request.
es: :data:`g` es un objeto especial que es único para cada solicitud. Se utiliza para almacenar datos a los que podrían acceder varias funciones durante la petición. La conexión se almacena y se reutiliza en lugar de crear una nueva conexión si se llama a ``get_db`` por segunda vez en la misma petición.

source: :data:`current_app` is another special object that points to the Flask application handling the request. Since you used an application factory, there is no application object when writing the rest of your code. ``get_db`` will be called when the application has been created and is handling a request, so :data:`current_app` can be used.
es: :data:`current_app` es otro objeto especial que apunta a la aplicación Flask que maneja la solicitud. Como has utilizado una fábrica de aplicaciones, no hay ningún objeto de aplicación cuando escribes el resto de tu código. La llamada a ``get_db`` se realizará cuando la aplicación haya sido creada y esté gestionando una petición, por lo que se puede utilizar :data:`current_app`.

source: :func:`sqlite3.connect` establishes a connection to the file pointed at by the ``DATABASE`` configuration key. This file doesn't have to exist yet, and won't until you initialize the database later.
es: :func:`sqlite3.connect` establece una conexión con el fichero apuntado por la clave de configuración ``DATABASE``. Este archivo no tiene que existir todavía, y no lo hará hasta que se inicialice la base de datos más tarde.

source: :class:`sqlite3.Row` tells the connection to return rows that behave like dicts. This allows accessing the columns by name.
es: :class:`sqlite3.Row` indica a la conexión que devuelva filas que se comporten como dicts. Esto permite acceder a las columnas por su nombre.

source: ``close_db`` checks if a connection was created by checking if ``g.db`` was set. If the connection exists, it is closed. Further down you will tell your application about the ``close_db`` function in the application factory so that it is called after each request.
es: ``close_db`` comprueba si se ha creado una conexión comprobando si se ha establecido ``g.db``. Si la conexión existe, se cierra. Más adelante le dirás a tu aplicación sobre la función ``close_db`` en la fábrica de la aplicación para que sea llamada después de cada petición.

source: Create the Tables
es: Crear las tablas

source: In SQLite, data is stored in *tables* and *columns*. These need to be created before you can store and retrieve data. Flaskr will store users in the ``user`` table, and posts in the ``post`` table. Create a file with the SQL commands needed to create empty tables:
es: En SQLite, los datos se almacenan en *tablas* y *columnas*. Estas deben ser creadas antes de poder almacenar y recuperar los datos. Flaskr almacenará los usuarios en la tabla ``user``, y las entradas en la tabla ``post``. Crea un archivo con los comandos SQL necesarios para crear tablas vacías:

source: Add the Python functions that will run these SQL commands to the ``db.py`` file:
es: Añade las funciones de Python que ejecutarán estos comandos SQL al archivo ``db.py``:

source: :meth:`open_resource() <Flask.open_resource>` opens a file relative to the ``flaskr`` package, which is useful since you won't necessarily know where that location is when deploying the application later. ``get_db`` returns a database connection, which is used to execute the commands read from the file.
es: :meth:`open_resource() <Flask.open_resource>` abre un archivo relativo al paquete ``flaskr``, lo cual es útil ya que no necesariamente se sabrá dónde está esa ubicación cuando se despliegue la aplicación posteriormente. ``get_db`` devuelve una conexión a la base de datos, que se utiliza para ejecutar los comandos leídos del archivo.

source: :func:`click.command` defines a command line command called ``init-db`` that calls the ``init_db`` function and shows a success message to the user. You can read :doc:`/cli` to learn more about writing commands.
es: :func:`click.command` define un comando de línea de comandos llamado ``init-db`` que llama a la función ``init_db`` y muestra un mensaje de éxito al usuario. Puedes leer :doc:`/cli` para aprender más sobre la escritura de comandos.

source: Register with the Application
es: Regístrese con la aplicación

source: The ``close_db`` and ``init_db_command`` functions need to be registered with the application instance; otherwise, they won't be used by the application. However, since you're using a factory function, that instance isn't available when writing the functions. Instead, write a function that takes an application and does the registration.
es: Las funciones ``close_db`` y ``init_db_command`` necesitan ser registradas con la instancia de la aplicación; de lo contrario, no serán utilizadas por la aplicación. Sin embargo, como estás usando una función de fábrica, esa instancia no está disponible cuando escribes las funciones. En su lugar, escribe una función que tome una aplicación y haga el registro.

source: :meth:`app.teardown_appcontext() <Flask.teardown_appcontext>` tells Flask to call that function when cleaning up after returning the response.
es: :meth:`app.teardown_appcontext() <Flask.teardown_appcontext>` le dice a Flask que llame a esa función cuando se limpie después de devolver la respuesta.

source: :meth:`app.cli.add_command() <click.Group.add_command>` adds a new command that can be called with the ``flask`` command.
es: :meth:`app.cli.add_command() <click.Group.add_command>` añade un nuevo comando que puede ser llamado con el comando ``flask``.

source: Import and call this function from the factory. Place the new code at the end of the factory function before returning the app.
es: Importa y llama a esta función desde la fábrica. Coloca el nuevo código al final de la función de fábrica antes de devolver la aplicación.

source: Initialize the Database File
es: Inicializar el archivo de la base de datos

source: Now that ``init-db`` has been registered with the app, it can be called using the ``flask`` command, similar to the ``run`` command from the previous page.
es: Ahora que ``init-db`` ha sido registrado con la aplicación, puede ser llamado usando el comando ``flask``, similar al comando ``run`` de la página anterior.

source: If you're still running the server from the previous page, you can either stop the server, or run this command in a new terminal. If you use a new terminal, remember to change to your project directory and activate the env as described in :doc:`/installation`. You'll also need to set ``FLASK_APP`` and ``FLASK_ENV`` as shown on the previous page.
es: Si todavía está ejecutando el servidor de la página anterior, puede detener el servidor o ejecutar este comando en un nuevo terminal. Si usas un nuevo terminal, recuerda cambiar al directorio de tu proyecto y activar la env como se describe en :doc:`/installation`. También necesitarás configurar ``FLASK_APP`` y ``FLASK_ENV`` como se muestra en la página anterior.

source: Run the ``init-db`` command:
es: Ejecuta el comando ``init-db``:

source: There will now be a ``flaskr.sqlite`` file in the ``instance`` folder in your project.
es: Ahora habrá un archivo ``flaskr.sqlite`` en la carpeta ``instance`` de tu proyecto.

source: Continue to :doc:`views`.
es: Continúa con :doc:`views`.

source: Deploy to Production
es: Despliegue en producción

source: This part of the tutorial assumes you have a server that you want to deploy your application to. It gives an overview of how to create the distribution file and install it, but won't go into specifics about what server or software to use. You can set up a new environment on your development computer to try out the instructions below, but probably shouldn't use it for hosting a real public application. See :doc:`/deploying/index` for a list of many different ways to host your application.
es: Esta parte del tutorial asume que tienes un servidor en el que quieres desplegar tu aplicación. Da una visión general de cómo crear el archivo de distribución e instalarlo, pero no entra en detalles sobre qué servidor o software utilizar. Puedes configurar un nuevo entorno en tu ordenador de desarrollo para probar las instrucciones de abajo, pero probablemente no deberías usarlo para alojar una aplicación pública real. Vea :doc:`/deploying/index` para una lista de diferentes maneras de alojar su aplicación.

source: Build and Install
es: Construir e instalar

source: When you want to deploy your application elsewhere, you build a distribution file. The current standard for Python distribution is the *wheel* format, with the ``.whl`` extension. Make sure the wheel library is installed first:
es: Cuando quieres desplegar tu aplicación en otro lugar, construyes un archivo de distribución. El estándar actual para la distribución de Python es el formato *wheel*, con la extensión ``.whl``. Asegúrate de que la biblioteca wheel está instalada primero:

source: Running ``setup.py`` with Python gives you a command line tool to issue build-related commands. The ``bdist_wheel`` command will build a wheel distribution file.
es: Ejecutar ``setup.py`` con Python le da una herramienta de línea de comandos para emitir comandos relacionados con la construcción. El comando ``bdist_wheel`` construirá un archivo de distribución wheel.

source: You can find the file in ``dist/flaskr-1.0.0-py3-none-any.whl``. The file name is in the format of {project name}-{version}-{python tag} -{abi tag}-{platform tag}.
es: Puedes encontrar el archivo en ``dist/flaskr-1.0.0-py3-none-any.whl``. El nombre del archivo tiene el formato de {nombre del proyecto}-{versión}-{etiqueta python} -{etiqueta abi}-{etiqueta de plataforma}.
